[
  {
    "_comentario": "ESTE É UM EXEMPLO - NÃO PREENCHER, APENAS REFERÊNCIA",
    "_arquivo_parte": "PARTE 4 - Contém artigos 39-45. Artigos 1-15 em artigos_part1.json, 16-27 em artigos_part2.json, 28-38 em artigos_part3.json",
    "numero": 0,
    "nome_arquivo": "nome_do_arquivo.pdf",

    "_comentario_artigos_grandes": "Para artigos muito grandes (>10 páginas ou erro 413 na API): 1) Dividir PDF em partes menores (ex: _parte01.pdf, _parte02.pdf); 2) Ler de 3 em 3 partes para não sobrecarregar contexto; 3) Criar arquivo artigoN_resumo.md com resumo detalhado de cada parte; 4) Após processar todas as partes, adicionar entrada resumida aqui no JSON. Exemplo: artigo 9 foi dividido em 8 partes e resumido em artigo9_resumo.md",

    "_comentario_identificacao": "Informações bibliográficas do artigo - NOMES DOS AUTORES DEVEM ESTAR COMPLETOS conforme aparecem no PDF",
    "autores": "Nome Completo; Nome Completo 2 (separados por ponto e vírgula)",
    "ano": 2024,
    "titulo": "Título completo do artigo",
    "subtitulo": "Subtítulo se houver",
    "journal": "Nome do periódico/conferência",
    "publisher": "Editora (Elsevier, IEEE, Springer, etc.)",

    "_comentario_conteudo": "Análise do conteúdo científico",
    "objetivo": "Objetivo principal do artigo - o que os autores buscam resolver/propor",
    "metodologia": "Métodos, algoritmos, arquiteturas e abordagens utilizadas",
    "analise_estatistica": "Métricas, testes estatísticos, tamanho de amostra, distribuições",
    "resultados": "Principais resultados quantitativos e qualitativos",
    "contribuicoes": "Contribuições originais do trabalho",
    "limitacoes": "Limitações identificadas pelos autores ou observadas",

    "_comentario_classificacao": "Classificação e categorização",
    "topico": "Palavras-chave principais (ex: Edge Computing, IoT, Machine Learning)",
    "area_aplicacao": "Domínios de aplicação (ex: Robótica, Veículos Autônomos, Indústria 4.0)",

    "_comentario_recursos": "Recursos práticos e reprodutibilidade",
    "tipo_dados": "Tipo de dados utilizados (ex: Imagens, Séries Temporais, Texto)",
    "dataset": "Nome dos datasets utilizados (se aplicável)",
    "frameworks": "Frameworks, bibliotecas e ferramentas utilizadas",
    "link_codigo": "URL do repositório de código (se disponível)"
  },
  {
    "numero": 39,
    "nome_arquivo": "Real-time embedded ECG anomaly detection system with comparative analysis of CWT-based transfer learning performance across electrode types.pdf",

    "autores": "Wissem Kharzi; Nacera Meziane; Hadjer Zairi; Malika Kedir Talha; Lotfi Madaoui; Oussama Kerdjidj",
    "ano": 2025,
    "titulo": "Real-time embedded ECG anomaly detection system with comparative analysis of CWT-based transfer learning performance across electrode types",
    "subtitulo": "",
    "journal": "Biomedical Signal Processing and Control",
    "publisher": "Elsevier",

    "objetivo": "Introduzir um sistema de assistência diagnóstica de ECG em tempo real baseado em eletrodos secos para melhorar o conforto do paciente e manter a qualidade do sinal. O sistema integra modelos de transfer learning com técnicas de continuous wavelet transform (CWT) para construir um modelo de reconhecimento robusto que extrai informações mais detalhadas que representações tradicionais no domínio do tempo, fornecendo análise comparativa abrangente de wavelets CWT e seu impacto na performance de diferentes arquiteturas de deep learning.",

    "metodologia": "Sistema embarcado all-in-one com quatro estágios: (1) Aquisição e processamento: eletrodos secos Orbital SilverBumps® (OR90) FDA-cleared para uso contínuo até 48h, conectados a módulo AD8232 (amplificação e filtragem analógica com high-pass integrado) e microcontrolador STM32F103C8T6 ARM (72 MHz, 53×22.5mm) com Fs=500Hz, filtro Butterworth 4ª ordem passa-baixa e filtro notch 50Hz, dados gravados via UART em CSV. (2) Conversão ECG: transformação de sinais 1D em escalogramas 2D usando CWT com três wavelets - Complex Morlet (Cmor), Mexican Hat (Mexh) e Shannon (Shan), segmentação em partes de 10 complexos PQRST. (3) Avaliação de modelos: benchmarking de 5 arquiteturas de transfer learning pré-treinadas em ImageNet - InceptionV3 (23.9M params, 299×299), Xception (22.9M params, 299×299), VGG16 (138M params, 224×224), VGG19 (144M params, 224×224), EfficientNetB0 (5.3M params, 224×224). Otimizador Adam com Lr=10⁻³ e Lr=10⁻⁴, 50 epochs, batch size 64. Arquitetura estendida: global average pooling + dense layer 1024 unidades ReLU + softmax. (4) Deployment: NVIDIA Jetson Nano com arquitetura paralela distribuindo funções em 4 cores - Core 0 (monitoramento, plots), Core 1 (aquisição serial 115200 baud), Core 2/3 (conversão CWT e classificação). Multiprocessing e multithreading para execução não-bloqueante. TensorFlow Lite para otimização.",

    "analise_estatistica": "Dois datasets: PTB Diagnostic ECG (PhysioNet) com 549 registros - 35% Normal (classe 0), 65% Abnormal (classe 1 incluindo infarto do miocárdio, cardiomiopatia, bundle branch block, disritmia, hipertrofia miocárdica, doença valvular, miocardite); NSIR Dataset (proprietário, LINS Laboratory USTHB Algeria) com 149 registros de voluntários saudáveis - 28.1% Normal (N), 42.2% ruído de contato de eletrodo (ECN), 29.5% interferência de linha de força 50/60Hz (PLI). Divisão estratificada: 80% treino, 10% validação, 10% teste (seed=37). Métricas: Precision, Accuracy, F1-Score, Recall, Loss (categorical cross-entropy), curvas ROC. Comparação sistemática de 3 wavelets × 5 modelos × 2 learning rates × 2 datasets = 60 configurações. Monitoramento de hardware: latência por função, uso de CPU por core, consumo de RAM, temperatura.",

    "resultados": "Melhor configuração: VGG19 + CMOR wavelet + Lr=10⁻⁴. Dataset NSIR (software): 100% em todas métricas (P, A, F, R), Loss=0.0107. Dataset PTB (software): P=99%, A=99.61%, F=99%, R=99%, Loss=0.0179. Deployment Jetson Nano: NSIR 99.87% accuracy, PTB 99.30% accuracy. CMOR wavelet captura melhor balanço entre componentes de alta e baixa frequência (P, QRS, T waves). MEXH wavelet mais sensível a ajustes de Lr. SHAN wavelet apresentou variabilidade significativa, métricas abaixo do threshold desejado com Lr alto. Estabilização do modelo após ~30 epochs. Lr=10⁻⁴ mostrou comportamento mais estável e robusto que Lr=10⁻³. Monitoramento hardware NSIR: Serial Acquisition 0.715ms (64% RAM), CWT+Classification 1.192ms (67.7% RAM, ~40°C), Plot Update 0.477ms. PTB apresenta maior latência CWT (2.86ms) e RAM (76.3%) devido a sinais patológicos com maior variabilidade morfológica. Comparação com literatura: sistema proposto alcança maior accuracy entre sistemas baseados em hardware (99.87% vs 98.82% FPGA, 97.34% FPGA, 95% FPGA, 81.21% Raspberry Pi).",

    "contribuicoes": "1) Sistema embarcado all-in-one integrando aquisição de sinal, processamento e interpretação inteligente com eletrodos secos OR90 para diagnóstico ECG em tempo real. 2) Benchmarking comparativo abrangente de 3 wavelets CWT (CMOR, MEXH, SHAN) com 5 modelos de transfer learning (InceptionV3, VGG16, VGG19, Xception, EfficientNetB0) em 2 datasets. 3) Identificação de configuração ótima: VGG19 + CMOR wavelet + Lr=10⁻⁴ com 99.87% accuracy no hardware. 4) Arquitetura de sistema paralelo em tempo real com multiprocessing/multithreading distribuindo tarefas em 4 cores do Jetson Nano. 5) Dataset NSIR proprietário para detecção de anomalias de hardware (ruído de eletrodo, interferência de linha de força) disponibilizado publicamente. 6) Demonstração de viabilidade de eletrodos secos com qualidade de sinal comparável a eletrodos gel, reduzindo irritação cutânea de 8.7% para 2.3% em uso de 48h. 7) Performance superior a sistemas embarcados existentes (FPGA, Raspberry Pi) com eficiência energética (5V, até 4A).",

    "limitacoes": "Sistema utiliza apenas ECG single-lead, não fornecendo visão tão abrangente quanto sistemas multi-lead. Detecção de anomalias de hardware e detecção de doenças são tratadas separadamente, podendo ser otimizadas em modelo único. Jetson Nano com apenas 4GB RAM limita monitoramento prolongado e processamento de alta frequência. Dataset NSIR necessita expansão para melhorar generalização dos resultados. Sinais patológicos do PTB introduzem maior latência e uso de RAM devido a variações morfológicas e componentes de alta frequência. Para aplicações mais demandantes, upgrade para Jetson Xavier ou Orin seria necessário.",

    "topico": "ECG Anomaly Detection, Transfer Learning, Continuous Wavelet Transform (CWT), Dry Electrodes, Real-time Systems, Edge Computing, Embedded Systems, Deep Learning, Convolutional Neural Networks (CNN), VGG19, InceptionV3, Xception, EfficientNetB0, Scalogram, Complex Morlet Wavelet, Mexican Hat Wavelet, Shannon Wavelet, Multiprocessing, Multithreading, Signal Processing, Cardiac Monitoring, Arrhythmia Detection, Hardware Anomaly Detection",
    "area_aplicacao": "Cardiac Diagnostics, ECG Monitoring, Telemedicine, Ambulatory Monitoring, Point-of-Care Diagnostics, Wearable Health Devices, Clinical Decision Support, Cardiovascular Disease Detection, Remote Patient Monitoring, Edge AI in Healthcare",

    "tipo_dados": "Sinais ECG (1D temporal e 2D escalogramas CWT), métricas de monitoramento de hardware (latência, uso de CPU/RAM, temperatura)",
    "dataset": "PTB Diagnostic ECG Database (PhysioNet, 549 registros), NSIR Dataset (proprietário, 149 registros de voluntários saudáveis com sinais normais e interferências)",
    "frameworks": "TensorFlow, Keras, TensorFlow Lite, TensorRT 8.0.1.6, CUDA 10.2, cuDNN, PyWavelets, Visual Studio Code, NVIDIA Jetson Nano Developer Kit (128-core Maxwell GPU, ARM Cortex-A57 quad-core, 4GB LPDDR4), STM32F103C8T6 ARM microcontroller (72 MHz), AD8232 ECG module, Orbital SilverBumps® OR90 dry electrodes, Linux Ubuntu 20.04, Python, UART serial communication",
    "link_codigo": "https://github.com/kharzi-wissem/ReadDryEcgData.git (dataset guide)"
  },
  {
    "numero": 40,
    "nome_arquivo": "Remote safety system for a robot tractor using a monocular camera and a YOLO-based method.pdf",

    "autores": "Sixun Chen; Noboru Noguchi",
    "ano": 2023,
    "titulo": "Remote safety system for a robot tractor using a monocular camera and a YOLO-based method",
    "subtitulo": "",
    "journal": "Computers and Electronics in Agriculture",
    "publisher": "Elsevier",

    "objetivo": "Desenvolver um sistema de segurança remoto para suportar o monitoramento de múltiplos tratores-robô agrícolas usando câmera monocular como dispositivo de entrada de imagem e modelo YOLO de deep learning como detector de humanos e tratores. O sistema visa atender às diretrizes de segurança do Ministério da Agricultura, Silvicultura e Pesca do Japão (MAFF) para navegação autônoma de máquinas agrícolas, permitindo que um único operador humano monitore múltiplos robôs trabalhando simultaneamente em campos diferentes localizados a grandes distâncias físicas.",

    "metodologia": "Sistema de segurança remoto com dois componentes principais: (1) Parte do trator: Kubota MR1000A (Crawler) equipado com câmera KODAK PIXPRO 4KVR360 (1280×720 pixels, 32 FPS), montada a 2.6m de altura com ângulo de 30°; NUC Intel Core i5-10210U para relay de dados; GNSS com CLAS (centimeter-level augmentation service) e IMU VN100 para localização; LiDAR 2D Hokuyo UTM-30LX (270° scan, 30m máx, 25ms) conectado diretamente ao controlador como dispositivo de segurança local. (2) Parte remota: workstation ThinkPad P71 com Intel Xeon E3-1535M V6, 64GB RAM, GPU NVIDIA Quadro P4000 (8GB) para processamento de imagens via YOLOv5s. Comunicação TCP via internet (Wi-Fi). Detector YOLOv5s treinado no framework PyTorch com backbone CSPDarknet; dataset de treinamento: 4366 imagens humanas do MS COCO + 1430 imagens de tratores/humanos auto-coletadas expandidas para 5400 via data augmentation (rotação, inversão, escala, mosaic). Treinamento: Nvidia Geforce RTX 3070 (8GB), Windows 10. Método de posicionamento Perspective-n-Point (PNP) para converter coordenadas de pixel para coordenadas do mundo usando 4 pontos de controle no solo medidos via RTK-GPS. Correção estatística de erro de posicionamento humano usando Q-Q plot para verificar distribuição normal e t-test para comparar intervalos adjacentes, resultando em 5 intervalos de correção de pixel no range de 15m. Zonas de segurança: L1=8m (zona de parada visual), L2=4m (zona de desaceleração visual), R=5.5m (zona de parada LiDAR), W=3.2m (largura visual). Safety index de 0-3 determina ação do trator: normal/desacelerar para 3.6 km/h/parar com alarme.",

    "analise_estatistica": "Q-Q plot (quantile-quantile plot) para verificar se distribuições de desvio em cada intervalo de 1m obedecem distribuição normal. Two-sample t-test para cada intervalo adjacente comparando médias populacionais (H0: μ1=μ2, H1: μ1≠μ2), com p-value < 0.05 indicando diferença significativa. 158 ground truths rotulados manualmente para análise de desvio de bounding box. Intervalos significativamente diferentes em 13m, 10m, 8m e 6m (p<0.05), resultando em 5 intervalos mesclados para correção: [15,13), [13,10), [10,8), [8,6), [6,3.5). Métricas de detecção: mAP (mean Average Precision) = (1/c)∑AP_i, AP = ∫Precision(Recall)dR, Precision = TP/(TP+FP), Recall = TP/(TP+FN). RMS error para erro de posicionamento. Experimentos de frenagem medidos 3-5 vezes por condição para calcular médias. Comparação de performance em diferentes ambientes de rede (5G vs LTE) medindo tempo e distância de frenagem.",

    "resultados": "Detector YOLOv5s: mAP=87.3%, AP_person=84.7%, AP_tractor=89.9%, 32 FPS (vs YOLOv3 87.4%/18 FPS, Faster R-CNN 89.7%/8 FPS). Taxa de detecção 0.98 em 500 imagens de teste na ROI. Posicionamento humano: RMS error=0.403m, erro relativo médio=2.6% a 15m, erro máximo=0.77m a 15m, erro relativo máximo ~5%. Frenagem visual: tempo médio=3.5s, distância=7.4m a velocidade máxima 8.8 km/h. Frenagem LiDAR: tempo=2.1s, distância=3.7m. Experimentos de campo 2022-2023: 100% de taxa de sucesso na detecção de obstáculos em 22 experimentos (178 intrusões totais, 178 detecções bem-sucedidas) com até 4 tratores monitorados simultaneamente, distâncias de até 730km (Sapporo-Noto). Performance de rede: 5G (264/126 Mbps down/up) - frenagem 3.5s/7.4m; LTE (317/20 Mbps) - 3.6s/10.2m; LTE (30/10 Mbps) - 3.5s/11m. Upload speed impacta distância de frenagem, download tem impacto mínimo. Detecção multi-alvo: erros de predição de condição de segurança em 3-8s, 12s e 27-30s de vídeo de 30s devido a oclusão efetiva.",

    "contribuicoes": "1) Sistema de segurança remoto para monitoramento de múltiplos tratores-robô via internet, não restrito por distância física (validado até 730km). 2) Método de correção estatística de erro de posicionamento usando Q-Q plot e t-test para criar intervalos de correção de pixel por distância. 3) Fusão de sistemas de segurança visual (câmera+YOLO) e LiDAR 2D, onde LiDAR serve como camada final de segurança independente de rede. 4) Processamento remoto eliminando necessidade de computadores de alto desempenho em cada trator operando em ambientes hostis (alta temperatura, vibração, poeira). 5) Sistema de baixo custo usando câmera monocular e LiDAR 2D (vs câmeras de profundidade e LiDAR 3D). 6) Definição de zonas de segurança baseada em experimentos de frenagem e critérios de colisão com pedestres a 5 km/h do MLIT do Japão. 7) Demonstração de viabilidade em múltiplas plataformas de robôs agrícolas (Kubota MR1000A crawler/wheel, Yanmar EG105/EG83). 8) Análise de impacto de ambiente de rede (5G vs LTE) na performance de segurança remota.",

    "limitacoes": "Precisão limitada no posicionamento de tratores - tamanho maior que humanos causa erros significativos usando pixel único; modelo ocasionalmente detecta apenas trator sem implementos ou separa cálculos do implemento e trator. Necessidade de keypoint detection e reanotação para melhorar posicionamento de tratores. Range de objetos de localização visual limitado a apenas humanos e tratores; outros obstáculos dependem do LiDAR. Suscetibilidade a restrições de ambiente de rede - upload speed insuficiente causa atrasos na transmissão de imagens e recebimento de comandos. Oclusão causa detecções perdidas ou alarmes falsos em cenários multi-alvo. Alvos pequenos além de 15m podem não ser detectados devido à menor capacidade do YOLO para alvos de pequena escala. Dependência de conectividade internet; linkage com dispositivos de segurança locais (LiDAR) é essencial para mitigar riscos de delay de rede.",

    "topico": "Robot Tractor, Remote Control, Monocular Camera, Deep Learning, Obstacle Detection, YOLO, YOLOv5, Object Detection, CNN, Perspective-n-Point (PNP), Camera Calibration, Q-Q Plot, t-test, Statistical Error Correction, LiDAR, Safety Systems, Autonomous Navigation, Agricultural Robotics, Multi-Robot Systems, Real-time Detection, TCP Communication, Data Augmentation, Mosaic Augmentation, Bounding Box Detection, Safety Zones",
    "area_aplicacao": "Agricultural Robotics, Autonomous Farming, Robot Tractor Safety, Remote Monitoring Systems, Precision Agriculture, Multi-Robot Coordination, Agricultural Machinery Automation, Human-Robot Safety, Smart Farming, Field Operations Monitoring",

    "tipo_dados": "Imagens RGB (1280×720 pixels), dados de posição RTK-GPS, distâncias LiDAR 2D (TOF), coordenadas de bounding box, safety index (0-3)",
    "dataset": "MS COCO (4366 imagens humanas selecionadas), Dataset auto-coletado (1430 itens de tratores/humanos expandidos para 5400 via augmentation), Vídeos de tratores-robô do VeBots Laboratory da Hokkaido University",
    "frameworks": "PyTorch (YOLOv5s), Darknet (YOLOv3), Faster R-CNN (ResNet50), OpenCV, RTK-GPS, TCP/IP, NVIDIA Quadro P4000, Intel NUC Core i5-10210U, Hokuyo UTM-30LX LiDAR, KODAK PIXPRO 4KVR360 camera, VN100 IMU, Trimble Alloy GNSS, Arduino (alarm), Windows 10, Mobile WiFi (LTE/5G), Multi-Access Edge Computing (MEC)",
    "link_codigo": "Não disponível (Data will be made available on request)"
  },
  {
    "numero": 41,
    "nome_arquivo": "Research on passive adaptive wall-climbing cleaning and inspection robot of marine cylindrical steel structure based on conical magnetic adsorption wheel_parte01.pdf",

    "autores": "Gaosheng Luo; Chuankun Luo; Shimin Gao; Jingxiang Xu; Xuteng Bao; Zhiqiang Ma; Zhe Jiang",
    "ano": 2024,
    "titulo": "Research on passive adaptive wall-climbing cleaning and inspection robot of marine cylindrical steel structure based on conical magnetic adsorption wheel",
    "subtitulo": "",
    "journal": "Ocean Engineering",
    "publisher": "Elsevier",

    "objetivo": "Propor um robô de limpeza e inspeção escalador de parede com adsorção magnética que pode se mover livremente na parede de estruturas cilíndricas de aço de plataformas offshore e se adaptar passivamente a estruturas cilíndricas com várias curvaturas e diâmetros. O robô visa realizar limpeza de crescimento marinho e detecção de defeitos estruturais em estruturas subaquáticas de instalações offshore como turbinas eólicas offshore, plataformas Jacket e plataformas Jack-up.",

    "metodologia": "Robô escalador de parede com adsorção magnética composto por: (1) Estrutura adaptativa passiva de dois graus de liberdade conectando rodas dianteiras direcionais ao corpo do robô, permitindo rotação em torno dos eixos X (β∈[-180°,180°]) e Z (α∈[-20.5°,20.5°]) para adaptar-se a diferentes curvaturas superficiais. (2) Rodas cônicas de adsorção magnética com ímãs permanentes NdFeB N52 (Br=1.43-1.48T, Hcb≥876kA/m, BH=398-422KJ/m³) embutidos em configuração de magnetização axial oposta para melhorar utilização dos ímãs; anel de aço 1Cr17Ni2 em ambos os lados do ímã central; pneu externo de alumínio recartilhado. (3) Análise de estabilidade estática baseada no princípio de D'Alembert considerando três modos de falha críticos: deslizamento (Case 1), capotamento frontal/traseiro (Case 2), tombamento lateral (Case 3). Cargas consideradas: gravidade (52kg), empuxo (190.9N), força de corrente oceânica (336.3N a 1.25m/s), reação do jato de água (115.9N a 50MPa, 22L/min). (4) Simulação de campo magnético comparando magnetização axial vs radial usando equações de Maxwell e tensor de stress de Maxwell. (5) Modelagem matemática da relação entre gap de ar (Sk), ângulo do cone (α), diâmetro da estrutura cilíndrica (D) e força de adsorção magnética. (6) Otimização paramétrica do ângulo do cone variando de 7° a 11° para maximizar força de adsorção e razão τ=Fmm2/Fmm1. (7) Sistema de limpeza com jato de água ultra-alta pressão (50MPa, 22L/min) e jato de cavitação (20MPa, 67L/min). (8) Sistema de monitoramento com câmera e lâmpada de compensação em pan-tilt de dois graus de liberdade.",

    "analise_estatistica": "Análise estática para determinar força mínima de adsorção magnética considerando ângulo de inclinação θ∈[0°,90°]. Força mínima crítica Fmmin1 (não deslizamento) varia com θ, atingindo máximo de 788.2N em θ=33.4°; 681.1N em θ=0°; 492.9N em θ=90°. Força mínima Fmmin2 (não capotamento frontal) atinge máximo de 241.6N em θ=45.3°. Força mínima Fmmin3 (não tombamento lateral) atinge máximo de 239.6N em θ=46.7°. Coeficiente de atrito μ=0.18 (seco: 0.75, úmido: 0.2 medidos experimentalmente). Comparação simulação vs experimento: razão medido/teórico n=0.71-0.88, média 0.80. Parâmetro δ (razão força em γ=0° e γ=90°) analisado para diâmetros de 280mm a 2000mm, mínimo em D=1000mm. Parâmetro τ (razão Fmm2/Fmm1) aumenta com ângulo do cone de 1.4 (β=7°) a 2.0 (β=11°). Tração de pico: 131kg (seco), 34.8kg (úmido) com força de adsorção de 174kg por roda.",

    "resultados": "Especificações do robô: 782×495×326mm (L×W×H), peso seco 52kg, capacidade de carga ≤109kg, velocidade máxima 0.5m/s, comunicação RS485/CAN. Magnetização axial: força máxima 726.2N, campo magnético máximo 7.525T. Magnetização radial: força máxima 378.7N, campo magnético máximo 10.146T - diferença devido ao circuito magnético mais longo e maior fuga de fluxo na radial. Força mínima de adsorção magnética por roda: 867N (fator de segurança 1.1). Ângulo ótimo do cone: 9° balanceando mobilidade e facilidade de desmontagem. Em superfície plana (espessura 5mm): força de adsorção 1223.6N, intensidade de campo 3.3T. Parâmetros estruturais da roda cônica: L1=30mm, L2=50mm, L3=20mm, D1=80mm, D2=127.88mm, D3=135.66mm, D4=143.76mm. Experimentos de mobilidade bem-sucedidos em estruturas cilíndricas de diâmetros: 600mm, 750mm, 900mm, 1000mm, 1800mm (subaquático em estrutura T-type). Testes de limpeza atmosférica e subaquática com jato de alta pressão (50MPa) e jato de cavitação (20MPa) sem deslizamento. Eficiência de limpeza em plataforma offshore real: 197 m²/h. Coeficiente de correção experimental: 0.80 (média).",

    "contribuicoes": "1) Robô escalador de parede com adsorção magnética cônica baseado em estrutura adaptativa passiva de dois graus de liberdade, permitindo adaptação automática a estruturas cilíndricas de curvaturas variáveis. 2) Modelo de falha estática completo considerando deslizamento, capotamento e tombamento sob cargas de gravidade, empuxo, corrente oceânica e reação de jato de água. 3) Análise comparativa de magnetização axial vs radial demonstrando superioridade da axial (726.2N vs 378.7N) devido a menor fuga de fluxo. 4) Modelagem matemática da relação entre gap de ar, ângulo do cone e força de adsorção magnética. 5) Otimização do ângulo do cone (9°) balanceando força de adsorção, mobilidade e facilidade de desmontagem. 6) Design de roda cônica magnética mais compacta e leve que rodas cilíndricas convencionais, com melhor atenuação de força magnética a 90°. 7) Validação experimental em estruturas cilíndricas de 280mm a 1800mm de diâmetro, incluindo testes subaquáticos. 8) Demonstração de limpeza em plataforma offshore real com eficiência de 197 m²/h.",

    "limitacoes": "Coeficiente de correção simulação/experimento (0.71-0.88) indica erros de fabricação, especialmente na espessura da manga de poliuretano que aumenta o gap de ar. Trabalho futuro inclui: ímãs permanentes em forma de leque baseados em array Halbach para reduzir peso e fuga de fluxo; posicionamento usando sonar, IMU e dados visuais; construção de mapa local e algoritmo de planejamento de caminho automático; sonar de evitação de obstáculos; experimentos de erosão em jatos de água; experimentos de limpeza em amostras biológicas marinhas; dispositivo experimental de jato visual subaquático para observar e registrar processo de limpeza; otimização de parâmetros estruturais do bocal para melhorar eficiência de limpeza.",

    "topico": "Wall-Climbing Robot, Magnetic Adsorption, Conical Magnetic Wheel, Passive Adaptive Structure, Offshore Platform Inspection, Marine Structure Cleaning, Permanent Magnet (NdFeB), Magnetic Circuit Design, Axial Magnetization, Static Stability Analysis, Maxwell Stress Tensor, Air Gap Optimization, Cylindrical Structure, High-Pressure Water Jet, Cavitation Jet, Underwater Robotics, Four-Wheel Independent Drive, Two-Degree-of-Freedom Mechanism, Magnetic Field Simulation, Surface Adaptability",
    "area_aplicacao": "Offshore Platform Maintenance, Marine Structure Inspection, Underwater Cleaning, Wind Turbine Foundation Inspection, Jacket Platform Cleaning, Jack-up Platform Maintenance, Ship Hull Inspection, Steel Structure NDT (Non-Destructive Testing), Subsea Infrastructure Maintenance, Biofouling Removal, Corrosion Detection",

    "tipo_dados": "Força de adsorção magnética (N), intensidade de campo magnético (T), ângulos de rotação (graus), diâmetros de estruturas cilíndricas (mm), coeficientes de atrito, parâmetros geométricos de rodas cônicas",
    "dataset": "Não aplicável - experimentos com protótipo físico em estruturas cilíndricas de aço Q235 com espessura de 5mm",
    "frameworks": "ANSYS Maxwell (simulação de campo magnético), equações de Maxwell para cálculo teórico de força de adsorção, princípio de D'Alembert para análise estática, fórmula de Newton-Leibniz para cálculo de gap de ar, jato de água ultra-alta pressão (50MPa, 22L/min), jato de cavitação (20MPa, 67L/min)",
    "link_codigo": "Não disponível (dados suplementares em https://doi.org/10.1016/j.oceaneng.2024.119676)"
  },
  {
    "numero": 42,
    "nome_arquivo": "Response-time analysis of mesh-based many-core systems.pdf",

    "autores": "David García Villaescusa; Mario Aldea Rivas; Michael González Harbour",
    "ano": 2023,
    "titulo": "Response-time analysis of mesh-based many-core systems",
    "subtitulo": "",
    "journal": "Journal of Systems Architecture",
    "publisher": "Elsevier",

    "objetivo": "Apresentar um modelo de escalonabilidade para sistemas many-core baseados em rede 2D mesh Network-on-Chip (NoC) e store-and-forward switching, com limitação na taxa máxima de utilização de links que torna a análise tratável. O modelo visa analisar aplicações compostas por fluxos end-to-end (e2e) periódicos ou esporádicos, cada fluxo composto por uma sequência linear de passos de computação (threads) estaticamente mapeados em cores e ativados pelo passo predecessor.",

    "metodologia": "Modelo de escalonabilidade baseado no MAST (Modeling and Analysis Suite for Real-Time Applications) com análise offset-based response time. Elementos do modelo: (1) Recursos de processamento PRxy representando cada core com coordenadas na mesh. (2) Fluxos e2e Γi compostos por steps τij com WCET Cij, BCET Cbij, prioridade prioij e PR atribuído. (3) Mensagens mijk com taxa de geração ρijk (cycles⁻¹), número de pacotes μijk, tipo tijk (read/write/write-back) e destino dijk. (4) Parâmetros da NoC: frequência FNoC, latência por hop LH, latência de arbitração LR. Restrição de taxa máxima: Pxy→x'y' ≤ 1/LR para todo link, evitando back-pressure e simplificando análise de interferência. Cálculo de tempo de travessia: TTbijk = LH·Hijk (best-case), TTijk = TTbijk + Iijk (worst-case com interferência de arbitração round-robin). Plataforma de validação: processador Epiphany III many-core (16 cores em mesh 4×4 2D, 600MHz, 32KB memória local por core) na placa Parallella. NoCs independentes: cMesh (escrita, LRw=1 ciclo), rMesh (leitura, LRr=8 ciclos), xMesh (off-chip). Roteamento XY determinístico. RTOS M2OS-mc desenvolvido com scheduling não-preemptivo de prioridade fixa. Mecanismos de sincronização implementados: Sampling Ports (SP) para leitura/escrita de único elemento com sobrescrita, Queuing Ports (QP) baseados em fila FIFO circular com bloqueio. Primitiva mutex do Epiphany para exclusão mútua.",

    "analise_estatistica": "Comparação de tempos de resposta entre modelo MAST e execução real no processador Epiphany. Exemplo simples (2 fluxos e2e, 3 tarefas cada): WCRT calculado vs medido para Γ1 (τ11: 5000ns vs 5208ns, τ12: 19010ns vs 19010ns, τ13: 26019ns vs 26019ns). Exemplo com Sampling Port: τ11 WCRT 5430ns vs medido 5208ns (avg 5048ns), τ12 WCRT 8985ns vs medido 8703ns (avg 8225ns). Exemplo com Queuing Port (3 fluxos e2e): Γ1 τ11 WCRT 57779ns vs max 35305ns, τ12 WCRT 85039ns vs max 71015ns, τ13 WCRT 100774ns vs max 84990ns; Γ2 τ21 WCRT 57790ns vs max 20172ns, τ22 WCRT 85235ns vs max 55698ns, τ23 WCRT 96184ns vs max 64113ns; Γ3 τ31 WCRT 21690ns vs max 20007ns, τ32 WCRT 72598ns vs max 67868ns. Comparação com modelo Tobuschat [12]: WCRT modelo proposto 8 ciclos vs Tobuschat ~70 ciclos vs iSLIP ~12.5 ciclos - demonstrando menor pessimismo. Análise de impacto da restrição de taxa máxima: exemplo com 24 fluxos (96 tarefas) acomodados em mesh 4×4 sem violar restrição, demonstrando que limitação não é restritiva para sistemas de alta carga computacional e comunicacional.",

    "resultados": "Modelo MAST aplicado ao Epiphany III (16 cores, mesh 4×4, 600MHz). Parâmetros NoC: FNoC=600MHz, LH=1.5 ciclos, LRw=1 ciclo (cMesh), LRr=8 ciclos (rMesh). Taxa máxima de geração de pacotes: memcopy 1/3 cycle⁻¹, atribuições consecutivas 1/2 cycle⁻¹. Validação experimental confirma que tempos medidos são limitados pelos WCRTs calculados pelo modelo. Análise demonstra capacidade de suportar até 48 mensagens por ciclo NoC sem violar restrição de taxa máxima. Mecanismos de comunicação modelados: Sampling Port (write: lock mutex + write data + set new + unlock; read: lock mutex + read data + read new flag + unlock), Queuing Port (write/read com verificação de fila cheia/vazia e bloqueio). Tempos de bloqueio incluídos na análise: Bw (write operation) e Br (read operation). Cálculo de WCET efetivo: C'ij = Cij + Σ(Iijk + Iij(k+1)) + Bwi(j-1) + Bri(j+1). Sistema é escalonável se Ri ≤ Di para todo fluxo e2e. Código M2OS-mc disponível publicamente.",

    "contribuicoes": "1) Técnica de modelagem e análise que permite estudar comportamento de rede e tarefas através de limitação na taxa máxima de utilização de links, evitando back-pressure e simplificando análise de interferência inter-mensagens (problema NP-hard). 2) Modelagem de mecanismos de comunicação de alto nível (Sampling Ports e Queuing Ports) fornecidos pelo sistema operacional, incluindo análise temporal de operações read/write com exclusão mútua via mutex. 3) Aplicação e validação em plataforma real (Epiphany III many-core, 16 cores em mesh 4×4 2D) usando RTOS M2OS-mc desenvolvido pelos autores. 4) Demonstração de menor pessimismo comparado a trabalhos relacionados (8 ciclos vs ~70 ciclos de Tobuschat et al.). 5) Algoritmo completo para conversão de sistema many-core em modelo MAST (Listings 5-7). 6) Análise de que a restrição de taxa máxima não é limitante significativa mesmo em sistemas de alta carga (exemplo com 96 tarefas em mesh 4×4).",

    "limitacoes": "Modelo assume que tasks enviam mensagens apenas ao final de sua execução (simplificação para modelagem). Apenas fluxos e2e lineares são considerados (multi-path flows com múltiplos sucessores/predecessores não abordados). Memória compartilhada externa (DDR3L SDRAM no lado leste da mesh) não é modelada. Acesso I/O síncrono do processador Epiphany não implementado. Algoritmo de alocação de tarefas para otimizar performance de tempo de resposta deixado como trabalho futuro. Validação realizada apenas em mesh 4×4 (16 cores) - escalabilidade para meshes maiores (ex: Epiphany V com 1024 cores) não demonstrada experimentalmente. Back-pressure evitada por restrição de taxa, mas sistemas que não atendem restrição não são analisáveis pelo modelo.",

    "topico": "Real-Time Systems, Schedulability Analysis, Network-on-Chip (NoC), Many-Core Processors, 2D Mesh Network, Store-and-Forward Switching, Response Time Analysis, WCRT (Worst-Case Response Time), MAST (Modeling and Analysis Suite), Offset-Based Analysis, End-to-End Flows, Task Scheduling, Fixed Priority Non-Preemptive Scheduling, Inter-Process Communication, Sampling Ports, Queuing Ports, Mutex Synchronization, Back-Pressure Avoidance, Packet Routing, XY Routing, Round-Robin Arbitration, Link Utilization, Message Passing, RTOS (Real-Time Operating System)",
    "area_aplicacao": "Embedded Real-Time Systems, Many-Core Computing, Parallel Processing, Safety-Critical Systems, Cyber-Physical Systems, High-Performance Embedded Computing, Multiprocessor Systems-on-Chip (MPSoC), Industrial Automation, Automotive Electronics, Aerospace Systems, Telecommunications",

    "tipo_dados": "Tempos de execução (WCET/BCET) em nanosegundos/ciclos, tempos de resposta (WCRT/BCRT), taxas de geração de pacotes (cycles⁻¹), latências de travessia de NoC, parâmetros de fluxos e2e (período, deadline), mapeamento de tarefas em cores",
    "dataset": "Não aplicável - experimentos com cargas de trabalho sintéticas executadas em hardware real (Parallella board com Epiphany III)",
    "frameworks": "MAST (Modeling and Analysis Suite for Real-Time Applications), M2OS-mc (RTOS para many-core desenvolvido pelos autores), Epiphany Hardware Utility Library (eLib), GCC (compilador), OpenMP, MPI, Parallella SDK",
    "link_codigo": "https://m2os.unican.es/ (M2OS-mc RTOS com GPLv3+), https://marte.unican.es/ (MaRTE OS)"
  },
  {
    "numero": 43,
    "nome_arquivo": "Robust ELM-PID tracing control on autonomous mobile robot via transformer-based pavement crack segmentation_parte01.pdf",

    "autores": "Jianqi Zhang; Xu Yang; Wei Wang; Ioannis Brilakis; Diana Davletshina; Hainian Wang",
    "ano": 2025,
    "titulo": "Robust ELM-PID tracing control on autonomous mobile robot via transformer-based pavement crack segmentation",
    "subtitulo": "",
    "journal": "Measurement",
    "publisher": "Elsevier",

    "objetivo": "Propor um framework de rastreamento de trincas em pavimentos para selagem automática, integrando uma rede de segmentação baseada em Transformer (ViT-S2T) com controlador ELM-PID (Extreme Learning Machine-PID) para ajuste adaptativo de parâmetros de controle. O framework visa resolver dois desafios críticos: a perda de features de trincas delgadas durante convolução (causando trajetórias fragmentadas) e os grandes erros de rastreamento causados pela calibração manual de parâmetros PID.",

    "metodologia": "Framework com dois ramos principais: (1) Rede ViT-S2T para segmentação de trincas: módulo TFEM (Transformer-based Feature Extraction Module) substitui backbone CSPDarknet53 do YOLOv5 com multi-head self-attention para capturar features globais e locais; módulo ISM (Incoherent Segmentation Masks) com design cascaded usando 4 kernels convolucionais 3×3 para upsampling e fusão de máscaras de baixa resolução com features de alta resolução. Loss function: Lcls + Lobj + Lbbox (CIoU) + Lmask (BCE). (2) Controlador ELM-PID: rede ELM com 6 nós de entrada [u(k), y(k)], 18 nós ocultos, 3 nós de saída [x(k), y(k), ω(k)]; parâmetros iniciais Kp=10, Ki=1, Kd=0.01; ajuste online via backpropagation com taxa de aprendizado η e coeficiente de momentum α∈(0,1); algoritmo PID incremental com função custo E(k)=½e²(k). Hardware: treinamento em Intel Core i9-13900KF (5.80GHz, 6 cores, 32GB RAM) + NVIDIA RTX 4090 (24GB); robô móvel autônomo com Nvidia Jetson AGX Xavier (512 CUDA cores, 64 tensor cores, ARM CPU v8.2, 32GB DDR4), câmera Intel RealSense D435i RGB-D, ROS Melodic, PyTorch 1.8, Ubuntu 18.04, Jetpack 4.4. Treinamento: SGD optimizer, 300 epochs, momentum 0.8, weight decay 0.0001, learning rate inicial 0.01. Frequência de amostragem do controlador: 50ms. Máximo de 80 iterações para algoritmos de controle.",

    "analise_estatistica": "Métricas de segmentação: Precision, Recall, mAP@0.5, mAP@0.5:0.95. Métricas de controle: MAX (erro máximo), RMSE (root mean square error), MAE (mean absolute error), função objetivo J, rise time, settling time, número de iterações. Comparação de 5 modelos de segmentação (YOLOv5, YOLACT-700, SOLO, S2TNet, ViT-S2T) em 4 pretrained models (n, s, m, x). Comparação de 6 controladores (PID, ZN-PID, BPSO-PID, Fuzzy PID, CEAFC, ELM-PID) com 3 tipos de referência (step, slope, first-order linear) e 3 cenários de trincas (slender #1, curved #2, discontinuous #3). Ablation study comparando TFEM, ISM e TFEM+ISM. Análise de performance em tempo real: FPS, velocidade linear/angular (RMSE, MAE), latência.",

    "resultados": "Segmentação (S2TCrack dataset): ViT-S2T alcança Precision=82.76%, Recall=72.34%, mAP@0.5=75.63%, mAP@0.5:0.95=26.53%. Melhorias vs YOLOv5: +17.37% Precision, +13.7% Recall, +8.39% mAP@0.5. Ablation: TFEM+ISM superior em +3.23% (DeepCrack), +5.82% (CFD), +10.28% (S2TCrack) vs baseline. Controle step reference: ELM-PID J=30.53 (melhor), 4 iterações, rise time=0.5s, settling time=2.8s. Slope reference: ELM-PID J=66.51, 22 iterações, rise time=8s, settling time=8.1s. First-order linear: ELM-PID J=75, 41 iterações. Crack #1 (slender, ViT-S2T): ELM-PID MAX=17.6mm, RMSE=3.94mm, MAE=4.48mm (vs PID RMSE=10.81mm). Crack #2 (curved): ELM-PID MAX=20.31mm, RMSE=4.19mm, MAE=5.23mm (vs PID MAX=75.73mm). Crack #3 (discontinuous): ELM-PID MAX=24.95mm, RMSE=5.42mm, MAE=5.49mm. Performance em tempo real: ViT-S2T 67.72 FPS (+39.73 vs YOLOv5, +26.83 vs S2TNet). Velocidade de rastreamento: linear RMSE=0.0489m/s, MAE=0.0513m/s; angular RMSE=0.4164rad/s, MAE=0.1717rad/s.",

    "contribuicoes": "1) Framework robusto de rastreamento de trincas para selagem automática integrando segmentação baseada em Transformer com controle neural-PID. 2) Rede ViT-S2T com TFEM (multi-head self-attention para features globais/locais) e ISM (upsampling cascaded para segmentação fina de trincas delgadas). 3) Controlador ELM-PID combinando Extreme Learning Machines com PID para ajuste adaptativo online de parâmetros Kp, Ki, Kd através de capacidades de auto-aprendizado da rede. 4) Validação abrangente em 3 datasets desafiadores (DeepCrack, CFD, S2TCrack) demonstrando state-of-the-art em precisão e robustez. 5) Implementação em robô móvel autônomo proprietário com computação de borda (Jetson AGX Xavier) para rastreamento visual em tempo real. 6) Demonstração de menor erro de rastreamento e convergência mais rápida que controladores PID, ZN-PID, BPSO-PID, Fuzzy PID e CEAFC.",

    "limitacoes": "Foco em features de trincas individuais - não aborda cenários mais complexos como trincas múltiplas ou intersectantes. Ambiente de fundo das trincas selecionado é relativamente ideal. Performance de rastreamento em tempo real ainda limitada com alguns delays presentes. Trabalhos futuros: trincas com topologia complexa; experimentos sob várias condições de perturbação em ambientes de pavimento; investigação mais profunda da integração de modelos de deep learning embarcados com métodos de controle otimizado; incorporação de dispositivos de reparo no robô para selagem automática de trincas.",

    "topico": "Pavement Crack Tracing, ELM-PID Control, Extreme Learning Machines, Transformer-based Crack Segmentation, Vision Transformer (ViT), Embedded Deep Learning, Autonomous Mobile Robot, YOLOv5, Instance Segmentation, Multi-Head Self-Attention, PID Parameter Tuning, Neural Network Control, Backpropagation, Adaptive Control, Road Maintenance Automation, Computer Vision, Semantic Segmentation, Edge Computing, Real-time Visual Servoing, Trajectory Tracking",
    "area_aplicacao": "Pavement Maintenance, Automated Crack Sealing, Road Infrastructure Inspection, Highway Maintenance Robotics, Civil Engineering Automation, Construction Robotics, Visual Servoing, Autonomous Navigation, Edge AI for Infrastructure, Smart Road Maintenance, Asphalt Pavement Repair",

    "tipo_dados": "Imagens de trincas em pavimento asfáltico (RGB), máscaras de segmentação, trajetórias de trincas, sinais de erro de rastreamento, velocidades linear/angular do robô",
    "dataset": "DeepCrack (537 imagens de superfície de concreto, 544×384 pixels, 350 treino/50 val/137 teste), CFD (118 imagens de trincas em estrada, 480×320 pixels, capturadas com iPhone), S2TCrack (1502 imagens para segmentação e rastreamento, 1051 treino/149 val/302 teste, capturadas por robô com Intel RealSense D435i em 6 condições: normal, sombra, escuro, galhos de plantas, molhado, motion blur)",
    "frameworks": "PyTorch 1.8, YOLOv5 (Ultralytics), mmdetection (OpenMMLab), ROS Melodic, Linux Ubuntu 18.04, Jetpack 4.4, TensorRT, CUDA, NVIDIA Jetson AGX Xavier (512 CUDA cores, 64 tensor cores, ARM CPU v8.2 8 cores, 32GB DDR4), Intel RealSense D435i RGB-D camera, NVIDIA GeForce RTX 4090 (24GB), Intel Core i9-13900KF (5.80GHz), SGD optimizer, Binary Cross-Entropy loss, CIoU loss",
    "link_codigo": "https://github.com/ultralytics/yolov5 (YOLOv5 base), https://github.com/open-mmlab/mmdetection (YOLACT, SOLO)"
  },
  {
    "numero": 44,
    "nome_arquivo": "Safeguarding connected autonomous vehicle communication_parte01.pdf",

    "autores": "Mohammed Aledhari; Rehma Razzak; Mohamed Rahouti; Abbas Yazdinejad; Reza M. Parizi; Basheer Qolomany; Mohsen Guizani; Junaid Qadir; Ala Al-Fuqaha",
    "ano": 2025,
    "titulo": "Safeguarding connected autonomous vehicle communication: Protocols, intra- and inter-vehicular attacks and defenses",
    "subtitulo": "",
    "journal": "Computers & Security",
    "publisher": "Elsevier",

    "objetivo": "Apresentar análise abrangente de frameworks e protocolos de segurança para comunicações intra e inter-veiculares em Connected Autonomous Vehicles (CAVs), desenvolvendo um novo sistema de classificação para ameaças de segurança em CAVs e propondo protocolos de segurança práticos. O paper visa categorizar vários security frameworks para auxiliar no desenvolvimento de sistemas de transporte seguros e inteligentes, abordando desafios e oportunidades de soluções state-of-the-art no contexto de tecnologias de direção autônoma.",

    "metodologia": "Survey extensivo e análise sistemática da literatura sobre segurança de CAVs. Estrutura metodológica: (1) Revisão de background sobre segurança de comunicação incluindo comunicação intra-veicular (CAN bus, LIN, FlexRay, MOST, Automotive Ethernet) e inter-veicular (V2V, V2I, V2X, DSRC, C-V2X, 5G NR). (2) Análise de arquiteturas de segurança e desafios em 5 áreas: Data Privacy Protection, Safety and Liability, Accountability, Malware Detection, OTA Updates. (3) Desenvolvimento de taxonomia de ataques categorizados por 6 fatores de severidade (Asset Importance, Attack Difficulty, Detection Rate, Information Leakage Severity, Physical Damage Severity, Recovery Rate) com classificação Low/Medium/High. (4) Mapeamento de 19+ tipos de ataques (Zero-day, Replay, Relay, DoS, Sybil, Blackhole, Eavesdropping, Spoofing, Jamming, MITM, Side-Channel, Adversarial ML, etc.) contra alvos específicos (GPS, LiDAR, Radar, Camera, CAN, ECU, OBD). (5) Análise de soluções de segurança e ferramentas de avaliação. (6) Revisão de protocolos de segurança e best practices. (7) Identificação de open issues em 9 áreas: Data Privacy, Threat Metrics, E/E Architecture, Authentication, Jamming/Spoofing, Data Sharing, Trusted Communications, Security Evaluation Tools. (8) Proposição de roadmap futuro com 9 direções de pesquisa.",

    "analise_estatistica": "Análise qualitativa baseada em categorização sistemática. Tabela 3 apresenta matriz de severidade de ameaças com 6 fatores × 3 níveis (L/M/H). Tabela 4 apresenta taxonomia de 19+ tipos de ataques mapeados para alvos e impactos específicos. Comparação de protocolos de comunicação: DSRC (75 Mbps, 5.9 GHz, 1000m range) vs C-V2X (modo 3: 100+ Mbps, modo 4: 12 Mbps, sub-6 GHz). Análise de mais de 126 incidentes cibernéticos reportados contra veículos autônomos, com 80% sendo ataques remotos. Review de aproximadamente 200 referências cobrindo período de 2002-2024.",

    "resultados": "Principais findings: (1) Vulnerabilidades críticas identificadas em todos os níveis de comunicação veicular - CAN bus sem autenticação nativa, GPS suscetível a spoofing, LiDAR vulnerável a ataques de relay e blinding. (2) Ataques mais severos: Adversarial ML em sensores, DoS em comunicação V2X, Sybil attacks em redes cooperativas. (3) Soluções mais promissoras: Blockchain para integridade de dados e trust management, ML-based anomaly detection para IDS, Federated Learning para privacy-preserving collaboration. (4) Gaps identificados: falta de ferramentas de avaliação de segurança, ausência de frameworks de liability claros, necessidade de post-quantum cryptography. (5) Protocolos emergentes: 5G NR V2X oferece latência <1ms e confiabilidade 99.999%, superior a DSRC para aplicações safety-critical. (6) Best practices propostas: defense-in-depth, secure boot, hardware security modules (HSM), continuous monitoring. (7) Roadmap futuro inclui: Enhanced Security Protocols, Blockchain Integration, Post-Quantum Cryptography, Ethics and Legislation, 5G and Beyond, HMI Security, Cross-Disciplinary Collaboration, Simulation/Testing, Environmental Adaptation.",

    "contribuicoes": "1) Categorização abrangente de security frameworks para CAVs auxiliando desenvolvimento de sistemas de transporte seguros. 2) Taxonomia detalhada de ataques de segurança (Table 4) mapeando 19+ tipos de ataques a alvos e impactos específicos. 3) Framework de análise de severidade de ameaças (Table 3) com 6 fatores e 3 níveis de classificação. 4) Análise sistemática de desafios de segurança em comunicações intra e inter-veiculares. 5) Identificação de 9 open issues críticos para pesquisa futura. 6) Roadmap detalhado com 9 direções de pesquisa futura incluindo quantum computing, blockchain, AI/ML, e regulamentação. 7) Review extensiva de ~200 referências cobrindo estado da arte em segurança de CAVs. 8) Best practices para design de medidas de segurança robustas.",

    "limitacoes": "Artigo é predominantemente survey/review, não apresentando implementação ou validação experimental de soluções propostas. Taxonomia de ataques é baseada em literatura existente e pode não cobrir ameaças emergentes. Análise de severidade é qualitativa (L/M/H) sem métricas quantitativas precisas. Roadmap futuro apresenta direções gerais sem detalhamento de implementação. Foco em aspectos técnicos de segurança com menor atenção a aspectos regulatórios e de liability. Não aborda completamente integração de soluções de segurança com requisitos de real-time performance. Dataset específico não utilizado - análise baseada em literatura secundária.",

    "topico": "Connected Autonomous Vehicles (CAV), Vehicle Communication Security, V2V Communication, V2I Communication, V2X Communication, Intra-Vehicle Networks, Inter-Vehicle Networks, CAN Bus Security, Automotive Cybersecurity, DSRC, C-V2X, 5G NR, Intrusion Detection Systems (IDS), Blockchain for Vehicles, Machine Learning Security, Adversarial Machine Learning, GPS Spoofing, LiDAR Attacks, DoS Attacks, Sybil Attacks, MITM Attacks, Replay Attacks, OTA Updates Security, Privacy Protection, Data Integrity, Authentication Protocols, Encryption, WAVE Protocol, IEEE 802.11p, Threat Taxonomy, Risk Assessment, Security Frameworks",
    "area_aplicacao": "Connected Autonomous Vehicles, Intelligent Transportation Systems (ITS), Smart Mobility, Vehicular Ad-hoc Networks (VANET), Automotive Industry, Self-Driving Cars, Vehicle-to-Everything (V2X), Cooperative Driving, Traffic Management, Smart Cities, Fleet Management, Autonomous Trucking, Ride-Sharing Services, Public Transportation",

    "tipo_dados": "Não aplicável - Survey/Review article. Análise baseada em literatura secundária, taxonomias de ataques, categorizações de severidade, e frameworks conceituais",
    "dataset": "Não aplicável - Revisão sistemática de literatura sem dataset experimental próprio",
    "frameworks": "Análise de protocolos: DSRC/WAVE (IEEE 802.11p, IEEE 1609.x), C-V2X (3GPP Release 14-16), 5G NR V2X, LTE-V. Redes intra-veiculares: CAN, LIN, FlexRay, MOST, Automotive Ethernet. Standards de segurança: ISO/SAE 21434 (TARA), ISO 20078. Tecnologias de segurança analisadas: Blockchain, Federated Learning, Machine Learning IDS, PKI, HSM, Secure Boot, TLS/DTLS",
    "link_codigo": "Não disponível - Artigo de survey/review"
  },
  {
    "numero": 45,
    "nome_arquivo": "Sensor and actuator integrated tooling systems.pdf",

    "autores": "F. Bleicher; D. Biermann; W.-G. Drossel; H.-C. Möhring; Y. Altintas",
    "ano": 2023,
    "titulo": "Sensor and actuator integrated tooling systems",
    "subtitulo": "",
    "journal": "CIRP Annals - Manufacturing Technology",
    "publisher": "Elsevier",

    "objetivo": "Revisar sensores e atuadores utilizados em sistemas de ferramentas de usinagem, explicando princípios de medição de força, deslocamento e temperatura, discutindo atuadores baseados em piezo, fluidos magnetorreológicos, ligas com memória de forma e magnetostritivos, descrevendo técnicas de transmissão de energia e sinais sem fio e com fio, e apresentando a integração desses componentes em sistemas de ferramentas para operações de mandrilamento, fresamento, torneamento e retificação.",

    "metodologia": "Keynote paper (artigo de revisão) estruturado em 9 seções: (1) Introdução ao contexto de sistemas ciber-físicos de produção. (2) Design e arquitetura de sistemas incluindo Digital Twin, edge computing e protocolos industriais (OPC UA, MTConnect, MQTT). (3) Princípios de sensores: strain gauges metálicos e semicondutores, piezoelétricos, capacitivos, indutivos, FBG (Fiber Bragg Grating), SAW (Surface Acoustic Wave), termopares, acelerômetros MEMS. (4) Princípios de atuadores: piezoelétricos (diretos, amplificados, stepper), magnetorreológicos (MRF), ligas com memória de forma (SMA/FSMA), magnetostritivos, eletromagnéticos. (5) Transferência de energia: indutiva, baterias, energy harvesting. (6) Transmissão de dados: Fieldbus, wireless (ZigBee, Bluetooth, Wi-Fi, 5G). (7) Processamento de sinais: ADC (8-24 bit), FFT, wavelets, filtros Kalman, machine learning (CNN, ANN, Random Forest). (8) Aplicações em torneamento, furação, fresamento e retificação. (9) Tecnologias futuras e conclusões.",

    "analise_estatistica": "Análise comparativa de princípios de sensores: strain gauge metálico (sensibilidade 10⁻⁶ V/µε), semicondutor (10⁻⁴ V/µε), piezoelétrico (1 V/µε). Termopares: 15-250 µV/K, faixa -270°C a 3000°C. Acelerômetros MEMS capacitivos: 0-10³ Hz, até ±10³ g; piezoelétricos: 1-20×10³ Hz, até ±10⁶ g. Comparação de atuadores: piezo direto (≤0.1% curso, 10⁶ Hz), SMA (~5% curso, <100 Hz), magnetostritivo (≤0.2% curso, 10⁴ Hz). Consumo de microcontroladores: MSP-430G2553 (230 µA/MHz ativo, <0.1 µA off), STM32L4 (120 µA/MHz ativo, 0.33 µA off). Wireless: Bluetooth (10m, 1 Mbps, 10 mW), Wi-Fi (100m, 15 Mbps, 835 mW), ZigBee (100m, 250 kbps, 36.9 mW). Market share industrial: Ethernet industrial 66%, Fieldbus 27%, Wireless 7%.",

    "resultados": "Sensores FBG: resolução de deformação <1 µm, robustos a temperaturas >1000°C, imunes a interferências eletromagnéticas. Sensores SAW: medição sem contato de temperatura e deformação, passivos. Atuadores piezoelétricos dominam aplicações de alta frequência (até 10⁶ Hz) com alta rigidez. Atuadores magnetorreológicos permitem controle de viscosidade por várias ordens de magnitude com campos de ~1 Tesla. Transferência indutiva de energia: configurações radiais e axiais para ferramentas rotativas. Taxas de amostragem típicas em ferramentas inteligentes: até 83.3 kHz com resolução 16-bit. Aplicações de controle em malha fechada: detecção de chatter, compensação de deflexão da ferramenta (±10 nm), monitoramento de desgaste. Sistemas comerciais: Sandvik Silent Tools (TMD passivo), MAPAL Tooltronic (eixo NC adicional), Ceratizit KOMtronic U-Axis. Tendências: 5G para controle baseado em nuvem, Bluetooth 5.0 com maior alcance, energy harvesting para sensores autônomos.",

    "contribuicoes": "1) Revisão abrangente do estado da arte em sistemas de ferramentas mecatrônicas inteligentes. 2) Taxonomia de sensores para medição de força, deslocamento, temperatura e aceleração com comparação de sensibilidades e faixas de operação. 3) Análise comparativa de princípios de atuação (piezo, MRF, SMA, magnetostritivo, eletromagnético) com métricas de densidade de trabalho volumétrico e faixa dinâmica. 4) Revisão de métodos de transferência de energia e dados para ferramentas rotativas. 5) Análise de técnicas de processamento de sinais incluindo machine learning (CNN, ANN, Random Forest) para detecção de chatter e estimação de desgaste. 6) Catálogo de aplicações em torneamento, furação, fresamento e retificação com sensores e atuadores integrados. 7) Identificação de tendências futuras: miniaturização, transmissão wireless de alta velocidade, MEMS avançados, impressão 4D de materiais inteligentes.",

    "limitacoes": "Artigo focado em usinagem discreta com arestas de corte definidas e indefinidas - não aborda processos de conformação ou manufatura aditiva. Desafios identificados: miniaturização de atuadores, transmissão wireless de baixa latência e alta frequência, transmissão de energia sem fio ou energy harvesting eficiente, processamento embarcado em microcontroladores com limitação de recursos. Integração modular em máquinas-ferramenta ainda complexa devido a arquiteturas fechadas de CNCs. Análise de latência e jitter em comunicação industrial não aprofundada. Custos de implementação de sistemas comerciais não detalhados.",

    "topico": "Sensor Integration, Actuator Integration, Smart Tooling, Mechatronics, Machining Process Monitoring, Process Control, Strain Gauges, Piezoelectric Sensors, MEMS Accelerometers, Fiber Bragg Grating (FBG), Surface Acoustic Wave (SAW), Thermocouples, Piezoelectric Actuators, Magnetorheological Fluids (MRF), Shape Memory Alloys (SMA), Magnetostrictive Actuators, Inductive Power Transfer, Energy Harvesting, Wireless Data Transmission, OPC UA, MTConnect, MQTT, Edge Computing, Digital Twin, Machine Learning, CNN, Chatter Detection, Tool Wear Monitoring, Adaptive Control, CNC Integration",
    "area_aplicacao": "Metal Cutting, Turning, Milling, Drilling, Boring, Grinding, Reaming, Tapping, Machine Tools, Manufacturing Automation, Industry 4.0, Cyber-Physical Production Systems (CPPS), Precision Machining, Process Monitoring, Vibration Control, Thermal Compensation, Tool Condition Monitoring",

    "tipo_dados": "Não aplicável - Keynote paper (artigo de revisão). Compilação de dados de sensibilidade de sensores, faixas de operação de atuadores, consumo de energia de microcontroladores, taxas de dados de protocolos wireless, market share de tecnologias industriais",
    "dataset": "Não aplicável - Revisão sistemática de literatura com aproximadamente 300 referências cobrindo período de 1969-2023",
    "frameworks": "Análise de protocolos: OPC UA, OPC UA TSN, MTConnect, MQTT, Fieldbus (PROFINET, EtherNet/IP, EtherCAT, Modbus). Wireless: IEEE 802.15.4 (ZigBee, WirelessHART), Bluetooth 5.0, Wi-Fi 6, 5G NR. Sensores: strain gauges, piezoelétricos, MEMS, FBG, SAW, termopares. Atuadores: piezo stacks, MRF dampers, SMA wires, Terfenol-D. Plataformas: CNC Siemens Sinumerik, Heidenhain iTNC, B&R. Software: MAST (Modeling and Analysis Suite), machine learning frameworks (CNN, ANN, Random Forest)",
    "link_codigo": "Não disponível - Artigo de revisão keynote"
  }
]
