[
  {
    "_comentario": "ESTE É UM EXEMPLO - NÃO PREENCHER, APENAS REFERÊNCIA",
    "_arquivo_parte": "PARTE 5 - Contém artigos 46-52. Artigos 1-15 em artigos_part1.json, 16-27 em artigos_part2.json, 28-38 em artigos_part3.json, 39-45 em artigos_part4.json",
    "numero": 0,
    "nome_arquivo": "nome_do_arquivo.pdf",

    "_comentario_artigos_grandes": "Para artigos muito grandes (>10 páginas ou erro 413 na API): 1) Dividir PDF em partes menores (ex: _parte01.pdf, _parte02.pdf); 2) Ler de 3 em 3 partes para não sobrecarregar contexto; 3) Criar arquivo artigoN_resumo.md com resumo detalhado de cada parte; 4) Após processar todas as partes, adicionar entrada resumida aqui no JSON. Exemplo: artigo 9 foi dividido em 8 partes e resumido em artigo9_resumo.md",

    "_comentario_identificacao": "Informações bibliográficas do artigo - NOMES DOS AUTORES DEVEM ESTAR COMPLETOS conforme aparecem no PDF",
    "autores": "Nome Completo; Nome Completo 2 (separados por ponto e vírgula)",
    "ano": 2024,
    "titulo": "Título completo do artigo",
    "subtitulo": "Subtítulo se houver",
    "journal": "Nome do periódico/conferência",
    "publisher": "Editora (Elsevier, IEEE, Springer, etc.)",

    "_comentario_conteudo": "Análise do conteúdo científico",
    "objetivo": "Objetivo principal do artigo - o que os autores buscam resolver/propor",
    "metodologia": "Métodos, algoritmos, arquiteturas e abordagens utilizadas",
    "analise_estatistica": "Métricas, testes estatísticos, tamanho de amostra, distribuições",
    "resultados": "Principais resultados quantitativos e qualitativos",
    "contribuicoes": "Contribuições originais do trabalho",
    "limitacoes": "Limitações identificadas pelos autores ou observadas",

    "_comentario_classificacao": "Classificação e categorização",
    "topico": "Palavras-chave principais (ex: Edge Computing, IoT, Machine Learning)",
    "area_aplicacao": "Domínios de aplicação (ex: Robótica, Veículos Autônomos, Indústria 4.0)",

    "_comentario_recursos": "Recursos práticos e reprodutibilidade",
    "tipo_dados": "Tipo de dados utilizados (ex: Imagens, Séries Temporais, Texto)",
    "dataset": "Nome dos datasets utilizados (se aplicável)",
    "frameworks": "Frameworks, bibliotecas e ferramentas utilizadas",
    "link_codigo": "URL do repositório de código (se disponível)"
  },
  {
    "numero": 46,
    "nome_arquivo": "Sensors, systems and algorithms of 3D reconstruction for smart agriculture and precision farming_ A review.pdf",

    "autores": "Shuwan Yu; Xiaoang Liu; Qianqiu Tan; Zitong Wang; Baohua Zhang",
    "ano": 2024,
    "titulo": "Sensors, systems and algorithms of 3D reconstruction for smart agriculture and precision farming: A review",
    "subtitulo": "",
    "journal": "Computers and Electronics in Agriculture",
    "publisher": "Elsevier",

    "objetivo": "Fornecer uma revisão abrangente do progresso de pesquisa em tecnologia de reconstrução 3D para agricultura inteligente e agricultura de precisão. O artigo examina características e desenvolvimento de vários sensores e sistemas de sensoriamento, discute métodos para implementar reconstrução 3D, e resume aplicações em robótica agrícola, fenotipagem de culturas, pecuária e indústria alimentícia, identificando desafios e tendências futuras.",

    "metodologia": "Artigo de revisão sistemática estruturado em seções: (1) Sensores e sistemas de reconstrução 3D: LiDAR (Light Detection and Ranging), laser scanners (terrestres e aéreos), câmeras monoculares, câmeras binoculares/estéreo, câmeras RGB-D (Microsoft Kinect, Intel RealSense, ASUS Xtion, Orbbec Astra), sistemas de luz estruturada (ponto, linha, área), sensores não-ópticos (ultrassônicos, infravermelho, radar de micro-ondas) e sistemas de fusão multi-sensor (HLF, LLF, MLF). (2) Métodos de reconstrução 3D tradicionais-ativos: Time of Flight (ToF) com modulação pulsada (PW-iToF) ou contínua (CW-iToF), triangulação (Delaunay), luz estruturada (baseada em triangulação e fase - FTP/PMP). (3) Métodos tradicionais-passivos: Multi-View Stereo (MVS), Structure from Motion (SFM), visão estéreo binocular, Shape from Shading (SFS), Shape from Texture (SFT). (4) Métodos baseados em deep learning: CNNs, RNNs, GCNs para reconstrução single-image e multi-image, representações em voxel, point cloud e mesh, NeRF (Neural Radiance Fields). (5) Aplicações categorizadas: robótica agrícola (navegação, mapeamento, operações automatizadas), fenotipagem de culturas (planta individual, população de campo, raízes), pecuária (criação de precisão, monitoramento de saúde, análise comportamental), indústria alimentícia (classificação de frutas, estimativa de volume de carne, avaliação de porções).",

    "analise_estatistica": "Revisão qualitativa comparativa de sensores, métodos e aplicações. Tabelas detalhadas: Table 1 - aplicações de reconstrução 3D em robótica agrícola (navegação, mapeamento, poda, colheita, pulverização) com sensores, algoritmos e referências; Table 2 - aplicações em fenotipagem de culturas (plantas individuais, grupos, raízes) com parâmetros medidos (altura, área foliar, largura de folha, volume, arquitetura de raízes); Table 3 - aplicações em pecuária (gado, porcos, galinhas, ovelhas, peixes, cavalos) com sensores (Kinect v1/v2/DK, LiDAR, câmeras estéreo, MRI, CT) e algoritmos (ICP, RANSAC, ToF, SFM, deep learning). Comparação de características de sensores: câmeras monoculares (baixo custo, design simples, limitação em percepção de profundidade), câmeras binoculares (percepção espacial ampla, requer calibração precisa), RGB-D (captura simultânea de cor e profundidade, ruído em superfícies brilhantes/transparentes), LiDAR (alta precisão, custo elevado), luz estruturada (alta precisão de medição, suscetível a iluminação ambiente). Métodos ativos geralmente produzem maior densidade e precisão de point cloud que passivos.",

    "resultados": "Síntese do estado da arte em reconstrução 3D agrícola. Sensores: LiDAR oferece percepção confiável 24h com amplo campo de visão e alcance estendido; laser scanners terrestres geram milhares de pontos por metro quadrado; RGB-D cameras (Kinect, RealSense) são acessíveis com captura simultânea de cor e profundidade via luz estruturada ou ToF; sistemas de luz estruturada fornecem alta precisão mas são suscetíveis a iluminação ambiente forte. Métodos: ToF penetra plantas e obtém elevação precisa do solo; triangulação oferece maior resolução z para distâncias próximas; SFM-MVS produz point clouds densos de múltiplas imagens; NeRF permite reconstrução de alta fidelidade com MLPs simples modelando campos de radiância. Aplicações em robótica: navegação baseada em detecção de fileiras de culturas, mapeamento de pomares com RGB-D e UGV, poda automatizada de videiras com câmeras estéreo trinoculares, colheita de frutas com CNN e triangulação. Fenotipagem: medição não-destrutiva de altura de planta, área foliar, ângulo de inclinação, volume de raízes; reconstrução de populações de campo para estimativa de rendimento; CT e MRI para observação não-invasiva de sistemas radiculares em solo. Pecuária: medição de dimensões corporais (altura, comprimento, largura, circunferência abdominal) com múltiplas câmeras RGB-D; monitoramento de condição corporal; análise comportamental para bem-estar animal. Indústria alimentícia: classificação de frutas por forma, tamanho e defeitos; estimativa de Lean Meat Yield em carcaças; avaliação de porções alimentares com reconstrução 3D de duas vistas.",

    "contribuicoes": "1) Revisão abrangente de sensores para reconstrução 3D agrícola: LiDAR, laser scanners, câmeras monoculares, binoculares, RGB-D, sistemas de luz estruturada, sensores não-ópticos e sistemas de fusão multi-sensor. 2) Taxonomia de métodos de reconstrução 3D: tradicionais-ativos (ToF, triangulação, luz estruturada), tradicionais-passivos (MVS, SFM, visão estéreo, SFS, SFT) e baseados em deep learning (CNNs, RNNs, GCNs, NeRF). 3) Catálogo extensivo de aplicações em quatro domínios: robótica agrícola (navegação, mapeamento, operações automatizadas), fenotipagem de culturas (planta individual, população, raízes), pecuária (criação, saúde, comportamento), indústria alimentícia (classificação, carcaças, porções). 4) Tabelas detalhadas (Tables 1-3) mapeando sensores, algoritmos e aplicações específicas com referências. 5) Identificação de desafios: complexidade e variabilidade de cenas agrícolas, condições de iluminação variáveis, oclusão de dossel, processamento de dados em larga escala. 6) Perspectivas futuras: NeRF e 3DGS (3D Gaussian Splatting) para reconstrução de alta fidelidade, integração de UAVs e redes de sensores para aquisição automática, modelos de IA para geração e atualização automática de modelos, AR/VR para interação humano-computador em agricultura digital.",

    "limitacoes": "Desafios identificados na aplicação prática: (1) Complexidade e variabilidade de cenas agrícolas - terreno irregular, tipos diversos de culturas, condições de iluminação variáveis dificultam inferência precisa de estruturas 3D a partir de imagens 2D. (2) Mudanças dinâmicas em cenários agrícolas (crescimento de culturas, mudanças sazonais, clima) requerem técnicas capazes de atualização e adaptação em tempo real. (3) Oclusão de estrutura de dossel pode causar lacunas, regiões sem textura e imagens borradas em modelos 3D. (4) Limitação de poder computacional e espaço de armazenamento para dados em larga escala - ambientes agrícolas são geralmente grandes e não-delimitados. (5) Qualidade de reconstrução depende do número de imagens, mas mais imagens requerem mais recursos computacionais. (6) Câmeras RGB-D de consumo exibem ruído e incompletude em superfícies brilhantes, transparentes ou distantes. (7) Luz estruturada é suscetível a interferência de iluminação ambiente forte em cenas agrícolas externas.",

    "topico": "3D Reconstruction, Smart Agriculture, Precision Farming, Machine Vision, Agricultural Robotics, Crop Phenotyping, LiDAR, RGB-D Cameras, Stereo Vision, Structure from Motion (SFM), Multi-View Stereo (MVS), Time of Flight (ToF), Structured Light, Deep Learning, Neural Radiance Fields (NeRF), 3D Gaussian Splatting (3DGS), Point Cloud, Mesh Reconstruction, Voxel Representation, CNNs, RNNs, GCNs, Sensor Fusion, Monocular Vision, Binocular Vision, Depth Cameras, Microsoft Kinect, Intel RealSense, Laser Scanner, Shape from Shading, Shape from Texture, Triangulation, Plant Phenotyping, Root Phenotyping, Livestock Monitoring, Food Industry, Fruit Grading, Carcass Analysis, Agricultural Mapping, Autonomous Navigation, Harvesting Robots, Yield Estimation",
    "area_aplicacao": "Smart Agriculture, Precision Farming, Agricultural Robotics, Crop Phenotyping, Plant Science, Livestock Management, Food Industry, Fruit Quality Assessment, Meat Processing, Autonomous Agricultural Vehicles, Field Mapping, Yield Estimation, Root System Analysis, Animal Welfare Monitoring, Body Condition Scoring, Food Portion Assessment, Greenhouse Automation, Orchard Management, Vineyard Monitoring, Precision Livestock Farming",

    "tipo_dados": "Não aplicável - Review article. Compilação de dados de sensores (especificações de LiDAR, câmeras RGB-D, sistemas de luz estruturada), algoritmos de reconstrução 3D, métricas de fenotipagem de culturas, parâmetros corporais de animais, características de frutas e alimentos",
    "dataset": "Datasets mencionados para treinamento de redes neurais: ShapeNet, Pascal 3D+, ObjectNet3D, KITTI. Datasets específicos de aplicações agrícolas referenciados nas tabelas de aplicações",
    "frameworks": "Análise de sensores: Microsoft Kinect (v1, v2, Azure Kinect DK), Intel RealSense, ASUS Xtion, Orbbec Astra, Velodyne LiDAR, SICK LiDAR, Hokuyo LiDAR. Software e algoritmos: KinectFusion, SLAM (Visual SLAM, RGB-D SLAM), OpenCV, PCL (Point Cloud Library), Agisoft Photoscan, Pix4D Mapper, VisualSFM, MeshLab, COLMAP. Frameworks de deep learning: TensorFlow, PyTorch, redes VGG, CNNs, RNNs, GCNs. Métodos de fenotipagem: LemnaTec, GiA Roots, RootReader3D, WinRhizo. Plataformas robóticas: ROS, UAVs, UGVs",
    "link_codigo": "Não disponível - Artigo de revisão"
  },
  {
    "numero": 47,
    "nome_arquivo": "Spatial hybrid_parallel force control of a hexapod machine tool using structure-integrated force sensors and a commercial numerical control.pdf",

    "autores": "Christian Friedrich; Frederik Schlüter; Steffen Ihlenfeldt",
    "ano": 2023,
    "titulo": "Spatial hybrid/parallel force control of a hexapod machine tool using structure-integrated force sensors and a commercial numerical control",
    "subtitulo": "",
    "journal": "Mechatronics",
    "publisher": "Elsevier",

    "objetivo": "Apresentar o controle híbrido/paralelo de força espacial de uma máquina-ferramenta hexapod utilizando sensores de força integrados à estrutura e um sistema de controle numérico comercial (Beckhoff TwinCAT). O trabalho visa provar a viabilidade do controle de força com sensores integrados à estrutura e apresentar novos aspectos práticos do controle de força com CNC, desenvolvendo duas abordagens (LR1 e LR2) para diferentes casos de uso como teach-in, controle de força assíncrono e controle força/posição síncrono com task frame variável.",

    "metodologia": "Duas soluções de controle de força desenvolvidas e implementadas na máquina-ferramenta hexapod Felix I: (1) LR1: utiliza High Level Interface (HLI) para comando externo dos eixos via PLC, com planejamento de trajetória integrado. Offsets de controle de força aplicados via interface proprietária CNC-PLC. Interface ADS para set-points assíncronos de não-tempo-real. Adequado para teach-in (UC1) e controle de força assíncrono (UC2). (2) LR2: módulo C++ 'man-in-the-middle' entre CNC e controladores de drive, integrado na tarefa CNC GEO. Eixos de força virtuais {XF, YF, ZF, UF, VF, WF} integrados ao G-Code para interpolação síncrona de set-points de força e posição. Set-points via código G (DIN 66025/ISO 6983) com comandos M e parâmetros externos. Adequado para controle força/posição síncrono ao movimento (UC3). Modelos de medição de força para diferentes posicionamentos de sensores: 1a (mesa de fixação rígida não-móvel - 6 equações, 42 parâmetros), 1b (plataforma end-effector móvel - modelo dinâmico de corpo rígido com massa, centro de gravidade, inércia, termos de Coriolis e gravitacionais - 6 equações, 56 parâmetros, 18 estados em tempo real), 2a-d (cinemática hexapod com sensores nos struts - modelo Newton-Euler com 25 corpos móveis, 186 equações, 260 parâmetros, 486 estados). Leis de controle: controladores PID no Task Space com matriz de seleção diagonal para escolha de graus de liberdade controlados por força. Três abordagens de transformação: (1) Jacobiano inverso (baixo custo computacional, erro 0.75μm para offset 1mm), (2) transformação cinemática direta/inversa completa (precisão total, alto custo), (3) cinemática inversa com memória (sem movimento CNC paralelo). Sistemas de coordenadas definíveis pelo usuário: Task Base (fixo à base) e Task Platform (fixo à plataforma). Máquina de estados para gerenciamento de transições entre controle de posição e força, busca de contato, e tratamento de erros.",

    "analise_estatistica": "Parâmetros de controlador determinados experimentalmente usando regras de Ziegler-Nichols para força Z de 200N. Comparação de sistemas de medição de força com tempos de filtro T1=50ms, 100ms, 200ms: sensor FT (R) Kp=10-40μm/N, Tn=5-7ms; mesa de fixação (1a) Kp=8-26μm/N, Tn=10-14ms; end-effector (1b) Kp=5-15μm/N, Tn=12ms; cinemática (2b) Kp=1.5-2μm/N, Tn=16-20ms. Análise de resposta ao degrau LR1: tempo morto Tt=22ms, tempo de acomodação T95=120ms, tempo morto de atraso Tu=29ms, tempo de compensação Tg=64ms. Solução LR2: tempo morto Tt=12ms (significativamente melhor). Degraus nominais: LR1 overshoot 3.6% (para 1000N) e 24.2% (para 500N); LR2 overshoot 2.2% (para 1000N) e 5% (para 500N). Degraus de perturbação: LR1 até 100% overshoot, settling 260ms; LR2 24.5% overshoot, settling 160ms. Controle híbrido UC2: força alvo 1000N mantida com incerteza ±20.5N (desvio padrão simples), correspondendo a 6.2% (3σ, 99.73%). Contour following: desvios máximos de força 2.7% (com feedforward) e 5.9% (sem feedforward). Taxa de avanço do controlador de força: 2.9mm/s (sem feedforward) e 1.6mm/s (com feedforward) vs 0.1mm/s do LR1. Controle de força radial: desvio máximo 6.5%. Comparação de sistemas na rampa de contorno: desvio de controle R=13.2%, 1b=29.8%, 1a=35.2%, 2b=37.8%.",

    "resultados": "Solução LR1 validada para teach-in (UC1) e controle de força assíncrono (UC2), porém com dinâmica inferior devido ao planejamento de trajetória e altos tempos mortos. Interface de usuário permite seleção de coordenadas controladas, parâmetros do controlador, limites de força e workspace. Teach-in com sensores integrados permite guiar máquina tocando plataforma (1b) ou struts (2b), aumentando segurança e conforto. Solução LR2 alcança dinâmica significativamente maior: interpolação síncrona de força e posição via G-Code com eixos virtuais. Tempo morto de apenas 1 ciclo de controle (2ms) até set-point chegar ao controlador de posição. Contour following bem-sucedido: experimentos com contorno de amplitude 56.6mm (sem feedforward) e 16.5mm (com feedforward de 5 pontos). Feedforward de coordenada Z reduz perturbação a ser compensada pelo controlador de força. Task frames variáveis validados: controle de força radial em peça circular e em forma de rim, controle de força normal em peça em forma de rim reduzindo forças laterais para próximo de zero. Integração G-Code completa: comandos M50-M58 para controle de estado, PARAM[1-57] para task frames, limites de workspace, parâmetros do controlador e coordenadas de origem. Transformação cinemática integrada ao kernel CNC (McCOM-Trafo) com verificação de limites de máquina em tempo real. Todos os sistemas de medição de força estruturalmente integrados adequados para controle de força, com trade-off entre proximidade ao TCP e dinâmica alcançável. Para muitas aplicações, a menor dinâmica dos sensores integrados pode ser acomodada por taxas de avanço correspondentemente menores.",

    "contribuicoes": "1) Duas soluções de controle de força (LR1 e LR2) integradas a CNC comercial (Beckhoff TwinCAT) para diferentes casos de uso: teach-in, controle assíncrono e controle síncrono força/posição. 2) Integração G-Code com eixos de força virtuais para interpolação síncrona de força e posição no mesmo bloco NC. 3) Validação de sensores de força integrados à estrutura para controle de força espacial em 6 DoF em máquinas-ferramenta hexapod. 4) Máquina de estados para busca de contato, ativação/desativação do controle de força e tratamento de erros. 5) Sistemas de coordenadas de tarefa variáveis (Task Base e Task Platform) programáveis via G-Code para controle de força radial e normal. 6) Comparação sistemática de sistemas de medição de força mostrando trade-offs entre proximidade do sensor ao TCP e dinâmica de controle alcançável. 7) Modelos de medição de força em tempo real para diferentes posicionamentos de sensores: estrutura rígida (1a, 1b) e cinemática hexapod (2a-d). 8) Demonstração de teach-in com sensores integrados permitindo guiar máquina por contato em struts ou plataforma, aumentando distância operador-TCP para maior segurança.",

    "limitacoes": "Solução LR1 limitada por altos tempos mortos (22ms) e atrasos de planejamento de trajetória, inadequada para controle força/posição síncrono (UC3). Sensores integrados à estrutura alcançam dinâmica inferior comparada a sensores FT - desvios de controle até 37.8% vs 13.2%. Ganho do controlador limitado por estabilidade devido à distância do TCP. Taxa de avanço deve ser reduzida para manter desvio de controle permissível com sensores integrados. Solução LR2 requer desativação do monitoramento de erro de seguimento no CNC (monitoramento nos inversores permanece ativo). Planejamento de trajetória, interpolação e verificações de segurança dos offsets comandados não são realizados pelo CNC na solução LR2. Métodos de controle de força mais avançados devem ser estudados em trabalhos futuros para melhorar performance de controle. Modelo cinemático (2a-d) requer 486 estados em tempo real, alto custo computacional. Filtro de força mais alto permite aumentar ganho Kp mas tem influência menor no tempo de reset Tn alcançável.",

    "topico": "Hexapod Machine Tool, Force Control, Force Measurement, Structure-Integrated Force Sensors, Parallel Kinematic Machines (PKM), Hybrid Force/Position Control, Parallel Force/Motion Control, CNC Integration, G-Code Programming, Beckhoff TwinCAT, PID Control, Task Frame, Coordinate Transformation, Jacobian Matrix, Forward/Inverse Kinematics, Teach-in, Contour Following, Stewart Platform, Newton-Euler Dynamics, Rigid Body Dynamics, State Machine, Real-time Control, Sercos Communication, Man-in-the-Middle Architecture, Virtual Axes, Selection Matrix, Contact Search, Radial Force Control, Normal Force Control",
    "area_aplicacao": "Machine Tools, Manufacturing Automation, Force-Controlled Machining, Grinding, Polishing, Deburring, Thermo-smoothing, Process Monitoring, Quality Assurance, Tool Condition Monitoring, Parallel Kinematic Machine Tools, Industrial Robotics, Precision Manufacturing, Metal Cutting, Forming Processes, Assembly Tasks, Hardware-in-the-Loop Testing, Collaborative Robotics",

    "tipo_dados": "Forças medidas (N), coordenadas de posição (mm), parâmetros de controlador (Kp em μm/N, Tn em ms), características de resposta ao degrau (tempo morto, tempo de acomodação, overshoot), desvios de contour tracking, offsets de controlador de força",
    "dataset": "Não aplicável - experimentos com protótipo físico (máquina-ferramenta hexapod Felix I com sensores de força integrados à estrutura e sensor FT comercial como referência)",
    "frameworks": "Beckhoff TwinCAT 3.1 (CNC), C++ (módulos de medição e controle de força), PLC (IEC 61131-3), G-Code (DIN 66025 / ISO 6983), Sercos II (comunicação com drives), McCOM-Trafo (interface de transformação cinemática Beckhoff), ADS interface (comunicação não-tempo-real), High Level Interface HLI (interface CNC-PLC), sensores de força 1 DoF integrados aos struts hexapod, sensor força/torque 6 DoF comercial (referência), servo drives com controladores em cascata (corrente 125μs, velocidade 250μs, posição 1ms)",
    "link_codigo": "Não disponível (Data will be made available on request)"
  },
  {
    "numero": 48,
    "nome_arquivo": "Stability analysis for an ad-hoc model predictive control in DC.pdf",

    "autores": "Alejandro Garcés-Ruiz; Walter Gil-González; Oscar Danilo Montoya",
    "ano": 2024,
    "titulo": "Stability analysis for an ad-hoc model predictive control in DC/DC converters with a constant power load",
    "subtitulo": "",
    "journal": "Results in Engineering",
    "publisher": "Elsevier",

    "objetivo": "Apresentar análise de estabilidade para um controle preditivo de modelo (MPC) de horizonte um com conjunto de controle contínuo (CCS-MPC) para conversores DC/DC conectados a cargas de potência constante (CPLs). O trabalho visa provar formalmente a estabilidade tanto em malha aberta quanto fechada, propondo uma abordagem geral aplicável a qualquer conversor DC/DC de segunda ordem incluindo Buck, Boost, Buck-Boost e Buck-Boost não-inversor.",

    "metodologia": "Modelo dinâmico não-linear em tempo discreto generalizado para conversores DC/DC de segunda ordem: x⁺ = M⁻¹(A(x)x + (ξ₁+ξ₂u)Bx + (ξ₃+ξ₄u)b), com estados x=(i,v) e entrada u (índice de modulação). Análise de estabilidade usando critério traço-determinante (critério do triângulo) para sistemas em tempo discreto em ℝ²: |tr(J)|-1 < det(J) < 1. Prova formal de instabilidade em malha aberta: det(J₀) ≥ 1 para todo ponto de equilíbrio, indicando pelo menos um autovalor fora do círculo unitário. Proposta de CCS-MPC de horizonte um baseada em problema de controle ótimo (OCP): min ½||M(x⁺-x̄)||²_Q + ρ/2(u-ū)² sujeito a dinâmica do conversor e restrições de caixa u∈[umin,umax]. Lei de controle em forma fechada: u(x) = proj_U((ρū - ψ₁(x)ᵀQψ₂(x))/(ρ + ψ₂(x)ᵀQψ₂(x))). Prova de otimalidade global e unicidade da solução (problema convexo estritamente convexo). Análise de estabilidade em malha fechada via linearização: Jacobiano J = J₀ - (1/σ)J_M Q J_AB. Condições de estabilidade expressas como desigualdades matriciais lineares (LMIs) para seleção de Q e ρ. Formulação de problema de otimização convexa off-line: min||Q|| sujeito às LMIs de estabilidade. Parâmetros dos conversores: cv=100μF, li=47μH, v₀=12V ou 24V, frequência de chaveamento 100kHz. Implementação em MATLAB usando interface Yalmip para resolver otimização convexa.",

    "analise_estatistica": "Três índices de performance calculados: ITSE (Integral of Time-multiplied Square Error), IAE (Integral Absolute Error), ITAE (Integral of Time-multiplied Absolute Error). Conversor Boost: ITSE=4.915×10⁻⁶, IAE=1.521×10⁻², ITAE=1.521×10⁻⁴, tempo de acomodação Ts=5ms. Conversor Buck-Boost: ITSE=3.366×10⁻⁶, IAE=6.607×10⁻³, ITAE=6.608×10⁻⁵, tempo de acomodação Ts=1.5ms. Análise de sensibilidade: variação de autovalores quando CPL varia de 0W a 100W em passos de 2.5W. Critério do triângulo: det(J)≥1 prova instabilidade em malha aberta para todo conversor independente dos parâmetros específicos. Desvios de tensão de saída menores que 0.1V. Estabilização em menos de 0.2ms para conversor Boost. Parâmetros ótimos encontrados via otimização convexa: Boost ρ=25.1298, Q=[[1.0261,0.9739],[0.9739,1.0261]]; Buck-Boost ρ=793.7977, Q=[[8.6670,-49.4975],[-49.4975,481.4370]].",

    "resultados": "Prova formal de instabilidade em malha aberta: todo ponto de equilíbrio x̄∈Ω é instável para conversores DC/DC alimentando CPLs com índice de modulação constante. Simulações confirmam que perturbações mínimas na CPL (de 10W para 10.01W) causam instabilidade nas variáveis elétricas (corrente e tensão divergem). Retrato de fase do conversor Boost em malha aberta mostra fonte espiral (spiral source) mesmo para pequenas variações do equilíbrio. CCS-MPC proposto estabiliza sistema: conversor Boost estabiliza em menos de 0.2ms com desvios de tensão <0.1V; conversor Buck-Boost estabiliza em <0.1ms. Sinal de controle permanece estável e longe dos limites, indicando capacidade de suportar variações adicionais de carga. Corrente do indutor experimenta overshoot devido à mudança súbita de carga mas converge como sistema de primeira ordem. Análise de sensibilidade dos autovalores: para CPLs pequenas, autovalores têm partes real e imaginária; para CPL>25W, autovalores são apenas reais (sem oscilações) mas um tende a 1 (limite de estabilidade). Controlador proposto garante estabilidade em malha fechada sob todas as condições de carga examinadas (0-100W). Valores de ITSE extremamente baixos indicam eficiência excepcional em reduzir erro ao longo do tempo.",

    "contribuicoes": "1) Análise da instabilidade de conversores DC/DC de segunda ordem alimentando CPLs em malha aberta usando critério traço-determinante (critério do triângulo) - abordagem simples e pedagógica para entender o fenômeno. 2) Proposta de CCS-MPC de horizonte um para regular tensão de saída em conversores DC/DC de segunda ordem, com problema de otimização analisado em detalhe e controle em forma fechada facilmente implementável. 3) Condições formais de estabilidade em malha fechada encontradas, transformáveis em problema de otimização convexa resolvível durante fase de projeto. 4) Abordagem geral aplicável a qualquer conversor DC/DC de segunda ordem (Buck, Boost, Buck-Boost, non-inverting Buck-Boost) com estrutura matemática similar. 5) Framework que vai além da análise como ferramenta prática para projeto de sistemas de controle com garantias de estabilidade e otimalidade global.",

    "limitacoes": "Análise restrita a conversores DC/DC de segunda ordem - não aplicável diretamente a topologias de ordem superior. Modelo assume CPL ideal sem dinâmica própria. Otimização para encontrar Q e ρ realizada off-line durante projeto, não adaptativa em tempo real. Análise de sensibilidade mostra que para CPLs grandes (próximo de 100W) um autovalor tende ao limite de estabilidade (magnitude 1). Trabalhos futuros sugeridos: (i) extensão para conversores de integração de fontes renováveis ou sistemas de armazenamento em redes AC (conversores fonte de tensão ou corrente); (ii) incorporação de incertezas relacionadas a parâmetros do conversor; (iii) exploração de estimadores para tensão de entrada e CPL conectada.",

    "topico": "Model Predictive Control (MPC), DC/DC Converters, Constant Power Load (CPL), Stability Analysis, Continuous Control Set MPC (CCS-MPC), One-Step Horizon, Discrete-Time Systems, Nonlinear Control, Asymptotic Stability, Trace-Determinant Criterion, Triangle Criterion, Buck Converter, Boost Converter, Buck-Boost Converter, Non-Inverting Buck-Boost, DC Microgrids, Optimal Control Problem (OCP), Linear Matrix Inequalities (LMI), Convex Optimization, Pulse Width Modulation (PWM), Jacobian Matrix, Eigenvalue Analysis, Lyapunov Stability, Power Electronics Control, Voltage Regulation",
    "area_aplicacao": "DC Microgrids, Power Electronics, Renewable Energy Integration, Energy Storage Systems, DC Distribution Networks, Electric Vehicles, Electronic Devices Power Supply, Smart Grids, Industrial Power Systems, Battery Management Systems, Solar PV Systems, Distributed Energy Resources",

    "tipo_dados": "Simulações numéricas de conversores DC/DC, respostas dinâmicas de tensão e corrente, índices de performance de controle (ITSE, IAE, ITAE), autovalores de sistemas linearizados, parâmetros de controlador (Q, ρ)",
    "dataset": "Não aplicável - simulações numéricas com parâmetros de conversores: cv=100μF, li=47μH, v₀=12V/24V, CPL=10W a 100W, frequência de chaveamento 100kHz",
    "frameworks": "MATLAB, Yalmip (interface para modelagem e otimização), Otimização convexa off-line para seleção de parâmetros Q e ρ, PWM (Pulse Width Modulation) para frequência de chaveamento constante",
    "link_codigo": "Não disponível (No data was used for the research described in the article)"
  },
  {
    "numero": 49,
    "nome_arquivo": "Stiffness optimization design of wheeled-legged rover integrating active and passive compliance capabilities.pdf",

    "autores": "Bike Zhu; Jun He; Feng Gao",
    "ano": 2024,
    "titulo": "Stiffness optimization design of wheeled-legged rover integrating active and passive compliance capabilities",
    "subtitulo": "",
    "journal": "Mechanism and Machine Theory",
    "publisher": "Elsevier",

    "objetivo": "Realizar o design de otimização de rigidez para um rover com rodas e pernas (TAWL - Terrain-Adaptive Wheel-Legged) com capacidades de conformidade ativa e passiva. A rigidez do sistema de suspensão afeta a capacidade de adaptação a terrenos irregulares, capacidade de carga, estabilidade do corpo e consumo de energia. O trabalho visa otimizar a combinação de rigidez ativa e passiva para melhorar o desempenho abrangente do sistema, utilizando o método de atlas de desempenho para otimização multi-objetivo.",

    "metodologia": "Desenvolvimento de modelo cinemático para sistema híbrido série-paralelo com 20 DoFs (4 pernas × 5 juntas cada) e molas passivas. Estrutura TAWL: cada perna possui 3 juntas rotacionais e 2 prismáticas, com molas de compressão paralelas às juntas prismáticas para conformidade passiva, e controle de impedância para conformidade ativa. Parâmetros de otimização: rigidez passiva das molas (k) e ganho de rigidez ativa (KA). Derivação de índices de desempenho individuais: (1) Coeficiente de deformação (ηS): capacidade de deformação vertical (ηSTz) e deformação angular (ηSRβ) para adaptação a terrenos; (2) Coeficiente de capacidade de carga (ηC): suporte de carga vertical (ηCFz) e momento de rolagem (ηCTβ); (3) Coeficiente de distribuição ACE (ηACE): uniformidade de distribuição de energia de conformidade ativa entre as pernas; (4) Coeficiente de estabilidade dinâmica (ηN): margem de estabilidade usando critério do ponto zero-momento (ZMP). Método de atlas de desempenho para otimização multi-objetivo: discretização do espaço de design em grid de (k, θ3, θ4), cálculo de índices para cada combinação, visualização em gráficos polares para seleção intuitiva da região ótima global. Comparação com algoritmo de ponto interior (weighted sum) e algoritmo genético multi-objetivo (NSGA). Experimentos físicos com protótipo TAWL em dois terrenos (Terrain A e B) com diferentes ângulos de inclinação (20° e 30°) e alturas de obstáculos.",

    "analise_estatistica": "Coeficiente de desempenho global ηave definido como média ponderada dos índices individuais normalizados pelos valores máximos. Comparação de métodos de otimização: Weighted Sum (complexidade O(n^1.5L) a O(n^4.5L) para NLP, pode ficar preso em ótimos locais), Pareto/NSGA (complexidade O(G×M×N²), visualização difícil para >3 objetivos), Performance Atlas (complexidade O(m^n), maior custo mas seleção intuitiva e evita ótimos locais). Experimentos com múltiplas combinações de rigidez: k={2.88, 5.06, 10.60} N/mm e KA={0.6, 0.8, 1.0, 1.2, 1.4, 1.6}. Métricas medidas: altura do corpo no eixo Z (mm), ângulo de pitch (°), variação total das juntas (°), desvio de força (N), variação total das molas (mm). Terrain A (inclinação 20°): altura do corpo 520-600mm, ângulo de pitch -0.6° a +0.2°, variação de juntas 0-80°, desvio de força -100N a +40N. Terrain B (inclinação 30°): altura do corpo 400-630mm, variação de molas 0-100mm, ângulo de pitch -0.7° a +0.2°. Combinação ótima (k=5.06, KA=1.0) apresenta melhor ηave≈3.19, mais próxima dos resultados otimizados teoricamente.",

    "resultados": "Modelo cinemático preciso estabelecido para sistema série-paralelo híbrido com 20 DoFs e molas passivas. Região ótima global identificada via atlas de desempenho: θ3∈[60°,90°] e θ4∈[140°,160°] para rigidez k≈5 N/mm. Combinação de rigidez (k=5.06, KA=1.0), mais próxima do design otimizado, exibe o melhor desempenho global (ηave≈3.19). Validação experimental em Terrain A (20°) e Terrain B (30°): altura do corpo mantida estável, ângulo de pitch minimizado, variação de juntas distribuída uniformemente. Comparação de algoritmos demonstra vantagens do método de atlas de desempenho: (1) taxa de sucesso máxima (seleção intuitiva do ótimo global), (2) visualização excelente (trade-offs entre objetivos observáveis graficamente), (3) evita ótimos locais (exploração exaustiva do espaço). Weighted sum pode ficar preso em ótimos locais; NSGA produz conjunto Pareto que requer análise adicional para seleção. Sensores de força e encoders validam deformações das molas e forças de contato durante processo de conformidade. Fotos experimentais mostram adaptação do rover a terrenos com múltiplos obstáculos mantendo estabilidade do corpo.",

    "contribuicoes": "1) Framework de otimização de rigidez para sistemas robóticos com conformidade ativa e passiva integradas, considerando múltiplos índices de desempenho simultaneamente. 2) Modelo cinemático completo para rover com rodas e pernas (TAWL) com 20 DoFs e molas passivas em configuração série-paralelo híbrida. 3) Derivação de quatro índices de desempenho: coeficiente de deformação, coeficiente de capacidade de carga, coeficiente de distribuição ACE e coeficiente de estabilidade dinâmica. 4) Aplicação do método de atlas de desempenho para otimização multi-objetivo com visualização intuitiva em gráficos polares, permitindo identificação da região ótima global. 5) Comparação sistemática entre métodos de otimização: weighted sum, Pareto/NSGA e atlas de desempenho, demonstrando trade-offs entre complexidade, taxa de sucesso e visualização. 6) Validação experimental em protótipo físico TAWL com dois terrenos diferentes (inclinações de 20° e 30°), confirmando que combinação de rigidez próxima ao design otimizado apresenta melhor desempenho. 7) Formulação do coeficiente de desempenho global ηave para avaliação abrangente do sistema considerando todos os índices normalizados.",

    "limitacoes": "Incapacidade de adquirir molas com rigidez exatamente igual aos valores otimizados teoricamente - experimentos realizados com combinações de rigidez disponíveis comercialmente mais próximas. Método de atlas de desempenho possui maior complexidade computacional O(m^n) devido à exploração exaustiva do espaço de soluções. Análise limitada a dois terrenos específicos com geometrias predefinidas. Trabalhos futuros necessários para: (i) métodos de controle mais complexos, (ii) parâmetros de rigidez ótima variáveis em tempo real, (iii) experimentos robustos com protótipos físicos para aplicações planetárias reais. Modelo assume molas lineares ideais sem histerese ou efeitos não-lineares. Coeficientes de ponderação no índice global ηave assumidos iguais (sem priorização explícita entre objetivos).",

    "topico": "Wheeled-Legged Rover, Stiffness Optimization, Active Compliance, Passive Compliance, Performance Atlas Method, Multi-Objective Optimization, Terrain Adaptation, Kinematic Modeling, Series-Parallel Hybrid System, Suspension Design, Deformation Capability, Load Capacity, Dynamic Stability, ACE Distribution, Zero Moment Point (ZMP), Impedance Control, Spring Stiffness, Compliance Control, Mobile Robots, Planetary Rovers, Locomotion, Mechanism Design, Robot Dynamics, Pareto Optimization, Genetic Algorithm, Interior-Point Algorithm",
    "area_aplicacao": "Planetary Exploration, Mobile Robotics, Wheeled-Legged Robots, Terrain-Adaptive Vehicles, Search and Rescue Robots, Field Robotics, Space Exploration, Rough Terrain Navigation, Agricultural Robots, Mining Robots, Construction Robots, Military Robots, Autonomous Vehicles, Compliant Robots",

    "tipo_dados": "Dados experimentais de protótipo físico TAWL: altura do corpo (mm), ângulo de pitch (°), variação total das juntas (°), desvio de força (N), variação das molas (mm), posições das pernas, forças de contato roda-terreno",
    "dataset": "Não aplicável - experimentos com protótipo físico TAWL (Terrain-Adaptive Wheel-Legged rover) em dois terrenos artificiais com inclinações de 20° e 30°",
    "frameworks": "MATLAB (cálculos numéricos, otimização multi-objetivo, visualização de atlas de desempenho), Algoritmo de ponto interior (interior-point), NSGA (Non-dominated Sorting Genetic Algorithm), Controle de impedância para conformidade ativa, Sensores de força para medição de forças de contato, Encoders para medição de posição das juntas",
    "link_codigo": "Não disponível (No data was used for the research described in the article)"
  },
  {
    "numero": 50,
    "nome_arquivo": "Tac-scope_ An endoscope integrated with soft sensor for real-time tactile feedback.pdf",

    "autores": "Yingxuan Zhang; Qi Jiang; Feiwen Wang; Jie Wang; Maosheng Ye; Dongxuan Li",
    "ano": 2024,
    "titulo": "Tac-scope: An endoscope integrated with soft sensor for real-time tactile feedback",
    "subtitulo": "",
    "journal": "Measurement",
    "publisher": "Elsevier",

    "objetivo": "Propor um endoscópio flexível com feedback tátil em tempo real (Tac-scope) que integra um sensor soft na extremidade embarcado com grade de Bragg em fibra óptica (FBG) para detectar a força de contato com a parede do lúmen, mantendo a função original do endoscópio. O trabalho visa melhorar a segurança da cirurgia endoscópica através de detecção de força e orientação de contato em tempo real.",

    "metodologia": "Design estrutural de sensor de 3 camadas: tampa terminal (aço inoxidável), camada soft de polidimetilsiloxano (PDMS, dureza 30 HA, espessura 5mm), e placa intermediária. Quatro fibras ópticas com FBG suspensas na camada soft (comprimento de onda central 1545nm, comprimento de grade 5mm) + um FBG livre de estresse a 1cm de distância para compensação de temperatura. Diâmetro total de apenas 6mm, permitindo integração de lente e guias de luz, e passagem de ferramentas de biópsia. Análise teórica: modelo de deformação axial das fibras relacionando deslocamento de comprimento de onda de Bragg com força normal Fn e orientação α. Análise por elementos finitos (FE) usando modelo Mooney-Rivlin para PDMS, fibras pré-tensionadas com 1N, forças de 0-1.5N aplicadas em intervalos de 0.25N em 16 orientações (intervalos de 22.5°). Fabricação: partes rígidas em resina por manufatura aditiva, partes soft em silicone por infusão em molde. Sistema de pré-tensionamento com pesos de 100g e polia para garantir tensão uniforme nas fibras. Calibração com estágio motorizado linear (NSS120-S450), estágio rotativo (REG25), sensor de força Taiyo (DY LY-108 5N), placa de aquisição NI (USB-6001), demodulador FBG (M4151-16-25). Compensação de temperatura: aquecimento de temperatura ambiente até 40°C em estufa (DHG-9145A), medição de coeficientes de sensibilidade térmica (13.19-15.29 pm/°C). Verificação: 12 grupos de testes com força e orientação aleatórias (0-1.5N, 0-360°). Testes em modelo bronquial transparente de 4 estágios com braço contínuo flexível de 1 DoF. Testes em pulmões suínos in vitro.",

    "analise_estatistica": "Métricas de desempenho do sensor: Linearidade R²=0.991, erro de repetibilidade 6.46% (média de 16 orientações: 5.73%-7.68%), erro de histerese médio 6.76%, RMSE=0.0211nm, resolução=8.8mN, sensibilidade=0.693nm/N, erro médio de força=4.4% (0.067N), erro de orientação=3.57% (0.67mm). Curvas trigonométricas ajustadas para relação orientação-wavelength shift com R² de 0.984-0.993 e RMSE de 0.063-0.093. Coeficientes de sensibilidade térmica dos FBGs: 13.41, 15.29, 13.19, 13.67 pm/°C com R²>0.9987. Erros de compensação de temperatura: 1.02%-5.49%, variância média 6.03pm. Tempo de resposta do sensor: ~40ms, tempo de cálculo do programa: ~36ms, tempo total de feedback visual-tátil: <120ms. Comparação com outros sensores: erro 4.4% (vs 5.3-16% literatura), sensibilidade 0.69nm/N (vs 0.47-1.30nm/N), resolução 8.8mN (vs 1.19mN-1kPa). Testes em modelo bronquial: redução média de 60% na força de contato com feedback tátil vs apenas visão, redução média de 30% no tempo de operação. Robustez temporal: testes após 5 meses mostram detecção estável sem mudança discernível em sensibilidade ou outras propriedades. Mais de 900 testes realizados durante período experimental, intervalo mais longo entre testes >1 ano.",

    "resultados": "Sensor Tac-scope validado teoricamente, por simulação FE e experimentalmente para detecção de força e orientação de contato. Simulação FE confirma relação linear força-deformação e padrão senoidal orientação-deformação consistente com teoria. Calibração experimental em 16 orientações (0°-337.5°) confirma linearidade e repetibilidade. Compensação de temperatura bem-sucedida para operação in vivo (30-40°C). Verificação com força/orientação aleatórias mostra boa concordância entre valores detectados e reais. Testes em modelo bronquial demonstram capacidade de operar em ambiente luminal complexo: sensor identifica magnitude e orientação de força em pontos críticos (P1, P2, destino). Com feedback tátil-visual: força de contato reduzida em 60%, tempo de operação reduzido em 30% comparado a apenas visão. Orientações de contato concentradas no lado externo da curva devido ao único DoF de flexão. Testes em pulmões suínos in vitro confirmam eficácia para detecção de tecido bronquial real: forças de contato em níveis baixos comparáveis ao modelo. Interface de feedback tátil-visual implementada usando círculos de cores ao redor do campo visual endoscópico: verde escuro (sem contato), verde claro (0-0.25N), amarelo (0.25-0.5N), vermelho (>0.5N). Tempo total de feedback <120ms permite ao cirurgião adaptar e realizar procedimento com segurança e eficiência.",

    "contribuicoes": "1) Endoscópio flexível com sensor tátil soft integrado na extremidade (Tac-scope) para detecção de força de contato e feedback em tempo real, mantendo funções originais do endoscópio (lente, guias de luz, canal de biópsia). 2) Design de sensor de 3 camadas com 4 FBGs suspensos em camada PDMS para detecção de magnitude (0-1.5N) e orientação (0-360°) de força de contato. 3) Modelo teórico relacionando deslocamentos de comprimento de onda dos FBGs com força e orientação, validado por simulação FE. 4) Método de compensação de temperatura usando FBG livre de estresse para operação in vivo. 5) Interface de feedback tátil-visual intuitiva usando círculos de cores codificados por força ao redor do campo visual endoscópico, evitando fadiga cognitiva. 6) Demonstração de melhoria significativa em segurança (60% redução de força) e eficiência (30% redução de tempo) com feedback tátil comparado a apenas visão. 7) Validação em modelo bronquial e pulmões suínos in vitro demonstrando aplicabilidade clínica. 8) Robustez temporal comprovada: sensor funciona após 5 meses e >900 testes sem degradação de desempenho.",

    "limitacoes": "Informação de dureza de tumor não fornecida - trabalho futuro incluirá localização precisa de tumores subcutâneos via palpação de dureza com pinças de biópsia. Primeira geração de sensor fabricada a baixo custo sem encapsulamento estrito e sem uso de materiais esterilizáveis - versão futura usará aço inoxidável ao invés de resina e PTFE para encapsulamento. Demodulador FBG de 16 canais não é pequeno o suficiente para integração em robô cirúrgico - versão de 4 canais reduzirá tamanho em fator de 3-4. Teste limitado a modelo bronquial e pulmões suínos in vitro - validação clínica in vivo necessária. Braço contínuo usado nos testes possui apenas 1 DoF de flexão, resultando em orientações de contato concentradas. Digital twin de robô cirúrgico baseado em sensoriamento multimodal planejado para trabalho futuro.",

    "topico": "Endoscope, Tactile Sensor, Force Detection, Orientation Detection, Tactile-Vision Feedback, Fiber Bragg Grating (FBG), Soft Sensor, PDMS, Real-time Feedback, Minimally Invasive Surgery, Natural Orifice Transluminal Endoscopic Surgery (NOTES), Robot-Assisted Endoscopic Surgery (RAES), Bronchoscopy, Contact Sensing, Temperature Compensation, Wavelength Shift, Strain Sensing, Surgical Safety, Human-Robot Interaction, Medical Robotics, Finite Element Analysis, Calibration",
    "area_aplicacao": "Minimally Invasive Surgery, Endoscopic Surgery, Bronchoscopy, Natural Orifice Transluminal Endoscopic Surgery (NOTES), Robot-Assisted Surgery (RAS), Transurethral Surgery, Vaginal Endoscopic Surgery, Gastrointestinal Endoscopy, Tracheal Intubation, Medical Robotics, Surgical Training, Biopsy Procedures",

    "tipo_dados": "Deslocamentos de comprimento de onda FBG (nm), força de contato (N), orientação de contato (°), deformação axial de fibras, temperatura (°C), dados de calibração, imagens endoscópicas, séries temporais de força e orientação durante navegação bronquial",
    "dataset": "Não disponível (dados confidenciais) - experimentos em modelo bronquial transparente de 4 estágios e pulmões suínos in vitro",
    "frameworks": "Demodulador FBG M4151-16-25 (Shenzhen Guangchi), Sensor de força Taiyo DY LY-108 5N, Placa de aquisição NI USB-6001, Estágio linear motorizado NSS120-S450, Estágio rotativo REG25, Estágios manuais LGX60-C e LY60LM, Estufa DHG-9145A, Manufatura aditiva (resina 8200pro WeNext), Infusão em molde (silicone 30HA WeNext), Software de interface tátil-visual com círculos de cores",
    "link_codigo": "Não disponível (The data that has been used is confidential)"
  },
  {
    "numero": 51,
    "nome_arquivo": "The influence of tactile feedback in In-vehicle central control interfaces on driver emotions_ A comparative study of touchscreens and physical buttons.pdf",

    "autores": "Faren Huo; Tai Wang; Fei Fang; Cong Sun",
    "ano": 2024,
    "titulo": "The influence of tactile feedback in In-vehicle central control interfaces on driver emotions: A comparative study of touchscreens and physical buttons",
    "subtitulo": "",
    "journal": "International Journal of Industrial Ergonomics",
    "publisher": "Elsevier",

    "objetivo": "Investigar os efeitos do modo de feedback tátil (TFM - touchscreen vs botões físicos) e intensidade de feedback tátil (TFI - alta, média, baixa) nas emoções dos motoristas durante a interação com interfaces de controle central veicular. O estudo visa fornecer suporte teórico para o design emocional de feedback tátil em interfaces de controle central veicular.",

    "metodologia": "Experimento de direção simulada com design within-subject 2×3×2. Participantes: 42 motoristas (25 mulheres, 17 homens), idade média 24.76 anos (SD=4.46), experiência de direção 3.17 anos (SD=2.93). Variáveis independentes: TFM (feedback de vibração em touchscreen vs feedback de força em botões físicos), TFI (alta: 250Hz/7N, média: 150Hz/4.5N, baixa: 50Hz/2N), NTD (dificuldade de tarefas não relacionadas à direção: simples vs complexa). Aparato: simulador de média fidelidade com display de 65 polegadas (3840×2160), volante, pedais, City Car Driving (estrada urbana de 3 faixas, 5km, ~15 veículos/km). Touchscreen: iPad Pro 10.5\" com atuador de vibração responsivo, sensor de pressão FSR, Arduino, transmissão wireless. Botões físicos: silicone rubber com estrutura interna típica automotiva (curva força-deslocamento F1-F2-Fc), fixados em caixa 18×25×5cm. Tarefas NDRT: reprodução de música (simples, 3 passos, metade superior do HMI) e ajuste de temperatura (complexa, 7 passos não-lógicos, metade inferior do HMI). Medição de emoções: Self-Assessment Manikin (SAM) com escala Likert de 9 pontos para valência (1=extremamente desagradável, 9=extremamente agradável), arousal (1=extremamente calmo, 9=extremamente excitado) e dominância (1=totalmente controlado, 9=totalmente no controle). Procedimento: consentimento, pré-questionário demográfico, familiarização com simulador (~3min), prática livre do sistema de infotainment, experimento formal (velocidade constante 60km/h, faixa central, prompts de voz a cada 2min para executar NDRT), questionário SAM pós-teste. Desempenho de NDRT: tempo de conclusão e taxa de erro via gravação de vídeo 60fps.",

    "analise_estatistica": "RM-ANOVA de três fatores (TFM×TFI×NTD) separada para cada dimensão do SAM (valência, arousal, dominância). Verificação de pressupostos: normalidade (gráficos Q-Q e stem-and-leaf), esfericidade (teste de Mauchly, p>0.05), correção Greenhouse-Geisser quando violada. Consistência interna: Cronbach's α para valência=0.76, arousal=0.90, dominância=0.94. Efeito principal de TFM: valência F(1,41)=10.96, p=0.002, η²p=0.21; dominância F(1,41)=11.53, p=0.002, η²p=0.22. Touchscreen induziu maior valência (+1.16) e menor dominância (-0.49) que botões físicos. Efeito principal de TFI: valência F(2,40)=4.63, p=0.015, η²p=0.19; arousal F(2,40)=10.13, p<0.001, η²p=0.23. Efeito principal de NTD: valência F(1,41)=78.82, p<0.001, η²p=0.658; arousal F(1,41)=9.57, p=0.004, η²p=0.189. Interação TFM×TFI: valência F(1.75,14.44)=4.90, p=0.013, η²p=0.11; arousal F(2,40)=14.57, p<0.001, η²p=0.42. Interação TFM×TFI×NTD: valência F(2,40)=3.25, p=0.049, η²p=0.14; dominância F(2,40)=3.37, p=0.044, η²p=0.14. Análise de efeitos simples com correções Bonferroni. Desempenho NDRT: efeito de TFM em tempo (p=0.014) e taxa de erro (p=0.038), efeito de NTD em tempo (p<0.001), interação TFM×TFI em tempo (p=0.006) e taxa de erro (p<0.001). Correlação significativa: valência×dominância (r=-0.166, p<0.01), valência×tempo (r=-0.306, p<0.01), arousal×dominância (r=0.534, p<0.01), tempo×erro (r=0.371, p<0.01). Software: SPSS 27.0, α=0.05, IC 95%.",

    "resultados": "Touchscreen evoca estados emocionais mais positivos que botões físicos: maior valência (+0.75) e menor dominância (-0.52), tendendo à satisfação no modelo tridimensional de emoções. Intensidade de feedback em touchscreen positivamente correlacionada com valência e arousal: alta intensidade (M=6.10, SD=1.95) significativamente maior que baixa (CI[0.476,1.834], p=0.001). Para botões físicos, não houve diferenças significativas entre intensidades em comparações pareadas. Interação TFM×TFI×NTD: em tarefas simples, touchscreen de baixa intensidade teve menor valência (significativamente menor que média e alta); em tarefas complexas, touchscreen de média intensidade teve valência maior que botões físicos (+1.28, CI[0.60,1.97], p<0.001). Botões físicos de alta intensidade diminuem valência em tarefas simples; em tarefas complexas, intensidade não afeta significativamente valência. NDRTs simples receberam maiores avaliações de valência em todas as condições. Touchscreen demonstra eficiência e acurácia operacional superior e mais estável. Correlação negativa entre valência e tempo de conclusão (r=-0.306): menor tempo associado a maior prazer. Modelo tridimensional de emoções sugere que touchscreen com feedback moderado-alto induz satisfação (alta valência, arousal moderado, baixa dominância).",

    "contribuicoes": "1) Primeira investigação sistemática comparando efeitos de modo (touchscreen vs botões físicos) e intensidade de feedback tátil em emoções de motoristas usando framework dimensional (SAM). 2) Evidência de que touchscreen induz estados emocionais mais positivos (maior valência, menor dominância) que botões físicos em contexto de direção. 3) Demonstração de correlação positiva entre intensidade de vibração em touchscreen e valência emocional do motorista. 4) Identificação de efeito negativo de feedback de alta intensidade em botões físicos sobre valência emocional, especialmente em tarefas simples. 5) Revelação de que complexidade de NDRT modula impacto de feedback tátil em emoções: em tarefas complexas, diferenças de intensidade em botões físicos tornam-se não significativas devido à redução de sensibilidade tátil sob carga cognitiva elevada. 6) Validação de eficiência e acurácia de tarefas como indicadores preditivos de estado emocional do motorista. 7) Diretrizes de design: evitar exigir botões físicos para NDRTs excessivamente complexos; preferir touchscreen com feedback moderado-alto para maximizar experiência emocional positiva. 8) Framework teórico integrando percepção tátil (compliance, espacialidade), processamento neural e julgamentos afetivos para explicar impacto de feedback tátil em emoções.",

    "limitacoes": "Estudo obteve estados emocionais subjetivos de curto prazo apenas - emoções são dinâmicas e direção é contínua; pesquisas futuras devem focar em efeitos de longo prazo. Ausência de vibrações reais de estrada e veículo em ambiente de laboratório pode ter afetado experiência completa de feedback tátil. Participantes não executaram tarefas de direção específicas além de manter atenção às condições da via, possivelmente reduzindo percepção de riscos e afetando avaliações subjetivas. Design within-subjects pode ter criado efeito de aprendizado devido à exposição repetida às NDRTs. Participantes principalmente jovens e meia-idade (idade média 24.76 anos) podem não ser representativos de motoristas em geral - percepção tátil, experiência de direção e tolerância à carga cognitiva variam com idade. Relação afetiva na Hipótese 3 não foi diretamente suportada por dados de intensidade tátil percebida - relação complexa entre carga cognitiva e emoção requer pesquisa adicional. Fatores externos como compliance individual dos dedos, JND (Just Notable Difference), experiência prévia com HMI e hábitos de operação podem ter influenciado resultados.",

    "topico": "Tactile Feedback, In-Vehicle Central Control Interface, Driver Emotion, Touchscreen, Physical Button, Human-Machine Interaction (HMI), Self-Assessment Manikin (SAM), Emotional Valence, Arousal, Dominance, Non-Driving Related Tasks (NDRT), Vibrotactile Feedback, Force Feedback, Haptic Perception, Cognitive Load, Automotive User Interface, Driving Simulator, Within-Subject Design, RM-ANOVA, Compliance, Affective Computing, User Experience, Automotive Design, Tactile Sensitivity",
    "area_aplicacao": "Automotive Industry, In-Vehicle Infotainment Systems, Human-Machine Interaction Design, Automotive User Interface Design, Driver Experience, Road Safety, Haptic Interface Design, Emotional Design, Product Design, Ergonomics, Consumer Electronics, Touch Interface Design",

    "tipo_dados": "Avaliações subjetivas de emoção (escala SAM 9 pontos: valência, arousal, dominância), tempo de conclusão de NDRT (s), taxa de erro de NDRT, dados demográficos (idade, sexo, experiência de direção), parâmetros de feedback tátil (frequência Hz, força N)",
    "dataset": "Não aplicável - experimento com simulador de direção, 42 participantes, 12 condições experimentais por participante (2 TFM × 3 TFI × 2 NTD)",
    "frameworks": "City Car Driving (simulador de direção), iPad Pro 10.5\" (touchscreen), Arduino (processamento de sinais), FSR (sensor de pressão), Atuador de vibração responsivo (50-250Hz), Botões físicos de silicone rubber (2-7N), SPSS 27.0 (análise estatística), Self-Assessment Manikin SAM (medição de emoções), Câmera de vídeo 60fps (observação comportamental)",
    "link_codigo": "Não disponível (Data will be made available on request)"
  },
  {
    "numero": 52,
    "nome_arquivo": "UDP-RT_ A UDP-based reliable transmission scheme for power WAPS.pdf",

    "autores": "Qiuyu Lu; June Li; Kai Yuan; Kaipei Liu; Ming Ni; Jianbo Luo",
    "ano": 2023,
    "titulo": "UDP-RT: A UDP-based reliable transmission scheme for power WAPS",
    "subtitulo": "",
    "journal": "Computer Networks",
    "publisher": "Elsevier",

    "objetivo": "Propor um esquema de transmissão confiável baseado em UDP (UDP-RT) para sistemas de proteção de área ampla de energia (WAPS), que alcança baixa latência adotando UDP na camada de transporte e alta confiabilidade adicionando mecanismos de correção de erros, detecção de erros, reenvio e retransmissão por timeout na camada de aplicação. O trabalho visa resolver o problema de que TCP não garante tempo real (devido ao mecanismo de controle de congestionamento que reduz taxa de envio) enquanto UDP não garante confiabilidade, propondo uma solução que atenda aos requisitos de tempo real e confiabilidade das comunicações WAPS mesmo em estados de congestionamento de rede.",

    "metodologia": "Arquitetura UDP-RT em duas camadas: (1) Camada de transporte: UDP com checksum desabilitado para garantir entrega em tempo real independente do estado de congestionamento da rede, permitindo que mensagens com erros sejam submetidas à camada de aplicação para correção. (2) Camada de aplicação: quatro mecanismos - correção de erros, detecção de erros, reenvio e retransmissão por timeout. Mecanismo de correção de erros: comparação de quatro códigos (Turbo codes, BCH, RS codes, LDPC, TPC) considerando desempenho em alta taxa de código e complexidade. Seleção de Turbo Product Codes (TPCs) por melhor desempenho em alta taxa de código e menor complexidade. TPC bidimensional construído com Extended Hamming Code como código componente C(n,k,d). Seleção de TPC(64,57,4)×(64,57,4) para codificação em blocos (n_p=4096bits, k_p=3249bits, r_p=847bits). Regra de bloqueio para TPCs: mensagens 1-406 bytes = 1 bloco (106 bytes check code, 7 erros aleatórios + 1 burst <64bits), 407-812 bytes = 2 blocos (212 bytes, 14 erros + 2 bursts), 813-1152 bytes = 3 blocos (318 bytes, 21 erros + 3 bursts). Decodificação hard-decision por mensagem ser string binária após decapsulação UDP. Taxa de erro de bit do canal baseada no VC-12 path (SESR = 2.52×10⁻⁴ conforme GB/T 13619-2009). Mecanismo de detecção de erros: algoritmo idêntico ao checksum UDP para identificar se todos os erros foram corrigidos (Md = F(Mr, Mc)), código de 2 bytes. Mecanismo de reenvio: enviar mensagem M = [Mr, Mc, Md] N vezes em sucessão rápida sem esperar confirmação do receptor (diferente de retransmissão TCP que espera timeout). Mecanismo de retransmissão por timeout (opcional): timer automático após último reenvio, usando algoritmo de Karn para calcular RTO. Simulação em OPNET: rede de despacho provincial de energia com 1 centro provincial e 10 centros regionais, backbone dual homing com 4 cadeias em anel 155/1000M. PMUs enviando medições a 50Hz, mensagens de 256 bytes. Hosts de ataque conectados ao switch 1 (backplane 1000Mbps) com throughput malicioso de 1240Mbps. Validação experimental: duas máquinas virtuais Linux como sender e receiver. Procedimento de envio: entrada de comprimento de mensagem, geração aleatória, codificação, opções a1 (sem erro), a2 (erros dentro da capacidade de correção), a3 (erros além da capacidade). Procedimento de recepção: decapsulação, decodificação, detecção, exibição ou descarte.",

    "analise_estatistica": "Avaliação do mecanismo de reenvio: taxa de perda de pacotes e atraso médio end-to-end com N=2,3,4,5 - resultados mostram que ambas métricas praticamente não são afetadas pelo aumento de N sob congestionamento. Cálculo do N ótimo: quando atraso end-to-end T_eu=40.59ms (máximo permitido para retransmissão), throughput malicioso=1002Mbps, taxa de perda P=4.53%. Probabilidade de todas N mensagens perdidas: P_raw=(4.53%)^N. Para N=3: P_raw=0.0093%<0.1%; para N=2: P_raw=0.2052%>0.1%. Logo N=3 é ótimo. Simulação de atraso end-to-end: rede não congestionada: T¹_eu≈1.33822ms (UDP-RT), T¹_et≈1.34271ms (TCP) - aproximadamente iguais. Rede congestionada (1010-1240Mbps maliciosos): T²_eu≈76ms (UDP-RT), T²_et=1s a 48s (TCP). Cálculo de atrasos de comunicação: T_a (encoding+decoding) = 12.467ms + 10.168ms = 22.64ms (média de 20 execuções). T_s (envio) = (418×8)bits/100Mbps = 33.44μs. T_i (inter-frame) = 0.96μs. UDP-RT: T¹_UDP-RT = 24.06ms (não congestionado), T²_UDP-RT = 99.70ms (congestionado). TCP: T¹_TCP = 9.45ms (não congestionado), T²_TCP = 7s a 306s (congestionado), assumindo T_rto = 3T_et. Atrasos de resposta de proteção (out-of-step relaying, T≤500ms): T_A=40ms (aquisição), T_S=40ms (intervalo de amostragem), T_D=50ms (decisão). UDP-RT: T¹=178ms, T²=327ms - ambos << 500ms. TCP: T³=149ms (ok), T⁴=14s a 607s (falha). Análise de confiabilidade: P_UDP-RT = 1-[P_e×P_1×P_2×(1-P¹_d)+P¹_d]^N. P_1=P'_1=P''_1=2⁻¹⁶ (checksum), P_2=1×10⁻⁵ (correção TPC), P_e=2.52×10⁻⁴, N=3. Taxas de perda medidas (1240Mbps malicioso): P¹_d=0.158, P²_d=0.259, P³_d=0.161. Resultados: P_UDP-RT=99.606%, P_TCP=98.263%, P_IEC61850/Fan=99.583%. Complexidade de encoding/decoding: O(n_p^(3/2)) - baixa.",

    "resultados": "Validação experimental confirma corretude dos Algoritmos 1 e 2: (1) opção a1 (sem erros): receptor exibe mensagem correta; (2) opção a2 (erros dentro da capacidade): receptor corrige todos os erros e exibe mensagem corrigida; (3) opção a3 (erros além da capacidade): receptor não consegue corrigir e descarta mensagem. Regra de bloqueio funciona corretamente para diferentes comprimentos de mensagem. Mecanismo de reenvio não aumenta congestionamento da rede nem afeta desempenho em tempo real das mensagens - taxa de perda e atraso praticamente inalterados com aumento de N. Com N=3, probabilidade de todas as mensagens reenviadas serem perdidas se aproxima de zero em congestionamento leve; mecanismo de retransmissão por timeout é opcional. UDP-RT atende requisitos de tempo real de funções de proteção de área ampla mesmo com congestionamento: tempo de resposta de out-of-step relaying de 178ms (não congestionado) e 327ms (congestionado), ambos muito abaixo do máximo de 500ms. TCP falha em congestionamento com tempo de resposta de 14s a 607s. Desempenho em tempo real de UDP-RT muito superior a TCP com mesma taxa de perda de mensagens. UDP-RT tem maior confiabilidade (99.606%) que TCP (98.263%), IEC61850-90-5 (99.583%) e esquema Fan et al. (99.583%). Atraso end-to-end de UDP-RT permanece em ~76ms sob congestionamento severo, enquanto TCP aumenta para 1-48s. Tempo de encoding e decoding de TPCs é aceitável (22.64ms total) com impacto negligenciável no desempenho das aplicações.",

    "contribuicoes": "1) Esquema UDP-RT que combina UDP na camada de transporte (baixa latência) com mecanismos de correção de erros, detecção de erros, reenvio e retransmissão por timeout na camada de aplicação (alta confiabilidade) - primeira combinação desses mecanismos para WAPS. 2) Mecanismo de correção de erros baseado em TPC(64,57,4)×(64,57,4) com análise comparativa de cinco códigos de correção de erros, demonstrando que TPCs têm melhor desempenho em alta taxa de código e menor complexidade que Turbo codes, BCH, RS codes e LDPC. 3) Regra de bloqueio para TPCs considerando características de canais de fibra óptica e mensagens WAPS (~250 bytes), calculando número de blocos para mensagens de diferentes comprimentos. 4) Mecanismo de detecção de erros usando algoritmo de checksum UDP na camada de aplicação sem aumentar atraso de processamento (checksum UDP desabilitado). 5) Mecanismo de reenvio que envia mensagem N vezes em sucessão rápida (N=3 ótimo) diferente de retransmissão TCP - intervalo entre mensagens muito menor e independente do estado da rede. 6) Demonstração de que mecanismo de retransmissão por timeout pode ser opcional para funções com requisitos de tempo real extremamente altos. 7) Algoritmos 1 e 2 de UDP-RT para implementação em sender e receiver, validados experimentalmente. 8) Análise demonstrando que UDP-RT pode atender requisitos de tempo real de maioria das funções WAPS quando rede congestionada (TCP não consegue) e tem maior confiabilidade que TCP e esquemas UDP existentes (IEC61850-90-5, Fan et al.).",

    "limitacoes": "Mecanismo de retransmissão por timeout pode não garantir entrega em tempo real para funções com requisitos extremamente altos quando rede fortemente congestionada - mensagem retransmitida pode não chegar a tempo e ser usada apenas para alarme ou rastreamento de acidentes. Múltiplos reenvios aumentam tráfego de rede, embora validação mostre impacto negligenciável - contagem de reenvio deve ser configurada baseada na capacidade do canal ou considerada no planejamento de rede. Validação limitada a simulação OPNET com rede de despacho provincial e experimento de bancada com máquinas virtuais Linux - não testado em rede WAPS real em produção. Tempo de encoding/decoding de TPCs de 22.64ms pode ser significativo para aplicações extremamente sensíveis a latência, embora seja aceitável para requisitos típicos de WAPS. Implementação requer modificação na camada de aplicação e desabilitação de checksum UDP através de programação de socket. Análise assume condições específicas (mensagens de 256 bytes, bandwidth 100Mbps, throughput malicioso específico) - resultados podem variar em outras configurações. Esquema não aborda segurança cibernética como autenticação ou criptografia das mensagens.",

    "topico": "UDP, Reliable Transmission, Power Wide-Area Protection System (WAPS), Error Correction, Turbo Product Codes (TPC), Error Detection, Resending Mechanism, Timeout Retransmission, Real-time Communication, Network Congestion, TCP/IP Networks, Low Latency, High Reliability, PMU, GOOSE, R-SV, IEC61850-90-5, Out-of-step Relaying, Power Angle Stability, Checksum, Hard Decision Decoding, Extended Hamming Code, Block Coding, Transport Layer Protocol, Application Layer Mechanisms, Wide-Area Monitoring Protection and Control (WAMPAC), Communication Delay, End-to-End Delay, Message Loss Rate, Correct Rate, Arrival Rate, OPNET Simulation",
    "area_aplicacao": "Power Grid, Wide-Area Protection System (WAPS), Smart Grid, Power System Stability, Industrial Control Systems, Real-time Communication Networks, Energy Distribution, SCADA Systems, Power Dispatching Networks, PMU Communication, Substation Automation, Power System Control, Critical Infrastructure Protection, Wide-Area Monitoring Systems (WAMS)",

    "tipo_dados": "Atraso end-to-end (ms), taxa de perda de pacotes (%), taxa de confiabilidade (%), tempos de encoding/decoding (ms), throughput de tráfego malicioso (Mbps), comprimento de mensagens (bytes), taxa de erro de bit de canal, intervalos de amostragem PMU (Hz), atrasos de comunicação calculados",
    "dataset": "Não aplicável - simulação em OPNET com rede de despacho provincial de energia (1 centro provincial, 10 centros regionais de despacho, backbone dual homing 155/1000M) e experimentos em máquinas virtuais Linux como sender/receiver",
    "frameworks": "OPNET (simulação de rede de despacho provincial), Máquinas virtuais Linux (validação experimental), TPC(64,57,4)×(64,57,4) (código de correção de erros com Extended Hamming Code), UDP socket programming com checksum desabilitado (setsockopt NoChecksum), Algoritmos 1 e 2 de UDP-RT (pseudocódigo para implementação), Algoritmo de Karn (cálculo de RTO)",
    "link_codigo": "Não disponível (No data was used for the research described in the article)"
  }
]
