[
  {
    "_comentario": "ESTE É UM EXEMPLO - NÃO PREENCHER, APENAS REFERÊNCIA",
    "_arquivo_parte": "PARTE 5 - Contém artigos 51+. Artigos 1-15 em artigos_part1.json, 16-27 em artigos_part2.json, 28-38 em artigos_part3.json, 39-50 em artigos_part4.json",
    "numero": 0,
    "nome_arquivo": "nome_do_arquivo.pdf",

    "_comentario_artigos_grandes": "Para artigos muito grandes (>10 páginas ou erro 413 na API): 1) Dividir PDF em partes menores (ex: _parte01.pdf, _parte02.pdf); 2) Ler de 3 em 3 partes para não sobrecarregar contexto; 3) Criar arquivo artigoN_resumo.md com resumo detalhado de cada parte; 4) Após processar todas as partes, adicionar entrada resumida aqui no JSON. Exemplo: artigo 9 foi dividido em 8 partes e resumido em artigo9_resumo.md",

    "_comentario_identificacao": "Informações bibliográficas do artigo - NOMES DOS AUTORES DEVEM ESTAR COMPLETOS conforme aparecem no PDF",
    "autores": "Nome Completo; Nome Completo 2 (separados por ponto e vírgula)",
    "ano": 2024,
    "titulo": "Título completo do artigo",
    "subtitulo": "Subtítulo se houver",
    "journal": "Nome do periódico/conferência",
    "publisher": "Editora (Elsevier, IEEE, Springer, etc.)",

    "_comentario_conteudo": "Análise do conteúdo científico",
    "objetivo": "Objetivo principal do artigo - o que os autores buscam resolver/propor",
    "metodologia": "Métodos, algoritmos, arquiteturas e abordagens utilizadas",
    "analise_estatistica": "Métricas, testes estatísticos, tamanho de amostra, distribuições",
    "resultados": "Principais resultados quantitativos e qualitativos",
    "contribuicoes": "Contribuições originais do trabalho",
    "limitacoes": "Limitações identificadas pelos autores ou observadas",

    "_comentario_classificacao": "Classificação e categorização",
    "topico": "Palavras-chave principais (ex: Edge Computing, IoT, Machine Learning)",
    "area_aplicacao": "Domínios de aplicação (ex: Robótica, Veículos Autônomos, Indústria 4.0)",

    "_comentario_recursos": "Recursos práticos e reprodutibilidade",
    "tipo_dados": "Tipo de dados utilizados (ex: Imagens, Séries Temporais, Texto)",
    "dataset": "Nome dos datasets utilizados (se aplicável)",
    "frameworks": "Frameworks, bibliotecas e ferramentas utilizadas",
    "link_codigo": "URL do repositório de código (se disponível)"
  },
  {
    "numero": 51,
    "nome_arquivo": "The influence of tactile feedback in In-vehicle central control interfaces on driver emotions_ A comparative study of touchscreens and physical buttons.pdf",

    "autores": "Faren Huo; Tai Wang; Fei Fang; Cong Sun",
    "ano": 2024,
    "titulo": "The influence of tactile feedback in In-vehicle central control interfaces on driver emotions: A comparative study of touchscreens and physical buttons",
    "subtitulo": "",
    "journal": "International Journal of Industrial Ergonomics",
    "publisher": "Elsevier",

    "objetivo": "Investigar os efeitos do modo de feedback tátil (TFM - touchscreen vs botões físicos) e intensidade de feedback tátil (TFI - alta, média, baixa) nas emoções dos motoristas durante a interação com interfaces de controle central veicular. O estudo visa fornecer suporte teórico para o design emocional de feedback tátil em interfaces de controle central veicular.",

    "metodologia": "Experimento de direção simulada com design within-subject 2×3×2. Participantes: 42 motoristas (25 mulheres, 17 homens), idade média 24.76 anos (SD=4.46), experiência de direção 3.17 anos (SD=2.93). Variáveis independentes: TFM (feedback de vibração em touchscreen vs feedback de força em botões físicos), TFI (alta: 250Hz/7N, média: 150Hz/4.5N, baixa: 50Hz/2N), NTD (dificuldade de tarefas não relacionadas à direção: simples vs complexa). Aparato: simulador de média fidelidade com display de 65 polegadas (3840×2160), volante, pedais, City Car Driving (estrada urbana de 3 faixas, 5km, ~15 veículos/km). Touchscreen: iPad Pro 10.5\" com atuador de vibração responsivo, sensor de pressão FSR, Arduino, transmissão wireless. Botões físicos: silicone rubber com estrutura interna típica automotiva (curva força-deslocamento F1-F2-Fc), fixados em caixa 18×25×5cm. Tarefas NDRT: reprodução de música (simples, 3 passos, metade superior do HMI) e ajuste de temperatura (complexa, 7 passos não-lógicos, metade inferior do HMI). Medição de emoções: Self-Assessment Manikin (SAM) com escala Likert de 9 pontos para valência (1=extremamente desagradável, 9=extremamente agradável), arousal (1=extremamente calmo, 9=extremamente excitado) e dominância (1=totalmente controlado, 9=totalmente no controle). Procedimento: consentimento, pré-questionário demográfico, familiarização com simulador (~3min), prática livre do sistema de infotainment, experimento formal (velocidade constante 60km/h, faixa central, prompts de voz a cada 2min para executar NDRT), questionário SAM pós-teste. Desempenho de NDRT: tempo de conclusão e taxa de erro via gravação de vídeo 60fps.",

    "analise_estatistica": "RM-ANOVA de três fatores (TFM×TFI×NTD) separada para cada dimensão do SAM (valência, arousal, dominância). Verificação de pressupostos: normalidade (gráficos Q-Q e stem-and-leaf), esfericidade (teste de Mauchly, p>0.05), correção Greenhouse-Geisser quando violada. Consistência interna: Cronbach's α para valência=0.76, arousal=0.90, dominância=0.94. Efeito principal de TFM: valência F(1,41)=10.96, p=0.002, η²p=0.21; dominância F(1,41)=11.53, p=0.002, η²p=0.22. Touchscreen induziu maior valência (+1.16) e menor dominância (-0.49) que botões físicos. Efeito principal de TFI: valência F(2,40)=4.63, p=0.015, η²p=0.19; arousal F(2,40)=10.13, p<0.001, η²p=0.23. Efeito principal de NTD: valência F(1,41)=78.82, p<0.001, η²p=0.658; arousal F(1,41)=9.57, p=0.004, η²p=0.189. Interação TFM×TFI: valência F(1.75,14.44)=4.90, p=0.013, η²p=0.11; arousal F(2,40)=14.57, p<0.001, η²p=0.42. Interação TFM×TFI×NTD: valência F(2,40)=3.25, p=0.049, η²p=0.14; dominância F(2,40)=3.37, p=0.044, η²p=0.14. Análise de efeitos simples com correções Bonferroni. Desempenho NDRT: efeito de TFM em tempo (p=0.014) e taxa de erro (p=0.038), efeito de NTD em tempo (p<0.001), interação TFM×TFI em tempo (p=0.006) e taxa de erro (p<0.001). Correlação significativa: valência×dominância (r=-0.166, p<0.01), valência×tempo (r=-0.306, p<0.01), arousal×dominância (r=0.534, p<0.01), tempo×erro (r=0.371, p<0.01). Software: SPSS 27.0, α=0.05, IC 95%.",

    "resultados": "Touchscreen evoca estados emocionais mais positivos que botões físicos: maior valência (+0.75) e menor dominância (-0.52), tendendo à satisfação no modelo tridimensional de emoções. Intensidade de feedback em touchscreen positivamente correlacionada com valência e arousal: alta intensidade (M=6.10, SD=1.95) significativamente maior que baixa (CI[0.476,1.834], p=0.001). Para botões físicos, não houve diferenças significativas entre intensidades em comparações pareadas. Interação TFM×TFI×NTD: em tarefas simples, touchscreen de baixa intensidade teve menor valência (significativamente menor que média e alta); em tarefas complexas, touchscreen de média intensidade teve valência maior que botões físicos (+1.28, CI[0.60,1.97], p<0.001). Botões físicos de alta intensidade diminuem valência em tarefas simples; em tarefas complexas, intensidade não afeta significativamente valência. NDRTs simples receberam maiores avaliações de valência em todas as condições. Touchscreen demonstra eficiência e acurácia operacional superior e mais estável. Correlação negativa entre valência e tempo de conclusão (r=-0.306): menor tempo associado a maior prazer. Modelo tridimensional de emoções sugere que touchscreen com feedback moderado-alto induz satisfação (alta valência, arousal moderado, baixa dominância).",

    "contribuicoes": "1) Primeira investigação sistemática comparando efeitos de modo (touchscreen vs botões físicos) e intensidade de feedback tátil em emoções de motoristas usando framework dimensional (SAM). 2) Evidência de que touchscreen induz estados emocionais mais positivos (maior valência, menor dominância) que botões físicos em contexto de direção. 3) Demonstração de correlação positiva entre intensidade de vibração em touchscreen e valência emocional do motorista. 4) Identificação de efeito negativo de feedback de alta intensidade em botões físicos sobre valência emocional, especialmente em tarefas simples. 5) Revelação de que complexidade de NDRT modula impacto de feedback tátil em emoções: em tarefas complexas, diferenças de intensidade em botões físicos tornam-se não significativas devido à redução de sensibilidade tátil sob carga cognitiva elevada. 6) Validação de eficiência e acurácia de tarefas como indicadores preditivos de estado emocional do motorista. 7) Diretrizes de design: evitar exigir botões físicos para NDRTs excessivamente complexos; preferir touchscreen com feedback moderado-alto para maximizar experiência emocional positiva. 8) Framework teórico integrando percepção tátil (compliance, espacialidade), processamento neural e julgamentos afetivos para explicar impacto de feedback tátil em emoções.",

    "limitacoes": "Estudo obteve estados emocionais subjetivos de curto prazo apenas - emoções são dinâmicas e direção é contínua; pesquisas futuras devem focar em efeitos de longo prazo. Ausência de vibrações reais de estrada e veículo em ambiente de laboratório pode ter afetado experiência completa de feedback tátil. Participantes não executaram tarefas de direção específicas além de manter atenção às condições da via, possivelmente reduzindo percepção de riscos e afetando avaliações subjetivas. Design within-subjects pode ter criado efeito de aprendizado devido à exposição repetida às NDRTs. Participantes principalmente jovens e meia-idade (idade média 24.76 anos) podem não ser representativos de motoristas em geral - percepção tátil, experiência de direção e tolerância à carga cognitiva variam com idade. Relação afetiva na Hipótese 3 não foi diretamente suportada por dados de intensidade tátil percebida - relação complexa entre carga cognitiva e emoção requer pesquisa adicional. Fatores externos como compliance individual dos dedos, JND (Just Notable Difference), experiência prévia com HMI e hábitos de operação podem ter influenciado resultados.",

    "topico": "Tactile Feedback, In-Vehicle Central Control Interface, Driver Emotion, Touchscreen, Physical Button, Human-Machine Interaction (HMI), Self-Assessment Manikin (SAM), Emotional Valence, Arousal, Dominance, Non-Driving Related Tasks (NDRT), Vibrotactile Feedback, Force Feedback, Haptic Perception, Cognitive Load, Automotive User Interface, Driving Simulator, Within-Subject Design, RM-ANOVA, Compliance, Affective Computing, User Experience, Automotive Design, Tactile Sensitivity",
    "area_aplicacao": "Automotive Industry, In-Vehicle Infotainment Systems, Human-Machine Interaction Design, Automotive User Interface Design, Driver Experience, Road Safety, Haptic Interface Design, Emotional Design, Product Design, Ergonomics, Consumer Electronics, Touch Interface Design",

    "tipo_dados": "Avaliações subjetivas de emoção (escala SAM 9 pontos: valência, arousal, dominância), tempo de conclusão de NDRT (s), taxa de erro de NDRT, dados demográficos (idade, sexo, experiência de direção), parâmetros de feedback tátil (frequência Hz, força N)",
    "dataset": "Não aplicável - experimento com simulador de direção, 42 participantes, 12 condições experimentais por participante (2 TFM × 3 TFI × 2 NTD)",
    "frameworks": "City Car Driving (simulador de direção), iPad Pro 10.5\" (touchscreen), Arduino (processamento de sinais), FSR (sensor de pressão), Atuador de vibração responsivo (50-250Hz), Botões físicos de silicone rubber (2-7N), SPSS 27.0 (análise estatística), Self-Assessment Manikin SAM (medição de emoções), Câmera de vídeo 60fps (observação comportamental)",
    "link_codigo": "Não disponível (Data will be made available on request)"
  },
  {
    "numero": 52,
    "nome_arquivo": "UDP-RT_ A UDP-based reliable transmission scheme for power WAPS.pdf",

    "autores": "Qiuyu Lu; June Li; Kai Yuan; Kaipei Liu; Ming Ni; Jianbo Luo",
    "ano": 2023,
    "titulo": "UDP-RT: A UDP-based reliable transmission scheme for power WAPS",
    "subtitulo": "",
    "journal": "Computer Networks",
    "publisher": "Elsevier",

    "objetivo": "Propor um esquema de transmissão confiável baseado em UDP (UDP-RT) para sistemas de proteção de área ampla de energia (WAPS), que alcança baixa latência adotando UDP na camada de transporte e alta confiabilidade adicionando mecanismos de correção de erros, detecção de erros, reenvio e retransmissão por timeout na camada de aplicação. O trabalho visa resolver o problema de que TCP não garante tempo real (devido ao mecanismo de controle de congestionamento que reduz taxa de envio) enquanto UDP não garante confiabilidade, propondo uma solução que atenda aos requisitos de tempo real e confiabilidade das comunicações WAPS mesmo em estados de congestionamento de rede.",

    "metodologia": "Arquitetura UDP-RT em duas camadas: (1) Camada de transporte: UDP com checksum desabilitado para garantir entrega em tempo real independente do estado de congestionamento da rede, permitindo que mensagens com erros sejam submetidas à camada de aplicação para correção. (2) Camada de aplicação: quatro mecanismos - correção de erros, detecção de erros, reenvio e retransmissão por timeout. Mecanismo de correção de erros: comparação de quatro códigos (Turbo codes, BCH, RS codes, LDPC, TPC) considerando desempenho em alta taxa de código e complexidade. Seleção de Turbo Product Codes (TPCs) por melhor desempenho em alta taxa de código e menor complexidade. TPC bidimensional construído com Extended Hamming Code como código componente C(n,k,d). Seleção de TPC(64,57,4)×(64,57,4) para codificação em blocos (n_p=4096bits, k_p=3249bits, r_p=847bits). Regra de bloqueio para TPCs: mensagens 1-406 bytes = 1 bloco (106 bytes check code, 7 erros aleatórios + 1 burst <64bits), 407-812 bytes = 2 blocos (212 bytes, 14 erros + 2 bursts), 813-1152 bytes = 3 blocos (318 bytes, 21 erros + 3 bursts). Decodificação hard-decision por mensagem ser string binária após decapsulação UDP. Taxa de erro de bit do canal baseada no VC-12 path (SESR = 2.52×10⁻⁴ conforme GB/T 13619-2009). Mecanismo de detecção de erros: algoritmo idêntico ao checksum UDP para identificar se todos os erros foram corrigidos (Md = F(Mr, Mc)), código de 2 bytes. Mecanismo de reenvio: enviar mensagem M = [Mr, Mc, Md] N vezes em sucessão rápida sem esperar confirmação do receptor (diferente de retransmissão TCP que espera timeout). Mecanismo de retransmissão por timeout (opcional): timer automático após último reenvio, usando algoritmo de Karn para calcular RTO. Simulação em OPNET: rede de despacho provincial de energia com 1 centro provincial e 10 centros regionais, backbone dual homing com 4 cadeias em anel 155/1000M. PMUs enviando medições a 50Hz, mensagens de 256 bytes. Hosts de ataque conectados ao switch 1 (backplane 1000Mbps) com throughput malicioso de 1240Mbps. Validação experimental: duas máquinas virtuais Linux como sender e receiver. Procedimento de envio: entrada de comprimento de mensagem, geração aleatória, codificação, opções a1 (sem erro), a2 (erros dentro da capacidade de correção), a3 (erros além da capacidade). Procedimento de recepção: decapsulação, decodificação, detecção, exibição ou descarte.",

    "analise_estatistica": "Avaliação do mecanismo de reenvio: taxa de perda de pacotes e atraso médio end-to-end com N=2,3,4,5 - resultados mostram que ambas métricas praticamente não são afetadas pelo aumento de N sob congestionamento. Cálculo do N ótimo: quando atraso end-to-end T_eu=40.59ms (máximo permitido para retransmissão), throughput malicioso=1002Mbps, taxa de perda P=4.53%. Probabilidade de todas N mensagens perdidas: P_raw=(4.53%)^N. Para N=3: P_raw=0.0093%<0.1%; para N=2: P_raw=0.2052%>0.1%. Logo N=3 é ótimo. Simulação de atraso end-to-end: rede não congestionada: T¹_eu≈1.33822ms (UDP-RT), T¹_et≈1.34271ms (TCP) - aproximadamente iguais. Rede congestionada (1010-1240Mbps maliciosos): T²_eu≈76ms (UDP-RT), T²_et=1s a 48s (TCP). Cálculo de atrasos de comunicação: T_a (encoding+decoding) = 12.467ms + 10.168ms = 22.64ms (média de 20 execuções). T_s (envio) = (418×8)bits/100Mbps = 33.44μs. T_i (inter-frame) = 0.96μs. UDP-RT: T¹_UDP-RT = 24.06ms (não congestionado), T²_UDP-RT = 99.70ms (congestionado). TCP: T¹_TCP = 9.45ms (não congestionado), T²_TCP = 7s a 306s (congestionado), assumindo T_rto = 3T_et. Atrasos de resposta de proteção (out-of-step relaying, T≤500ms): T_A=40ms (aquisição), T_S=40ms (intervalo de amostragem), T_D=50ms (decisão). UDP-RT: T¹=178ms, T²=327ms - ambos << 500ms. TCP: T³=149ms (ok), T⁴=14s a 607s (falha). Análise de confiabilidade: P_UDP-RT = 1-[P_e×P_1×P_2×(1-P¹_d)+P¹_d]^N. P_1=P'_1=P''_1=2⁻¹⁶ (checksum), P_2=1×10⁻⁵ (correção TPC), P_e=2.52×10⁻⁴, N=3. Taxas de perda medidas (1240Mbps malicioso): P¹_d=0.158, P²_d=0.259, P³_d=0.161. Resultados: P_UDP-RT=99.606%, P_TCP=98.263%, P_IEC61850/Fan=99.583%. Complexidade de encoding/decoding: O(n_p^(3/2)) - baixa.",

    "resultados": "Validação experimental confirma corretude dos Algoritmos 1 e 2: (1) opção a1 (sem erros): receptor exibe mensagem correta; (2) opção a2 (erros dentro da capacidade): receptor corrige todos os erros e exibe mensagem corrigida; (3) opção a3 (erros além da capacidade): receptor não consegue corrigir e descarta mensagem. Regra de bloqueio funciona corretamente para diferentes comprimentos de mensagem. Mecanismo de reenvio não aumenta congestionamento da rede nem afeta desempenho em tempo real das mensagens - taxa de perda e atraso praticamente inalterados com aumento de N. Com N=3, probabilidade de todas as mensagens reenviadas serem perdidas se aproxima de zero em congestionamento leve; mecanismo de retransmissão por timeout é opcional. UDP-RT atende requisitos de tempo real de funções de proteção de área ampla mesmo com congestionamento: tempo de resposta de out-of-step relaying de 178ms (não congestionado) e 327ms (congestionado), ambos muito abaixo do máximo de 500ms. TCP falha em congestionamento com tempo de resposta de 14s a 607s. Desempenho em tempo real de UDP-RT muito superior a TCP com mesma taxa de perda de mensagens. UDP-RT tem maior confiabilidade (99.606%) que TCP (98.263%), IEC61850-90-5 (99.583%) e esquema Fan et al. (99.583%). Atraso end-to-end de UDP-RT permanece em ~76ms sob congestionamento severo, enquanto TCP aumenta para 1-48s. Tempo de encoding e decoding de TPCs é aceitável (22.64ms total) com impacto negligenciável no desempenho das aplicações.",

    "contribuicoes": "1) Esquema UDP-RT que combina UDP na camada de transporte (baixa latência) com mecanismos de correção de erros, detecção de erros, reenvio e retransmissão por timeout na camada de aplicação (alta confiabilidade) - primeira combinação desses mecanismos para WAPS. 2) Mecanismo de correção de erros baseado em TPC(64,57,4)×(64,57,4) com análise comparativa de cinco códigos de correção de erros, demonstrando que TPCs têm melhor desempenho em alta taxa de código e menor complexidade que Turbo codes, BCH, RS codes e LDPC. 3) Regra de bloqueio para TPCs considerando características de canais de fibra óptica e mensagens WAPS (~250 bytes), calculando número de blocos para mensagens de diferentes comprimentos. 4) Mecanismo de detecção de erros usando algoritmo de checksum UDP na camada de aplicação sem aumentar atraso de processamento (checksum UDP desabilitado). 5) Mecanismo de reenvio que envia mensagem N vezes em sucessão rápida (N=3 ótimo) diferente de retransmissão TCP - intervalo entre mensagens muito menor e independente do estado da rede. 6) Demonstração de que mecanismo de retransmissão por timeout pode ser opcional para funções com requisitos de tempo real extremamente altos. 7) Algoritmos 1 e 2 de UDP-RT para implementação em sender e receiver, validados experimentalmente. 8) Análise demonstrando que UDP-RT pode atender requisitos de tempo real de maioria das funções WAPS quando rede congestionada (TCP não consegue) e tem maior confiabilidade que TCP e esquemas UDP existentes (IEC61850-90-5, Fan et al.).",

    "limitacoes": "Mecanismo de retransmissão por timeout pode não garantir entrega em tempo real para funções com requisitos extremamente altos quando rede fortemente congestionada - mensagem retransmitida pode não chegar a tempo e ser usada apenas para alarme ou rastreamento de acidentes. Múltiplos reenvios aumentam tráfego de rede, embora validação mostre impacto negligenciável - contagem de reenvio deve ser configurada baseada na capacidade do canal ou considerada no planejamento de rede. Validação limitada a simulação OPNET com rede de despacho provincial e experimento de bancada com máquinas virtuais Linux - não testado em rede WAPS real em produção. Tempo de encoding/decoding de TPCs de 22.64ms pode ser significativo para aplicações extremamente sensíveis a latência, embora seja aceitável para requisitos típicos de WAPS. Implementação requer modificação na camada de aplicação e desabilitação de checksum UDP através de programação de socket. Análise assume condições específicas (mensagens de 256 bytes, bandwidth 100Mbps, throughput malicioso específico) - resultados podem variar em outras configurações. Esquema não aborda segurança cibernética como autenticação ou criptografia das mensagens.",

    "topico": "UDP, Reliable Transmission, Power Wide-Area Protection System (WAPS), Error Correction, Turbo Product Codes (TPC), Error Detection, Resending Mechanism, Timeout Retransmission, Real-time Communication, Network Congestion, TCP/IP Networks, Low Latency, High Reliability, PMU, GOOSE, R-SV, IEC61850-90-5, Out-of-step Relaying, Power Angle Stability, Checksum, Hard Decision Decoding, Extended Hamming Code, Block Coding, Transport Layer Protocol, Application Layer Mechanisms, Wide-Area Monitoring Protection and Control (WAMPAC), Communication Delay, End-to-End Delay, Message Loss Rate, Correct Rate, Arrival Rate, OPNET Simulation",
    "area_aplicacao": "Power Grid, Wide-Area Protection System (WAPS), Smart Grid, Power System Stability, Industrial Control Systems, Real-time Communication Networks, Energy Distribution, SCADA Systems, Power Dispatching Networks, PMU Communication, Substation Automation, Power System Control, Critical Infrastructure Protection, Wide-Area Monitoring Systems (WAMS)",

    "tipo_dados": "Atraso end-to-end (ms), taxa de perda de pacotes (%), taxa de confiabilidade (%), tempos de encoding/decoding (ms), throughput de tráfego malicioso (Mbps), comprimento de mensagens (bytes), taxa de erro de bit de canal, intervalos de amostragem PMU (Hz), atrasos de comunicação calculados",
    "dataset": "Não aplicável - simulação em OPNET com rede de despacho provincial de energia (1 centro provincial, 10 centros regionais de despacho, backbone dual homing 155/1000M) e experimentos em máquinas virtuais Linux como sender/receiver",
    "frameworks": "OPNET (simulação de rede de despacho provincial), Máquinas virtuais Linux (validação experimental), TPC(64,57,4)×(64,57,4) (código de correção de erros com Extended Hamming Code), UDP socket programming com checksum desabilitado (setsockopt NoChecksum), Algoritmos 1 e 2 de UDP-RT (pseudocódigo para implementação), Algoritmo de Karn (cálculo de RTO)",
    "link_codigo": "Não disponível (No data was used for the research described in the article)"
  },
  {
    "numero": 53,
    "nome_arquivo": "Use of QUIC for AMQP in IoT networks.pdf",

    "autores": "Faheem Iqbal; Moneeb Gohar; Hanen Karamti; Walid Karamti; Seok-Joo Koh; Jin-Ghoo Choi",
    "ano": 2023,
    "titulo": "Use of QUIC for AMQP in IoT networks",
    "subtitulo": "",
    "journal": "Computer Networks",
    "publisher": "Elsevier",

    "objetivo": "Integrar o protocolo AMQP 1.0 com QUIC para reduzir latência e melhorar vida útil de bateria em dispositivos IoT. O trabalho visa resolver o problema de que TCP não garante tempo real devido ao three-way handshake e uso de TLS para segurança, enquanto UDP não garante confiabilidade. QUIC, padronizado pelo IETF, combina os melhores aspectos de UDP e TCP para fornecer comunicação rápida e confiável. AMQP 1.0 foi selecionado por ser um protocolo extensível e interoperável capaz de lidar com desafios de interconectividade em ambientes IoT heterogêneos.",

    "metodologia": "Implementação em linguagem Go utilizando pacotes nativos AMQP 1.0 e QUIC publicamente acessíveis. Desenvolvimento do pacote qConn para integrar AMQP 1.0 com QUIC, definindo funções Listen e Dial para criar broker, sender e receiver QUIC. Função qConn.Listen() usa quic.ListenAddrEarly() para criar QUIC Broker que retorna conexões antes do handshake completar, permitindo 0-RTT. Função qConn.Dial() usa quic.DialAddrEarly() para estabelecer novas conexões QUIC. Containerização com Docker para AMQP 1.0 Sender, Broker e Receiver. Simulação em NS3 (simulador de rede de eventos discretos) em máquina virtual com 4 processadores, 8GB RAM, Ubuntu 20.04 LTS. Rede WiFi LAN IEEE 802.11a operando a 5GHz com largura de banda de canal de 20MHz e Canal Número 36. Tap Bridges conectando containers Docker como ghost nodes no NS3. Esquema existente: AMQP 1.0 sobre TCP com TLS 1.2 (3-RTT para handshake). Esquema proposto: AMQP 1.0 sobre QUIC com TLS 1.3 integrado (1-RTT para handshake). Cenário de múltiplas conexões AMQP: 100 mensagens por experimento (uma mensagem por conexão), 30 repetições, total de 30000 amostras por esquema. Cenário de conexão única AMQP: 1000 mensagens em uma única conexão. Cenário de análise de energia: 10 conexões por experimento com mensagem de 138 bytes, 15 repetições. Modelo de energia NS3 linear/ideal com fonte de 3V, estados WiFi (Tx, Rx, CCA Busy, Idle, Sleep, Switching, Off). Variação de parâmetros de rede com ferramenta tc: Bandwidth (8, 16, 32, 512, 1024 Kbps), Delay (0, 200, 400, 600 ms), Packet Loss (0, 5, 10, 15%). Traces pcap habilitados no NS3 para coleta de resultados.",

    "analise_estatistica": "KPIs medidos: Total Communication Time (tempo do primeiro ao último pacote), Startup Latency (tempo até primeiro pacote de aplicação útil ser enviado), Round Trip Time (RTT), Throughput (bits/s ou Kbps), Consumo de Energia (J = V × A × s). Múltiplas conexões AMQP (30000 amostras): Total Communication Time para enviar 100 mensagens reduzido em 22% com QUIC; tempo de recebimento reduzido em 15%. Conexão única AMQP (1000 mensagens): RTT 71% maior para QUIC (12ms vs 7ms para TCP), porém Startup Latency reduzida em 62% (120ms QUIC vs 315ms TCP), Total Communication Time reduzida em 21%. Análise de energia (150 conexões totais): consumo médio AMQP/QUIC = 11.64J vs AMQP/TCP = 16.96J, redução de 31%; Total Communication Time AMQP/QUIC = 12.73s vs AMQP/TCP = 19.22s, redução de 34%. Impacto de Delay: em todos os cenários (0-600ms), AMQP/QUIC supera AMQP/TCP; com 600ms de delay, QUIC = 38.01ms vs TCP = 43.74ms. Impacto de Packet Loss: com 0% perda, QUIC = 5.09ms vs TCP = 6ms; com 15% perda, TCP dobra tempo (12.08ms) enquanto QUIC aumenta apenas 50% (7.26ms). Impacto de Channel Bandwidth: em bandas altas (≥32Kbps), QUIC supera TCP; em bandas baixas (<32Kbps), TCP supera QUIC devido ao overhead de segurança do QUIC. Volume de dados: QUIC transmitiu 3.5× mais dados que TCP (1278 KB vs 361 KB); Throughput: QUIC 7× maior que TCP (1216 Kbps vs 173 Kbps). Comparação de protocolos IoT (literatura): MQTT 0.1101s, AMQP 0.1255s, CoAP 0.8661s, HTTP 1.2360s.",

    "resultados": "Integração AMQP 1.0 com QUIC implementada e validada através de testes extensivos em NS3. Total Communication Time reduzido em 22% e Startup Latency reduzida em 62% utilizando QUIC ao invés de TCP na camada de transporte. Apesar do RTT ser 71% maior para QUIC, a melhoria em Startup Latency e Total Communication Time não pode ser atribuída ao RTT, demonstrando que o handshake 1-RTT do QUIC (vs 3-RTT do TCP+TLS) é o fator determinante. Consumo de energia reduzido em 31% usando QUIC. AMQP 1.0 sobre QUIC superou AMQP 1.0 sobre TCP em todos os cenários de delay testados (0-600ms). Em cenários de packet loss, QUIC demonstrou muito maior resiliência: com 15% de perda, TCP dobrou o tempo de comunicação enquanto QUIC aumentou apenas 50%. QUIC supera TCP em altas larguras de banda, porém TCP supera QUIC em baixas larguras de banda (<32Kbps) devido ao maior overhead de segurança do QUIC. AMQP/QUIC transportou 3.5× mais dados que AMQP/TCP, mas throughput foi 7× maior, resultando em menor tempo de comunicação. Os resultados demonstram que, com exceção do cenário de baixa largura de banda, o esquema proposto consistentemente supera o esquema existente. QUIC resolve problemas do TCP em IoT: head of line blocking, half open connections, necessidade de keep-alive packets, e permite connection migration através de Connection ID único.",

    "contribuicoes": "1) Primeira integração de AMQP 1.0 com QUIC, combinando protocolo de aplicação extensível e interoperável com protocolo de transporte rápido e confiável para IoT. 2) Desenvolvimento do pacote qConn em Go com funções Listen e Dial para criar QUIC broker, sender e receiver, utilizando quic.ListenAddrEarly() e quic.DialAddrEarly() para habilitar 0-RTT. 3) Metodologia de teste usando containerização Docker com Tap Bridges em NS3 para simular comunicação WiFi entre componentes AMQP. 4) Análise de energia usando NS3 Energy Framework com modelo de fonte linear, demonstrando redução de 31% no consumo de energia. 5) Avaliação extensiva sob diferentes condições de rede (delay, packet loss, channel bandwidth) com 30000 amostras, demonstrando que QUIC supera TCP em cenários de rede lossy típicos de IoT. 6) Demonstração de que melhoria em Startup Latency (62%) e Total Communication Time (22%) são devidas ao handshake 1-RTT do QUIC vs 3-RTT do TCP+TLS, não ao RTT que é 71% maior para QUIC. 7) Identificação de limitação do QUIC em cenários de baixa largura de banda (<32Kbps) devido ao overhead de segurança, importante para dispositivos IoT constrained. 8) Modificação da implementação Go de AMQP 1.0 para incluir TLS 1.2 conforme especificado no padrão AMQP 1.0.",

    "limitacoes": "Modelo de energia linear/ideal utilizado não representa consumo real de energia em redes de sensores sem fio - modelos não-lineares (como Rakhmatov Vrudhula) fornecem resultados mais precisos. Recursos de multi-streaming e connection migration do QUIC não foram testados - planejados para trabalho futuro. Apenas WiFi 802.11a foi utilizado para comunicação - escolha da versão WiFi específica não é crítica para comparação mas pode não representar todos os cenários IoT. QUIC apresenta pior desempenho que TCP em cenários de baixa largura de banda (<32Kbps) devido ao maior overhead de segurança - limitação importante para dispositivos IoT extremamente constrained. Testes realizados em simulador NS3 com máquina virtual - validação em hardware real (como Raspberry Pi) não foi realizada neste estudo. Comparação limitada a AMQP 1.0 - outros protocolos IoT como MQTT e CoAP também poderiam se beneficiar da integração com QUIC (trabalhos relacionados já existem). Análise de segurança não foi foco do estudo - apenas comparação de desempenho entre TLS 1.2 (TCP) e TLS 1.3 integrado (QUIC).",

    "topico": "QUIC, AMQP, AMQP 1.0, Internet of Things (IoT), Transport Layer Protocol, TCP, UDP, TLS 1.3, Low Latency, Energy Consumption, Docker, NS3 Simulator, WiFi 802.11a, Performance Analysis, Startup Latency, Round Trip Time (RTT), Throughput, Packet Loss, Channel Bandwidth, Delay, Connection Migration, Head of Line Blocking, 0-RTT Handshake, 1-RTT Handshake, Go Programming Language, Tap Bridge, Containerization, Message Broker, Publish/Subscribe, Request/Response, Interoperability, Heterogeneous IoT, Constrained Devices, Battery Life, Wireless Sensor Networks, Smart Cities, Smart Grids",
    "area_aplicacao": "Internet of Things (IoT), Smart Cities, Smart Grids, Telemetry, Smart Manufacturing, Smart Agriculture, Wireless Sensor Networks, Industrial IoT, Remote Surgery, Autonomous Vehicles, Smart Metering, Indoor IoT Applications, Constrained Devices, Battery-Powered Devices, Message Queue Systems, Real-time Communication",

    "tipo_dados": "Total Communication Time (s), Startup Latency (ms), Round Trip Time (ms), Throughput (Kbps), Consumo de Energia (J), Volume de Dados (KB), Taxa de Perda de Pacotes (%), Delay de Rede (ms), Largura de Banda de Canal (Kbps), traces pcap de simulação NS3",
    "dataset": "Não aplicável - simulação em NS3 com 30000 amostras (100 mensagens × 30 experimentos × 2 esquemas) para múltiplas conexões AMQP, e 150 conexões (10 × 15 repetições) para análise de energia",
    "frameworks": "Go programming language (implementação), Pacote AMQP 1.0 Go (github.com/apache/qpid-proton/go/pkg/electron), Pacote QUIC Go (github.com/lucas-clemente/quic-go), Docker (containerização de Sender/Broker/Receiver), NS3 (simulador de rede), NS3 Energy Module (análise de energia), NS3 WiFi Radio Model (modelo de consumo WiFi), tc tool (variação de parâmetros de rede), Tap Bridges (integração Docker-NS3), IEEE 802.11a WiFi (rede de comunicação simulada)",
    "link_codigo": "Não disponível (No data was used for the research described in the article) - Pacotes Go utilizados: https://pkg.go.dev/github.com/apache/qpid-proton/go/pkg/electron e https://pkg.go.dev/github.com/lucas-clemente/quic-go"
  },
  {
    "numero": 54,
    "nome_arquivo": "Visual-haptic feedback for ROV subsea navigation control.pdf",

    "autores": "Pengxiang Xia; Hengxu You; Jing Du",
    "ano": 2023,
    "titulo": "Visual-haptic feedback for ROV subsea navigation control",
    "subtitulo": "",
    "journal": "Automation in Construction",
    "publisher": "Elsevier B.V.",

    "objetivo": "Propor um sistema de augmentação sensorial baseado em Realidade Virtual (VR) com simuladores hápticos para gerar feedback imersivo, intuitivo e efetivo para operadores humanos de ROVs submarinos. O sistema converte parâmetros ambientais submarinos novos (como forças hidrodinâmicas) em sensações humanamente perceptíveis, incluindo simulação de características hidrodinâmicas como feedback visual (campo vetorial em VR) e feedback háptico (vibrações em traje háptico). O objetivo é melhorar a percepção e consciência situacional dos operadores em ambientes submarinos de baixa visibilidade, onde o streaming de vídeo tradicional 2D não consegue fornecer informações adequadas sobre correntes dinâmicas, visibilidade reduzida e interações com ecossistemas marinhos.",

    "metodologia": "Desenvolvimento de ambiente submarino VR em Unity 2020.4.25f baseado no sistema Crest Ocean para simulação de ondas oceânicas de alta fidelidade e renderização de luz submarina. Visibilidade da câmera configurada para 0-5m simulando condições típicas offshore. Unity Visual Effect Graph (VFX) aplicado para simular poeira flutuante usada por operadores para controle de locomoção. Sistema de sensores virtuais com 24 sensores (12 por lado do ROV) mapeados para 40 vibradores do traje háptico bHaptics TactSuit X40. Simulação de fluxo de partículas baseada em dados ADCP (Acoustic Doppler Current Profiler) com 800 partículas ativas e taxa de atualização de 2Hz. Intensidade do fluxo calculada como soma do momento normal: M_sensor = Σm_i*v̂_i, onde m_i é massa da partícula e v̂_i é vetor normal de velocidade perpendicular à superfície de contato. Função de conversão exponencial para mapear intensidade bruta para faixa 0-1: I = (e^(0.33*M_sensor) - 1)/(e^(0.33*M_sensor) + 1). Comunicação Unity-Python via Python-Unity-Socket para enviar dados aos vibradores do traje háptico. Experimento com sujeitos humanos (n=30) em design within-subject com quatro condições: Controle (apenas vídeo streaming com poeira flutuante), Visual (campo vetorial com setas indicando direção e velocidade do fluxo), Háptico (vibrações no traje indicando direção e magnitude do fluxo), Multi-feedback (visual + háptico). Tarefa de navegação em linha reta de 90m com 5 checkpoints e zonas de correntes submarinas de dificuldade crescente (1-3 zonas por segmento). Velocidade média do ROV: 1m/s, tempo estimado sem atrasos: 1.5min. Velocidade média de fluxo calibrada em 0m/s com magnitude máxima de 0.75m/s. Hardware: HTC VIVE HMD com Tobii Pro eye tracker (50Hz), joystick Xbox para controle do ROV, traje háptico bHaptics TactSuit X40. Coleta de dados: trajetória do ROV, checkpoints alcançados, eye tracking (movimento ocular e tamanho pupilar), dados demográficos. Questionários pós-experimento: NASA-TLX (carga de trabalho) e Trust Scale (nível de confiança). Sessão de treinamento repetida 3 vezes antes do experimento formal. Ordem das condições randomizada para eliminar efeito de aprendizado.",

    "analise_estatistica": "Teste de Wilcoxon para todas as comparações devido à violação do pressuposto de normalidade. Análise de poder estatístico para determinação do tamanho mínimo da amostra: nível de significância α=0.05, poder desejado=0.8, tamanho do efeito=0.8, resultando em n≥25 participantes. Desvio médio da linha reta d_avg = Σ|d_i|/I_total onde d_i é o desvio em cada frame e I_total é o número total de frames. Checkpoints alcançados: diferença significativa entre controle e háptico (p<0.0001), controle e visual (p=0.0002), controle e multi-feedback (p<0.0001); não significativa entre háptico e visual (p=0.19), háptico e multi-feedback (p=0.65), visual e multi-feedback (p=0.10). Desvio médio: diferença significativa entre controle e háptico (p<0.0001), controle e visual (p=0.0007), controle e multi-feedback (p<0.0001); não significativa entre háptico e visual (p=0.70), háptico e multi-feedback (p=0.30), visual e multi-feedback (p=0.21). Carga cognitiva (diâmetro pupilar): menor em todas as condições aumentadas vs controle (háptico p<0.0001, visual p=0.0033, multi-feedback p=0.002). NASA-TLX: menor carga de trabalho em todas as condições aumentadas vs controle (háptico p=0.0003, visual p=0.0004, multi-feedback p=0.0006). Trust Scale: diferença significativa controle vs todas as condições aumentadas (p<0.0001); maior confiança no háptico (p=0.047) e multi-feedback (p=0.0002) vs visual. Análise Mann-Whitney para fatores demográficos vs grupos de preferência: gênero (p=0.55), formação acadêmica (p=0.76), experiência VR/3D gaming (p=0.25), idade (p=0.96) - nenhuma relação significativa encontrada. Análise por grupo de preferência: grupo háptico (n=17, 56.67%) mostrou desempenho significativamente melhor com feedback háptico vs visual (checkpoints p=0.0052, desvio p=0.0079); grupo visual (n=13, 43.33%) mostrou menor desvio com visual vs háptico (p=0.0012).",

    "resultados": "Desvio médio por metro navegado: Controle=7.739m, Háptico=2.714m (redução de 65%), Visual=3.514m (redução de 55%), Multi-feedback=2.282m (redução de 70%). Checkpoints alcançados significativamente maiores com qualquer método de feedback aumentado comparado ao controle (média ~4.5 vs ~2 no controle). Carga cognitiva (diâmetro pupilar) significativamente menor com feedback aumentado, indicando menor esforço mental. NASA-TLX confirmou menor carga de trabalho percebida em todas as condições aumentadas. Trust Scale: maior confiança reportada com feedback háptico e multi-feedback comparado ao visual. Preferências dos participantes: 43.34% preferiu multi-feedback, 33.33% háptico, 23.33% visual, 0% controle. Problemas reportados: 26.67% problemas com intensidade háptica (muito forte ou fraco), 33.33% problemas com visual (confuso ou bloqueando visão), 10% problemas com ambos, 30% sem problemas. Análise por grupo de preferência revelou diferenças significativas: grupo com preferência háptica teve desempenho significativamente melhor com feedback háptico vs visual; grupo com preferência visual teve menor desvio com visual vs háptico, mas não mostrou maior confiança no sistema visual. Grupo de preferência háptica: não houve diferença significativa entre controle e visual (p=0.093 checkpoints, p=0.26 desvio), indicando que feedback visual não é efetivo para este grupo. Grupo de preferência visual: multi-feedback teve maior confiança que visual (p=0.017) e háptico (p=0.030), indicando que combinação é preferível mesmo para quem tem inclinação visual. Nenhuma relação encontrada entre preferência de feedback e fatores demográficos (gênero, idade, formação, experiência VR).",

    "contribuicoes": "1) Primeiro sistema integrado de VR-háptico para teleoperação de ROV submarino que converte dados hidrodinâmicos em feedback sensorial multimodal (visual e háptico) humanamente perceptível. 2) Metodologia para simulação de fluxo de partículas baseada em dados ADCP com sistema de sensores virtuais mapeados para traje háptico, usando soma de momento normal para calcular intensidade de fluxo. 3) Evidência experimental robusta (n=30, design within-subject) de que augmentação sensorial (visual, háptica ou combinada) melhora significativamente desempenho de navegação ROV (redução de 55-70% no desvio), reduz carga cognitiva e aumenta confiança do operador. 4) Descoberta de diferenças individuais significativas nas preferências de feedback (visual vs háptico) que afetam efetividade do método: 56.67% preferem háptico, 43.33% preferem visual. 5) Demonstração de que desempenho e percepção variam significativamente entre grupos de preferência: feedback não-preferido pode não fornecer benefício significativo sobre condição controle. 6) Recomendações de design para sistemas de feedback multi-modal em teleoperação ROV: fornecer ambos feedback visual e háptico com função ON/OFF, usar háptico como feedback fundamental para indicação de condições hidrodinâmicas, visual como indicador de campo distante e háptico como indicador de interações próximas. 7) Framework de conversão de dados hidrodinâmicos para feedback háptico usando função exponencial para mapeamento de intensidade e Python-Unity-Socket para comunicação em tempo real. 8) Demonstração de que causas raiz das preferências individuais não são explicadas por fatores demográficos tradicionais (gênero, idade, formação, experiência VR).",

    "limitacoes": "Experimento testou apenas tarefa simples de navegação em linha reta - não representa tarefas complexas de estabilização, acoplamento ou interação física com ambiente submarino. Sistema não testado com ROV real em produção, apenas em simulação VR de alta fidelidade. Causa raiz das preferências individuais (visual vs háptico) não foi identificada - nenhuma relação com gênero, idade, formação acadêmica ou experiência com VR/3D gaming. Padrões de fluxo pré-projetados com velocidade média calibrada em 0m/s e magnitude máxima de 0.75m/s - não testado com dados oceânicos reais em tempo real. Intensidade háptica reportada como inadequada por 26.67% dos participantes (muito forte ou muito fraca) - necessita calibração personalizada. Feedback visual reportado como confuso ou bloqueando visão por 33.33% dos participantes. Trabalho futuro planejado: desenvolver sistema de teleoperação ROV real com BlueROV2 mini class, testar em operações ROV complexas, melhorar resolução de dados de simulação e desenvolver métodos de controle mais intuitivos. Sistema de partículas com 800 partículas ativas e taxa de atualização de 2Hz pode não capturar dinâmicas de fluxo de alta frequência. Participantes eram majoritariamente de background de engenharia (83.3%) com idade média de 25.2 anos - pode não representar população geral de operadores ROV.",

    "topico": "Visual-haptic Feedback, ROV Teleoperation, Virtual Reality, Sensory Augmentation, Human-Robot Interaction, Subsea Engineering, Hydrodynamic Sensing, Particle Flow Simulation, Vector Field Visualization, Haptic Suit, bHaptics, Unity Game Engine, Eye Tracking, Pupillary Dilation, Cognitive Load, NASA-TLX, Trust Scale, Within-Subject Design, Wilcoxon Test, Individual Differences, Feedback Preference, Navigation Control, Anti-drifting, Low Visibility Environment, Underwater Robotics, Offshore Engineering, Pipeline Inspection, Ocean Exploration, Crest Ocean System, Python-Unity-Socket, Virtual Sensors, ADCP Data, Multi-modal Feedback",
    "area_aplicacao": "Subsea Engineering, Offshore Oil and Gas, Pipeline Inspection, Ocean Exploration, Underwater Construction, Subsea Maintenance, Marine Science, ROV Operations, Underwater Intervention, Remote Teleoperation, Seafloor Mining, Maritime Transport, Aquaculture, Sustainability, Disaster Preparedness, Underwater Cabling",

    "tipo_dados": "Trajetórias de navegação ROV (posição x,y ao longo do tempo), checkpoints alcançados (contagem), desvio da linha reta (m), dados de eye tracking (movimento ocular e tamanho pupilar a 50Hz), questionários NASA-TLX (escala 0-100), questionários Trust Scale, dados demográficos (gênero, idade, formação, experiência VR), preferências de feedback auto-reportadas, problemas/preocupações auto-reportados",
    "dataset": "Experimento controlado com 30 participantes (18 homens, 12 mulheres, idade 19-37 anos, média 25.2±4.06), 4 condições experimentais por participante em ordem randomizada, tarefa de navegação de 90m com 5 checkpoints",
    "frameworks": "Unity 2020.4.25f (ambiente VR), Crest Ocean System (simulação oceânica de alta fidelidade), Unity Visual Effect Graph VFX (simulação de poeira flutuante), Python-Unity-Socket (comunicação Unity-Python), HTC VIVE HMD (display de realidade virtual), Tobii Pro Eye Tracker (rastreamento ocular a 50Hz integrado ao HTC VIVE), bHaptics TactSuit X40 (traje háptico com 40 vibradores), Xbox Controller (controle do ROV), Scripts C# para coleta de dados de trajetória e eye tracking, Self-Assessment Manikin SAM (referenciado mas não usado diretamente), NASA-TLX (avaliação de carga de trabalho), Trust Scale Survey (avaliação de confiança)",
    "link_codigo": "https://drive.google.com/file/d/1PNwltmf9QbNdM5_Be4AOUnAvLP5xc2Bf/view?usp=share_link (vídeo demonstrativo do sistema de feedback)"
  }
]
