[
  {
    "_comentario": "ESTE É UM EXEMPLO - NÃO PREENCHER, APENAS REFERÊNCIA",
    "_arquivo_parte": "PARTE 4 - Contém artigos 39-50. Artigos 1-15 em artigos_part1.json, 16-27 em artigos_part2.json, 28-38 em artigos_part3.json",
    "numero": 0,
    "nome_arquivo": "nome_do_arquivo.pdf",

    "_comentario_artigos_grandes": "Para artigos muito grandes (>10 páginas ou erro 413 na API): 1) Dividir PDF em partes menores (ex: _parte01.pdf, _parte02.pdf); 2) Ler de 3 em 3 partes para não sobrecarregar contexto; 3) Criar arquivo artigoN_resumo.md com resumo detalhado de cada parte; 4) Após processar todas as partes, adicionar entrada resumida aqui no JSON. Exemplo: artigo 9 foi dividido em 8 partes e resumido em artigo9_resumo.md",

    "_comentario_identificacao": "Informações bibliográficas do artigo - NOMES DOS AUTORES DEVEM ESTAR COMPLETOS conforme aparecem no PDF",
    "autores": "Nome Completo; Nome Completo 2 (separados por ponto e vírgula)",
    "ano": 2024,
    "titulo": "Título completo do artigo",
    "subtitulo": "Subtítulo se houver",
    "journal": "Nome do periódico/conferência",
    "publisher": "Editora (Elsevier, IEEE, Springer, etc.)",

    "_comentario_conteudo": "Análise do conteúdo científico",
    "objetivo": "Objetivo principal do artigo - o que os autores buscam resolver/propor",
    "metodologia": "Métodos, algoritmos, arquiteturas e abordagens utilizadas",
    "analise_estatistica": "Métricas, testes estatísticos, tamanho de amostra, distribuições",
    "resultados": "Principais resultados quantitativos e qualitativos",
    "contribuicoes": "Contribuições originais do trabalho",
    "limitacoes": "Limitações identificadas pelos autores ou observadas",

    "_comentario_classificacao": "Classificação e categorização",
    "topico": "Palavras-chave principais (ex: Edge Computing, IoT, Machine Learning)",
    "area_aplicacao": "Domínios de aplicação (ex: Robótica, Veículos Autônomos, Indústria 4.0)",

    "_comentario_recursos": "Recursos práticos e reprodutibilidade",
    "tipo_dados": "Tipo de dados utilizados (ex: Imagens, Séries Temporais, Texto)",
    "dataset": "Nome dos datasets utilizados (se aplicável)",
    "frameworks": "Frameworks, bibliotecas e ferramentas utilizadas",
    "link_codigo": "URL do repositório de código (se disponível)"
  },
  {
    "numero": 39,
    "nome_arquivo": "Real-time embedded ECG anomaly detection system with comparative analysis of CWT-based transfer learning performance across electrode types.pdf",

    "autores": "Wissem Kharzi; Nacera Meziane; Hadjer Zairi; Malika Kedir Talha; Lotfi Madaoui; Oussama Kerdjidj",
    "ano": 2025,
    "titulo": "Real-time embedded ECG anomaly detection system with comparative analysis of CWT-based transfer learning performance across electrode types",
    "subtitulo": "",
    "journal": "Biomedical Signal Processing and Control",
    "publisher": "Elsevier",

    "objetivo": "Introduzir um sistema de assistência diagnóstica de ECG em tempo real baseado em eletrodos secos para melhorar o conforto do paciente e manter a qualidade do sinal. O sistema integra modelos de transfer learning com técnicas de continuous wavelet transform (CWT) para construir um modelo de reconhecimento robusto que extrai informações mais detalhadas que representações tradicionais no domínio do tempo, fornecendo análise comparativa abrangente de wavelets CWT e seu impacto na performance de diferentes arquiteturas de deep learning.",

    "metodologia": "Sistema embarcado all-in-one com quatro estágios: (1) Aquisição e processamento: eletrodos secos Orbital SilverBumps® (OR90) FDA-cleared para uso contínuo até 48h, conectados a módulo AD8232 (amplificação e filtragem analógica com high-pass integrado) e microcontrolador STM32F103C8T6 ARM (72 MHz, 53×22.5mm) com Fs=500Hz, filtro Butterworth 4ª ordem passa-baixa e filtro notch 50Hz, dados gravados via UART em CSV. (2) Conversão ECG: transformação de sinais 1D em escalogramas 2D usando CWT com três wavelets - Complex Morlet (Cmor), Mexican Hat (Mexh) e Shannon (Shan), segmentação em partes de 10 complexos PQRST. (3) Avaliação de modelos: benchmarking de 5 arquiteturas de transfer learning pré-treinadas em ImageNet - InceptionV3 (23.9M params, 299×299), Xception (22.9M params, 299×299), VGG16 (138M params, 224×224), VGG19 (144M params, 224×224), EfficientNetB0 (5.3M params, 224×224). Otimizador Adam com Lr=10⁻³ e Lr=10⁻⁴, 50 epochs, batch size 64. Arquitetura estendida: global average pooling + dense layer 1024 unidades ReLU + softmax. (4) Deployment: NVIDIA Jetson Nano com arquitetura paralela distribuindo funções em 4 cores - Core 0 (monitoramento, plots), Core 1 (aquisição serial 115200 baud), Core 2/3 (conversão CWT e classificação). Multiprocessing e multithreading para execução não-bloqueante. TensorFlow Lite para otimização.",

    "analise_estatistica": "Dois datasets: PTB Diagnostic ECG (PhysioNet) com 549 registros - 35% Normal (classe 0), 65% Abnormal (classe 1 incluindo infarto do miocárdio, cardiomiopatia, bundle branch block, disritmia, hipertrofia miocárdica, doença valvular, miocardite); NSIR Dataset (proprietário, LINS Laboratory USTHB Algeria) com 149 registros de voluntários saudáveis - 28.1% Normal (N), 42.2% ruído de contato de eletrodo (ECN), 29.5% interferência de linha de força 50/60Hz (PLI). Divisão estratificada: 80% treino, 10% validação, 10% teste (seed=37). Métricas: Precision, Accuracy, F1-Score, Recall, Loss (categorical cross-entropy), curvas ROC. Comparação sistemática de 3 wavelets × 5 modelos × 2 learning rates × 2 datasets = 60 configurações. Monitoramento de hardware: latência por função, uso de CPU por core, consumo de RAM, temperatura.",

    "resultados": "Melhor configuração: VGG19 + CMOR wavelet + Lr=10⁻⁴. Dataset NSIR (software): 100% em todas métricas (P, A, F, R), Loss=0.0107. Dataset PTB (software): P=99%, A=99.61%, F=99%, R=99%, Loss=0.0179. Deployment Jetson Nano: NSIR 99.87% accuracy, PTB 99.30% accuracy. CMOR wavelet captura melhor balanço entre componentes de alta e baixa frequência (P, QRS, T waves). MEXH wavelet mais sensível a ajustes de Lr. SHAN wavelet apresentou variabilidade significativa, métricas abaixo do threshold desejado com Lr alto. Estabilização do modelo após ~30 epochs. Lr=10⁻⁴ mostrou comportamento mais estável e robusto que Lr=10⁻³. Monitoramento hardware NSIR: Serial Acquisition 0.715ms (64% RAM), CWT+Classification 1.192ms (67.7% RAM, ~40°C), Plot Update 0.477ms. PTB apresenta maior latência CWT (2.86ms) e RAM (76.3%) devido a sinais patológicos com maior variabilidade morfológica. Comparação com literatura: sistema proposto alcança maior accuracy entre sistemas baseados em hardware (99.87% vs 98.82% FPGA, 97.34% FPGA, 95% FPGA, 81.21% Raspberry Pi).",

    "contribuicoes": "1) Sistema embarcado all-in-one integrando aquisição de sinal, processamento e interpretação inteligente com eletrodos secos OR90 para diagnóstico ECG em tempo real. 2) Benchmarking comparativo abrangente de 3 wavelets CWT (CMOR, MEXH, SHAN) com 5 modelos de transfer learning (InceptionV3, VGG16, VGG19, Xception, EfficientNetB0) em 2 datasets. 3) Identificação de configuração ótima: VGG19 + CMOR wavelet + Lr=10⁻⁴ com 99.87% accuracy no hardware. 4) Arquitetura de sistema paralelo em tempo real com multiprocessing/multithreading distribuindo tarefas em 4 cores do Jetson Nano. 5) Dataset NSIR proprietário para detecção de anomalias de hardware (ruído de eletrodo, interferência de linha de força) disponibilizado publicamente. 6) Demonstração de viabilidade de eletrodos secos com qualidade de sinal comparável a eletrodos gel, reduzindo irritação cutânea de 8.7% para 2.3% em uso de 48h. 7) Performance superior a sistemas embarcados existentes (FPGA, Raspberry Pi) com eficiência energética (5V, até 4A).",

    "limitacoes": "Sistema utiliza apenas ECG single-lead, não fornecendo visão tão abrangente quanto sistemas multi-lead. Detecção de anomalias de hardware e detecção de doenças são tratadas separadamente, podendo ser otimizadas em modelo único. Jetson Nano com apenas 4GB RAM limita monitoramento prolongado e processamento de alta frequência. Dataset NSIR necessita expansão para melhorar generalização dos resultados. Sinais patológicos do PTB introduzem maior latência e uso de RAM devido a variações morfológicas e componentes de alta frequência. Para aplicações mais demandantes, upgrade para Jetson Xavier ou Orin seria necessário.",

    "topico": "ECG Anomaly Detection, Transfer Learning, Continuous Wavelet Transform (CWT), Dry Electrodes, Real-time Systems, Edge Computing, Embedded Systems, Deep Learning, Convolutional Neural Networks (CNN), VGG19, InceptionV3, Xception, EfficientNetB0, Scalogram, Complex Morlet Wavelet, Mexican Hat Wavelet, Shannon Wavelet, Multiprocessing, Multithreading, Signal Processing, Cardiac Monitoring, Arrhythmia Detection, Hardware Anomaly Detection",
    "area_aplicacao": "Cardiac Diagnostics, ECG Monitoring, Telemedicine, Ambulatory Monitoring, Point-of-Care Diagnostics, Wearable Health Devices, Clinical Decision Support, Cardiovascular Disease Detection, Remote Patient Monitoring, Edge AI in Healthcare",

    "tipo_dados": "Sinais ECG (1D temporal e 2D escalogramas CWT), métricas de monitoramento de hardware (latência, uso de CPU/RAM, temperatura)",
    "dataset": "PTB Diagnostic ECG Database (PhysioNet, 549 registros), NSIR Dataset (proprietário, 149 registros de voluntários saudáveis com sinais normais e interferências)",
    "frameworks": "TensorFlow, Keras, TensorFlow Lite, TensorRT 8.0.1.6, CUDA 10.2, cuDNN, PyWavelets, Visual Studio Code, NVIDIA Jetson Nano Developer Kit (128-core Maxwell GPU, ARM Cortex-A57 quad-core, 4GB LPDDR4), STM32F103C8T6 ARM microcontroller (72 MHz), AD8232 ECG module, Orbital SilverBumps® OR90 dry electrodes, Linux Ubuntu 20.04, Python, UART serial communication",
    "link_codigo": "https://github.com/kharzi-wissem/ReadDryEcgData.git (dataset guide)"
  },
  {
    "numero": 40,
    "nome_arquivo": "Remote safety system for a robot tractor using a monocular camera and a YOLO-based method.pdf",

    "autores": "Sixun Chen; Noboru Noguchi",
    "ano": 2023,
    "titulo": "Remote safety system for a robot tractor using a monocular camera and a YOLO-based method",
    "subtitulo": "",
    "journal": "Computers and Electronics in Agriculture",
    "publisher": "Elsevier",

    "objetivo": "Desenvolver um sistema de segurança remoto para suportar o monitoramento de múltiplos tratores-robô agrícolas usando câmera monocular como dispositivo de entrada de imagem e modelo YOLO de deep learning como detector de humanos e tratores. O sistema visa atender às diretrizes de segurança do Ministério da Agricultura, Silvicultura e Pesca do Japão (MAFF) para navegação autônoma de máquinas agrícolas, permitindo que um único operador humano monitore múltiplos robôs trabalhando simultaneamente em campos diferentes localizados a grandes distâncias físicas.",

    "metodologia": "Sistema de segurança remoto com dois componentes principais: (1) Parte do trator: Kubota MR1000A (Crawler) equipado com câmera KODAK PIXPRO 4KVR360 (1280×720 pixels, 32 FPS), montada a 2.6m de altura com ângulo de 30°; NUC Intel Core i5-10210U para relay de dados; GNSS com CLAS (centimeter-level augmentation service) e IMU VN100 para localização; LiDAR 2D Hokuyo UTM-30LX (270° scan, 30m máx, 25ms) conectado diretamente ao controlador como dispositivo de segurança local. (2) Parte remota: workstation ThinkPad P71 com Intel Xeon E3-1535M V6, 64GB RAM, GPU NVIDIA Quadro P4000 (8GB) para processamento de imagens via YOLOv5s. Comunicação TCP via internet (Wi-Fi). Detector YOLOv5s treinado no framework PyTorch com backbone CSPDarknet; dataset de treinamento: 4366 imagens humanas do MS COCO + 1430 imagens de tratores/humanos auto-coletadas expandidas para 5400 via data augmentation (rotação, inversão, escala, mosaic). Treinamento: Nvidia Geforce RTX 3070 (8GB), Windows 10. Método de posicionamento Perspective-n-Point (PNP) para converter coordenadas de pixel para coordenadas do mundo usando 4 pontos de controle no solo medidos via RTK-GPS. Correção estatística de erro de posicionamento humano usando Q-Q plot para verificar distribuição normal e t-test para comparar intervalos adjacentes, resultando em 5 intervalos de correção de pixel no range de 15m. Zonas de segurança: L1=8m (zona de parada visual), L2=4m (zona de desaceleração visual), R=5.5m (zona de parada LiDAR), W=3.2m (largura visual). Safety index de 0-3 determina ação do trator: normal/desacelerar para 3.6 km/h/parar com alarme.",

    "analise_estatistica": "Q-Q plot (quantile-quantile plot) para verificar se distribuições de desvio em cada intervalo de 1m obedecem distribuição normal. Two-sample t-test para cada intervalo adjacente comparando médias populacionais (H0: μ1=μ2, H1: μ1≠μ2), com p-value < 0.05 indicando diferença significativa. 158 ground truths rotulados manualmente para análise de desvio de bounding box. Intervalos significativamente diferentes em 13m, 10m, 8m e 6m (p<0.05), resultando em 5 intervalos mesclados para correção: [15,13), [13,10), [10,8), [8,6), [6,3.5). Métricas de detecção: mAP (mean Average Precision) = (1/c)∑AP_i, AP = ∫Precision(Recall)dR, Precision = TP/(TP+FP), Recall = TP/(TP+FN). RMS error para erro de posicionamento. Experimentos de frenagem medidos 3-5 vezes por condição para calcular médias. Comparação de performance em diferentes ambientes de rede (5G vs LTE) medindo tempo e distância de frenagem.",

    "resultados": "Detector YOLOv5s: mAP=87.3%, AP_person=84.7%, AP_tractor=89.9%, 32 FPS (vs YOLOv3 87.4%/18 FPS, Faster R-CNN 89.7%/8 FPS). Taxa de detecção 0.98 em 500 imagens de teste na ROI. Posicionamento humano: RMS error=0.403m, erro relativo médio=2.6% a 15m, erro máximo=0.77m a 15m, erro relativo máximo ~5%. Frenagem visual: tempo médio=3.5s, distância=7.4m a velocidade máxima 8.8 km/h. Frenagem LiDAR: tempo=2.1s, distância=3.7m. Experimentos de campo 2022-2023: 100% de taxa de sucesso na detecção de obstáculos em 22 experimentos (178 intrusões totais, 178 detecções bem-sucedidas) com até 4 tratores monitorados simultaneamente, distâncias de até 730km (Sapporo-Noto). Performance de rede: 5G (264/126 Mbps down/up) - frenagem 3.5s/7.4m; LTE (317/20 Mbps) - 3.6s/10.2m; LTE (30/10 Mbps) - 3.5s/11m. Upload speed impacta distância de frenagem, download tem impacto mínimo. Detecção multi-alvo: erros de predição de condição de segurança em 3-8s, 12s e 27-30s de vídeo de 30s devido a oclusão efetiva.",

    "contribuicoes": "1) Sistema de segurança remoto para monitoramento de múltiplos tratores-robô via internet, não restrito por distância física (validado até 730km). 2) Método de correção estatística de erro de posicionamento usando Q-Q plot e t-test para criar intervalos de correção de pixel por distância. 3) Fusão de sistemas de segurança visual (câmera+YOLO) e LiDAR 2D, onde LiDAR serve como camada final de segurança independente de rede. 4) Processamento remoto eliminando necessidade de computadores de alto desempenho em cada trator operando em ambientes hostis (alta temperatura, vibração, poeira). 5) Sistema de baixo custo usando câmera monocular e LiDAR 2D (vs câmeras de profundidade e LiDAR 3D). 6) Definição de zonas de segurança baseada em experimentos de frenagem e critérios de colisão com pedestres a 5 km/h do MLIT do Japão. 7) Demonstração de viabilidade em múltiplas plataformas de robôs agrícolas (Kubota MR1000A crawler/wheel, Yanmar EG105/EG83). 8) Análise de impacto de ambiente de rede (5G vs LTE) na performance de segurança remota.",

    "limitacoes": "Precisão limitada no posicionamento de tratores - tamanho maior que humanos causa erros significativos usando pixel único; modelo ocasionalmente detecta apenas trator sem implementos ou separa cálculos do implemento e trator. Necessidade de keypoint detection e reanotação para melhorar posicionamento de tratores. Range de objetos de localização visual limitado a apenas humanos e tratores; outros obstáculos dependem do LiDAR. Suscetibilidade a restrições de ambiente de rede - upload speed insuficiente causa atrasos na transmissão de imagens e recebimento de comandos. Oclusão causa detecções perdidas ou alarmes falsos em cenários multi-alvo. Alvos pequenos além de 15m podem não ser detectados devido à menor capacidade do YOLO para alvos de pequena escala. Dependência de conectividade internet; linkage com dispositivos de segurança locais (LiDAR) é essencial para mitigar riscos de delay de rede.",

    "topico": "Robot Tractor, Remote Control, Monocular Camera, Deep Learning, Obstacle Detection, YOLO, YOLOv5, Object Detection, CNN, Perspective-n-Point (PNP), Camera Calibration, Q-Q Plot, t-test, Statistical Error Correction, LiDAR, Safety Systems, Autonomous Navigation, Agricultural Robotics, Multi-Robot Systems, Real-time Detection, TCP Communication, Data Augmentation, Mosaic Augmentation, Bounding Box Detection, Safety Zones",
    "area_aplicacao": "Agricultural Robotics, Autonomous Farming, Robot Tractor Safety, Remote Monitoring Systems, Precision Agriculture, Multi-Robot Coordination, Agricultural Machinery Automation, Human-Robot Safety, Smart Farming, Field Operations Monitoring",

    "tipo_dados": "Imagens RGB (1280×720 pixels), dados de posição RTK-GPS, distâncias LiDAR 2D (TOF), coordenadas de bounding box, safety index (0-3)",
    "dataset": "MS COCO (4366 imagens humanas selecionadas), Dataset auto-coletado (1430 itens de tratores/humanos expandidos para 5400 via augmentation), Vídeos de tratores-robô do VeBots Laboratory da Hokkaido University",
    "frameworks": "PyTorch (YOLOv5s), Darknet (YOLOv3), Faster R-CNN (ResNet50), OpenCV, RTK-GPS, TCP/IP, NVIDIA Quadro P4000, Intel NUC Core i5-10210U, Hokuyo UTM-30LX LiDAR, KODAK PIXPRO 4KVR360 camera, VN100 IMU, Trimble Alloy GNSS, Arduino (alarm), Windows 10, Mobile WiFi (LTE/5G), Multi-Access Edge Computing (MEC)",
    "link_codigo": "Não disponível (Data will be made available on request)"
  },
  {
    "numero": 41,
    "nome_arquivo": "Research on passive adaptive wall-climbing cleaning and inspection robot of marine cylindrical steel structure based on conical magnetic adsorption wheel_parte01.pdf",

    "autores": "Gaosheng Luo; Chuankun Luo; Shimin Gao; Jingxiang Xu; Xuteng Bao; Zhiqiang Ma; Zhe Jiang",
    "ano": 2024,
    "titulo": "Research on passive adaptive wall-climbing cleaning and inspection robot of marine cylindrical steel structure based on conical magnetic adsorption wheel",
    "subtitulo": "",
    "journal": "Ocean Engineering",
    "publisher": "Elsevier",

    "objetivo": "Propor um robô de limpeza e inspeção escalador de parede com adsorção magnética que pode se mover livremente na parede de estruturas cilíndricas de aço de plataformas offshore e se adaptar passivamente a estruturas cilíndricas com várias curvaturas e diâmetros. O robô visa realizar limpeza de crescimento marinho e detecção de defeitos estruturais em estruturas subaquáticas de instalações offshore como turbinas eólicas offshore, plataformas Jacket e plataformas Jack-up.",

    "metodologia": "Robô escalador de parede com adsorção magnética composto por: (1) Estrutura adaptativa passiva de dois graus de liberdade conectando rodas dianteiras direcionais ao corpo do robô, permitindo rotação em torno dos eixos X (β∈[-180°,180°]) e Z (α∈[-20.5°,20.5°]) para adaptar-se a diferentes curvaturas superficiais. (2) Rodas cônicas de adsorção magnética com ímãs permanentes NdFeB N52 (Br=1.43-1.48T, Hcb≥876kA/m, BH=398-422KJ/m³) embutidos em configuração de magnetização axial oposta para melhorar utilização dos ímãs; anel de aço 1Cr17Ni2 em ambos os lados do ímã central; pneu externo de alumínio recartilhado. (3) Análise de estabilidade estática baseada no princípio de D'Alembert considerando três modos de falha críticos: deslizamento (Case 1), capotamento frontal/traseiro (Case 2), tombamento lateral (Case 3). Cargas consideradas: gravidade (52kg), empuxo (190.9N), força de corrente oceânica (336.3N a 1.25m/s), reação do jato de água (115.9N a 50MPa, 22L/min). (4) Simulação de campo magnético comparando magnetização axial vs radial usando equações de Maxwell e tensor de stress de Maxwell. (5) Modelagem matemática da relação entre gap de ar (Sk), ângulo do cone (α), diâmetro da estrutura cilíndrica (D) e força de adsorção magnética. (6) Otimização paramétrica do ângulo do cone variando de 7° a 11° para maximizar força de adsorção e razão τ=Fmm2/Fmm1. (7) Sistema de limpeza com jato de água ultra-alta pressão (50MPa, 22L/min) e jato de cavitação (20MPa, 67L/min). (8) Sistema de monitoramento com câmera e lâmpada de compensação em pan-tilt de dois graus de liberdade.",

    "analise_estatistica": "Análise estática para determinar força mínima de adsorção magnética considerando ângulo de inclinação θ∈[0°,90°]. Força mínima crítica Fmmin1 (não deslizamento) varia com θ, atingindo máximo de 788.2N em θ=33.4°; 681.1N em θ=0°; 492.9N em θ=90°. Força mínima Fmmin2 (não capotamento frontal) atinge máximo de 241.6N em θ=45.3°. Força mínima Fmmin3 (não tombamento lateral) atinge máximo de 239.6N em θ=46.7°. Coeficiente de atrito μ=0.18 (seco: 0.75, úmido: 0.2 medidos experimentalmente). Comparação simulação vs experimento: razão medido/teórico n=0.71-0.88, média 0.80. Parâmetro δ (razão força em γ=0° e γ=90°) analisado para diâmetros de 280mm a 2000mm, mínimo em D=1000mm. Parâmetro τ (razão Fmm2/Fmm1) aumenta com ângulo do cone de 1.4 (β=7°) a 2.0 (β=11°). Tração de pico: 131kg (seco), 34.8kg (úmido) com força de adsorção de 174kg por roda.",

    "resultados": "Especificações do robô: 782×495×326mm (L×W×H), peso seco 52kg, capacidade de carga ≤109kg, velocidade máxima 0.5m/s, comunicação RS485/CAN. Magnetização axial: força máxima 726.2N, campo magnético máximo 7.525T. Magnetização radial: força máxima 378.7N, campo magnético máximo 10.146T - diferença devido ao circuito magnético mais longo e maior fuga de fluxo na radial. Força mínima de adsorção magnética por roda: 867N (fator de segurança 1.1). Ângulo ótimo do cone: 9° balanceando mobilidade e facilidade de desmontagem. Em superfície plana (espessura 5mm): força de adsorção 1223.6N, intensidade de campo 3.3T. Parâmetros estruturais da roda cônica: L1=30mm, L2=50mm, L3=20mm, D1=80mm, D2=127.88mm, D3=135.66mm, D4=143.76mm. Experimentos de mobilidade bem-sucedidos em estruturas cilíndricas de diâmetros: 600mm, 750mm, 900mm, 1000mm, 1800mm (subaquático em estrutura T-type). Testes de limpeza atmosférica e subaquática com jato de alta pressão (50MPa) e jato de cavitação (20MPa) sem deslizamento. Eficiência de limpeza em plataforma offshore real: 197 m²/h. Coeficiente de correção experimental: 0.80 (média).",

    "contribuicoes": "1) Robô escalador de parede com adsorção magnética cônica baseado em estrutura adaptativa passiva de dois graus de liberdade, permitindo adaptação automática a estruturas cilíndricas de curvaturas variáveis. 2) Modelo de falha estática completo considerando deslizamento, capotamento e tombamento sob cargas de gravidade, empuxo, corrente oceânica e reação de jato de água. 3) Análise comparativa de magnetização axial vs radial demonstrando superioridade da axial (726.2N vs 378.7N) devido a menor fuga de fluxo. 4) Modelagem matemática da relação entre gap de ar, ângulo do cone e força de adsorção magnética. 5) Otimização do ângulo do cone (9°) balanceando força de adsorção, mobilidade e facilidade de desmontagem. 6) Design de roda cônica magnética mais compacta e leve que rodas cilíndricas convencionais, com melhor atenuação de força magnética a 90°. 7) Validação experimental em estruturas cilíndricas de 280mm a 1800mm de diâmetro, incluindo testes subaquáticos. 8) Demonstração de limpeza em plataforma offshore real com eficiência de 197 m²/h.",

    "limitacoes": "Coeficiente de correção simulação/experimento (0.71-0.88) indica erros de fabricação, especialmente na espessura da manga de poliuretano que aumenta o gap de ar. Trabalho futuro inclui: ímãs permanentes em forma de leque baseados em array Halbach para reduzir peso e fuga de fluxo; posicionamento usando sonar, IMU e dados visuais; construção de mapa local e algoritmo de planejamento de caminho automático; sonar de evitação de obstáculos; experimentos de erosão em jatos de água; experimentos de limpeza em amostras biológicas marinhas; dispositivo experimental de jato visual subaquático para observar e registrar processo de limpeza; otimização de parâmetros estruturais do bocal para melhorar eficiência de limpeza.",

    "topico": "Wall-Climbing Robot, Magnetic Adsorption, Conical Magnetic Wheel, Passive Adaptive Structure, Offshore Platform Inspection, Marine Structure Cleaning, Permanent Magnet (NdFeB), Magnetic Circuit Design, Axial Magnetization, Static Stability Analysis, Maxwell Stress Tensor, Air Gap Optimization, Cylindrical Structure, High-Pressure Water Jet, Cavitation Jet, Underwater Robotics, Four-Wheel Independent Drive, Two-Degree-of-Freedom Mechanism, Magnetic Field Simulation, Surface Adaptability",
    "area_aplicacao": "Offshore Platform Maintenance, Marine Structure Inspection, Underwater Cleaning, Wind Turbine Foundation Inspection, Jacket Platform Cleaning, Jack-up Platform Maintenance, Ship Hull Inspection, Steel Structure NDT (Non-Destructive Testing), Subsea Infrastructure Maintenance, Biofouling Removal, Corrosion Detection",

    "tipo_dados": "Força de adsorção magnética (N), intensidade de campo magnético (T), ângulos de rotação (graus), diâmetros de estruturas cilíndricas (mm), coeficientes de atrito, parâmetros geométricos de rodas cônicas",
    "dataset": "Não aplicável - experimentos com protótipo físico em estruturas cilíndricas de aço Q235 com espessura de 5mm",
    "frameworks": "ANSYS Maxwell (simulação de campo magnético), equações de Maxwell para cálculo teórico de força de adsorção, princípio de D'Alembert para análise estática, fórmula de Newton-Leibniz para cálculo de gap de ar, jato de água ultra-alta pressão (50MPa, 22L/min), jato de cavitação (20MPa, 67L/min)",
    "link_codigo": "Não disponível (dados suplementares em https://doi.org/10.1016/j.oceaneng.2024.119676)"
  },
  {
    "numero": 42,
    "nome_arquivo": "Response-time analysis of mesh-based many-core systems.pdf",

    "autores": "David García Villaescusa; Mario Aldea Rivas; Michael González Harbour",
    "ano": 2023,
    "titulo": "Response-time analysis of mesh-based many-core systems",
    "subtitulo": "",
    "journal": "Journal of Systems Architecture",
    "publisher": "Elsevier",

    "objetivo": "Apresentar um modelo de escalonabilidade para sistemas many-core baseados em rede 2D mesh Network-on-Chip (NoC) e store-and-forward switching, com limitação na taxa máxima de utilização de links que torna a análise tratável. O modelo visa analisar aplicações compostas por fluxos end-to-end (e2e) periódicos ou esporádicos, cada fluxo composto por uma sequência linear de passos de computação (threads) estaticamente mapeados em cores e ativados pelo passo predecessor.",

    "metodologia": "Modelo de escalonabilidade baseado no MAST (Modeling and Analysis Suite for Real-Time Applications) com análise offset-based response time. Elementos do modelo: (1) Recursos de processamento PRxy representando cada core com coordenadas na mesh. (2) Fluxos e2e Γi compostos por steps τij com WCET Cij, BCET Cbij, prioridade prioij e PR atribuído. (3) Mensagens mijk com taxa de geração ρijk (cycles⁻¹), número de pacotes μijk, tipo tijk (read/write/write-back) e destino dijk. (4) Parâmetros da NoC: frequência FNoC, latência por hop LH, latência de arbitração LR. Restrição de taxa máxima: Pxy→x'y' ≤ 1/LR para todo link, evitando back-pressure e simplificando análise de interferência. Cálculo de tempo de travessia: TTbijk = LH·Hijk (best-case), TTijk = TTbijk + Iijk (worst-case com interferência de arbitração round-robin). Plataforma de validação: processador Epiphany III many-core (16 cores em mesh 4×4 2D, 600MHz, 32KB memória local por core) na placa Parallella. NoCs independentes: cMesh (escrita, LRw=1 ciclo), rMesh (leitura, LRr=8 ciclos), xMesh (off-chip). Roteamento XY determinístico. RTOS M2OS-mc desenvolvido com scheduling não-preemptivo de prioridade fixa. Mecanismos de sincronização implementados: Sampling Ports (SP) para leitura/escrita de único elemento com sobrescrita, Queuing Ports (QP) baseados em fila FIFO circular com bloqueio. Primitiva mutex do Epiphany para exclusão mútua.",

    "analise_estatistica": "Comparação de tempos de resposta entre modelo MAST e execução real no processador Epiphany. Exemplo simples (2 fluxos e2e, 3 tarefas cada): WCRT calculado vs medido para Γ1 (τ11: 5000ns vs 5208ns, τ12: 19010ns vs 19010ns, τ13: 26019ns vs 26019ns). Exemplo com Sampling Port: τ11 WCRT 5430ns vs medido 5208ns (avg 5048ns), τ12 WCRT 8985ns vs medido 8703ns (avg 8225ns). Exemplo com Queuing Port (3 fluxos e2e): Γ1 τ11 WCRT 57779ns vs max 35305ns, τ12 WCRT 85039ns vs max 71015ns, τ13 WCRT 100774ns vs max 84990ns; Γ2 τ21 WCRT 57790ns vs max 20172ns, τ22 WCRT 85235ns vs max 55698ns, τ23 WCRT 96184ns vs max 64113ns; Γ3 τ31 WCRT 21690ns vs max 20007ns, τ32 WCRT 72598ns vs max 67868ns. Comparação com modelo Tobuschat [12]: WCRT modelo proposto 8 ciclos vs Tobuschat ~70 ciclos vs iSLIP ~12.5 ciclos - demonstrando menor pessimismo. Análise de impacto da restrição de taxa máxima: exemplo com 24 fluxos (96 tarefas) acomodados em mesh 4×4 sem violar restrição, demonstrando que limitação não é restritiva para sistemas de alta carga computacional e comunicacional.",

    "resultados": "Modelo MAST aplicado ao Epiphany III (16 cores, mesh 4×4, 600MHz). Parâmetros NoC: FNoC=600MHz, LH=1.5 ciclos, LRw=1 ciclo (cMesh), LRr=8 ciclos (rMesh). Taxa máxima de geração de pacotes: memcopy 1/3 cycle⁻¹, atribuições consecutivas 1/2 cycle⁻¹. Validação experimental confirma que tempos medidos são limitados pelos WCRTs calculados pelo modelo. Análise demonstra capacidade de suportar até 48 mensagens por ciclo NoC sem violar restrição de taxa máxima. Mecanismos de comunicação modelados: Sampling Port (write: lock mutex + write data + set new + unlock; read: lock mutex + read data + read new flag + unlock), Queuing Port (write/read com verificação de fila cheia/vazia e bloqueio). Tempos de bloqueio incluídos na análise: Bw (write operation) e Br (read operation). Cálculo de WCET efetivo: C'ij = Cij + Σ(Iijk + Iij(k+1)) + Bwi(j-1) + Bri(j+1). Sistema é escalonável se Ri ≤ Di para todo fluxo e2e. Código M2OS-mc disponível publicamente.",

    "contribuicoes": "1) Técnica de modelagem e análise que permite estudar comportamento de rede e tarefas através de limitação na taxa máxima de utilização de links, evitando back-pressure e simplificando análise de interferência inter-mensagens (problema NP-hard). 2) Modelagem de mecanismos de comunicação de alto nível (Sampling Ports e Queuing Ports) fornecidos pelo sistema operacional, incluindo análise temporal de operações read/write com exclusão mútua via mutex. 3) Aplicação e validação em plataforma real (Epiphany III many-core, 16 cores em mesh 4×4 2D) usando RTOS M2OS-mc desenvolvido pelos autores. 4) Demonstração de menor pessimismo comparado a trabalhos relacionados (8 ciclos vs ~70 ciclos de Tobuschat et al.). 5) Algoritmo completo para conversão de sistema many-core em modelo MAST (Listings 5-7). 6) Análise de que a restrição de taxa máxima não é limitante significativa mesmo em sistemas de alta carga (exemplo com 96 tarefas em mesh 4×4).",

    "limitacoes": "Modelo assume que tasks enviam mensagens apenas ao final de sua execução (simplificação para modelagem). Apenas fluxos e2e lineares são considerados (multi-path flows com múltiplos sucessores/predecessores não abordados). Memória compartilhada externa (DDR3L SDRAM no lado leste da mesh) não é modelada. Acesso I/O síncrono do processador Epiphany não implementado. Algoritmo de alocação de tarefas para otimizar performance de tempo de resposta deixado como trabalho futuro. Validação realizada apenas em mesh 4×4 (16 cores) - escalabilidade para meshes maiores (ex: Epiphany V com 1024 cores) não demonstrada experimentalmente. Back-pressure evitada por restrição de taxa, mas sistemas que não atendem restrição não são analisáveis pelo modelo.",

    "topico": "Real-Time Systems, Schedulability Analysis, Network-on-Chip (NoC), Many-Core Processors, 2D Mesh Network, Store-and-Forward Switching, Response Time Analysis, WCRT (Worst-Case Response Time), MAST (Modeling and Analysis Suite), Offset-Based Analysis, End-to-End Flows, Task Scheduling, Fixed Priority Non-Preemptive Scheduling, Inter-Process Communication, Sampling Ports, Queuing Ports, Mutex Synchronization, Back-Pressure Avoidance, Packet Routing, XY Routing, Round-Robin Arbitration, Link Utilization, Message Passing, RTOS (Real-Time Operating System)",
    "area_aplicacao": "Embedded Real-Time Systems, Many-Core Computing, Parallel Processing, Safety-Critical Systems, Cyber-Physical Systems, High-Performance Embedded Computing, Multiprocessor Systems-on-Chip (MPSoC), Industrial Automation, Automotive Electronics, Aerospace Systems, Telecommunications",

    "tipo_dados": "Tempos de execução (WCET/BCET) em nanosegundos/ciclos, tempos de resposta (WCRT/BCRT), taxas de geração de pacotes (cycles⁻¹), latências de travessia de NoC, parâmetros de fluxos e2e (período, deadline), mapeamento de tarefas em cores",
    "dataset": "Não aplicável - experimentos com cargas de trabalho sintéticas executadas em hardware real (Parallella board com Epiphany III)",
    "frameworks": "MAST (Modeling and Analysis Suite for Real-Time Applications), M2OS-mc (RTOS para many-core desenvolvido pelos autores), Epiphany Hardware Utility Library (eLib), GCC (compilador), OpenMP, MPI, Parallella SDK",
    "link_codigo": "https://m2os.unican.es/ (M2OS-mc RTOS com GPLv3+), https://marte.unican.es/ (MaRTE OS)"
  },
  {
    "numero": 43,
    "nome_arquivo": "Robust ELM-PID tracing control on autonomous mobile robot via transformer-based pavement crack segmentation_parte01.pdf",

    "autores": "Jianqi Zhang; Xu Yang; Wei Wang; Ioannis Brilakis; Diana Davletshina; Hainian Wang",
    "ano": 2025,
    "titulo": "Robust ELM-PID tracing control on autonomous mobile robot via transformer-based pavement crack segmentation",
    "subtitulo": "",
    "journal": "Measurement",
    "publisher": "Elsevier",

    "objetivo": "Propor um framework de rastreamento de trincas em pavimentos para selagem automática, integrando uma rede de segmentação baseada em Transformer (ViT-S2T) com controlador ELM-PID (Extreme Learning Machine-PID) para ajuste adaptativo de parâmetros de controle. O framework visa resolver dois desafios críticos: a perda de features de trincas delgadas durante convolução (causando trajetórias fragmentadas) e os grandes erros de rastreamento causados pela calibração manual de parâmetros PID.",

    "metodologia": "Framework com dois ramos principais: (1) Rede ViT-S2T para segmentação de trincas: módulo TFEM (Transformer-based Feature Extraction Module) substitui backbone CSPDarknet53 do YOLOv5 com multi-head self-attention para capturar features globais e locais; módulo ISM (Incoherent Segmentation Masks) com design cascaded usando 4 kernels convolucionais 3×3 para upsampling e fusão de máscaras de baixa resolução com features de alta resolução. Loss function: Lcls + Lobj + Lbbox (CIoU) + Lmask (BCE). (2) Controlador ELM-PID: rede ELM com 6 nós de entrada [u(k), y(k)], 18 nós ocultos, 3 nós de saída [x(k), y(k), ω(k)]; parâmetros iniciais Kp=10, Ki=1, Kd=0.01; ajuste online via backpropagation com taxa de aprendizado η e coeficiente de momentum α∈(0,1); algoritmo PID incremental com função custo E(k)=½e²(k). Hardware: treinamento em Intel Core i9-13900KF (5.80GHz, 6 cores, 32GB RAM) + NVIDIA RTX 4090 (24GB); robô móvel autônomo com Nvidia Jetson AGX Xavier (512 CUDA cores, 64 tensor cores, ARM CPU v8.2, 32GB DDR4), câmera Intel RealSense D435i RGB-D, ROS Melodic, PyTorch 1.8, Ubuntu 18.04, Jetpack 4.4. Treinamento: SGD optimizer, 300 epochs, momentum 0.8, weight decay 0.0001, learning rate inicial 0.01. Frequência de amostragem do controlador: 50ms. Máximo de 80 iterações para algoritmos de controle.",

    "analise_estatistica": "Métricas de segmentação: Precision, Recall, mAP@0.5, mAP@0.5:0.95. Métricas de controle: MAX (erro máximo), RMSE (root mean square error), MAE (mean absolute error), função objetivo J, rise time, settling time, número de iterações. Comparação de 5 modelos de segmentação (YOLOv5, YOLACT-700, SOLO, S2TNet, ViT-S2T) em 4 pretrained models (n, s, m, x). Comparação de 6 controladores (PID, ZN-PID, BPSO-PID, Fuzzy PID, CEAFC, ELM-PID) com 3 tipos de referência (step, slope, first-order linear) e 3 cenários de trincas (slender #1, curved #2, discontinuous #3). Ablation study comparando TFEM, ISM e TFEM+ISM. Análise de performance em tempo real: FPS, velocidade linear/angular (RMSE, MAE), latência.",

    "resultados": "Segmentação (S2TCrack dataset): ViT-S2T alcança Precision=82.76%, Recall=72.34%, mAP@0.5=75.63%, mAP@0.5:0.95=26.53%. Melhorias vs YOLOv5: +17.37% Precision, +13.7% Recall, +8.39% mAP@0.5. Ablation: TFEM+ISM superior em +3.23% (DeepCrack), +5.82% (CFD), +10.28% (S2TCrack) vs baseline. Controle step reference: ELM-PID J=30.53 (melhor), 4 iterações, rise time=0.5s, settling time=2.8s. Slope reference: ELM-PID J=66.51, 22 iterações, rise time=8s, settling time=8.1s. First-order linear: ELM-PID J=75, 41 iterações. Crack #1 (slender, ViT-S2T): ELM-PID MAX=17.6mm, RMSE=3.94mm, MAE=4.48mm (vs PID RMSE=10.81mm). Crack #2 (curved): ELM-PID MAX=20.31mm, RMSE=4.19mm, MAE=5.23mm (vs PID MAX=75.73mm). Crack #3 (discontinuous): ELM-PID MAX=24.95mm, RMSE=5.42mm, MAE=5.49mm. Performance em tempo real: ViT-S2T 67.72 FPS (+39.73 vs YOLOv5, +26.83 vs S2TNet). Velocidade de rastreamento: linear RMSE=0.0489m/s, MAE=0.0513m/s; angular RMSE=0.4164rad/s, MAE=0.1717rad/s.",

    "contribuicoes": "1) Framework robusto de rastreamento de trincas para selagem automática integrando segmentação baseada em Transformer com controle neural-PID. 2) Rede ViT-S2T com TFEM (multi-head self-attention para features globais/locais) e ISM (upsampling cascaded para segmentação fina de trincas delgadas). 3) Controlador ELM-PID combinando Extreme Learning Machines com PID para ajuste adaptativo online de parâmetros Kp, Ki, Kd através de capacidades de auto-aprendizado da rede. 4) Validação abrangente em 3 datasets desafiadores (DeepCrack, CFD, S2TCrack) demonstrando state-of-the-art em precisão e robustez. 5) Implementação em robô móvel autônomo proprietário com computação de borda (Jetson AGX Xavier) para rastreamento visual em tempo real. 6) Demonstração de menor erro de rastreamento e convergência mais rápida que controladores PID, ZN-PID, BPSO-PID, Fuzzy PID e CEAFC.",

    "limitacoes": "Foco em features de trincas individuais - não aborda cenários mais complexos como trincas múltiplas ou intersectantes. Ambiente de fundo das trincas selecionado é relativamente ideal. Performance de rastreamento em tempo real ainda limitada com alguns delays presentes. Trabalhos futuros: trincas com topologia complexa; experimentos sob várias condições de perturbação em ambientes de pavimento; investigação mais profunda da integração de modelos de deep learning embarcados com métodos de controle otimizado; incorporação de dispositivos de reparo no robô para selagem automática de trincas.",

    "topico": "Pavement Crack Tracing, ELM-PID Control, Extreme Learning Machines, Transformer-based Crack Segmentation, Vision Transformer (ViT), Embedded Deep Learning, Autonomous Mobile Robot, YOLOv5, Instance Segmentation, Multi-Head Self-Attention, PID Parameter Tuning, Neural Network Control, Backpropagation, Adaptive Control, Road Maintenance Automation, Computer Vision, Semantic Segmentation, Edge Computing, Real-time Visual Servoing, Trajectory Tracking",
    "area_aplicacao": "Pavement Maintenance, Automated Crack Sealing, Road Infrastructure Inspection, Highway Maintenance Robotics, Civil Engineering Automation, Construction Robotics, Visual Servoing, Autonomous Navigation, Edge AI for Infrastructure, Smart Road Maintenance, Asphalt Pavement Repair",

    "tipo_dados": "Imagens de trincas em pavimento asfáltico (RGB), máscaras de segmentação, trajetórias de trincas, sinais de erro de rastreamento, velocidades linear/angular do robô",
    "dataset": "DeepCrack (537 imagens de superfície de concreto, 544×384 pixels, 350 treino/50 val/137 teste), CFD (118 imagens de trincas em estrada, 480×320 pixels, capturadas com iPhone), S2TCrack (1502 imagens para segmentação e rastreamento, 1051 treino/149 val/302 teste, capturadas por robô com Intel RealSense D435i em 6 condições: normal, sombra, escuro, galhos de plantas, molhado, motion blur)",
    "frameworks": "PyTorch 1.8, YOLOv5 (Ultralytics), mmdetection (OpenMMLab), ROS Melodic, Linux Ubuntu 18.04, Jetpack 4.4, TensorRT, CUDA, NVIDIA Jetson AGX Xavier (512 CUDA cores, 64 tensor cores, ARM CPU v8.2 8 cores, 32GB DDR4), Intel RealSense D435i RGB-D camera, NVIDIA GeForce RTX 4090 (24GB), Intel Core i9-13900KF (5.80GHz), SGD optimizer, Binary Cross-Entropy loss, CIoU loss",
    "link_codigo": "https://github.com/ultralytics/yolov5 (YOLOv5 base), https://github.com/open-mmlab/mmdetection (YOLACT, SOLO)"
  },
  {
    "numero": 44,
    "nome_arquivo": "Safeguarding connected autonomous vehicle communication_parte01.pdf",

    "autores": "Mohammed Aledhari; Rehma Razzak; Mohamed Rahouti; Abbas Yazdinejad; Reza M. Parizi; Basheer Qolomany; Mohsen Guizani; Junaid Qadir; Ala Al-Fuqaha",
    "ano": 2025,
    "titulo": "Safeguarding connected autonomous vehicle communication: Protocols, intra- and inter-vehicular attacks and defenses",
    "subtitulo": "",
    "journal": "Computers & Security",
    "publisher": "Elsevier",

    "objetivo": "Apresentar análise abrangente de frameworks e protocolos de segurança para comunicações intra e inter-veiculares em Connected Autonomous Vehicles (CAVs), desenvolvendo um novo sistema de classificação para ameaças de segurança em CAVs e propondo protocolos de segurança práticos. O paper visa categorizar vários security frameworks para auxiliar no desenvolvimento de sistemas de transporte seguros e inteligentes, abordando desafios e oportunidades de soluções state-of-the-art no contexto de tecnologias de direção autônoma.",

    "metodologia": "Survey extensivo e análise sistemática da literatura sobre segurança de CAVs. Estrutura metodológica: (1) Revisão de background sobre segurança de comunicação incluindo comunicação intra-veicular (CAN bus, LIN, FlexRay, MOST, Automotive Ethernet) e inter-veicular (V2V, V2I, V2X, DSRC, C-V2X, 5G NR). (2) Análise de arquiteturas de segurança e desafios em 5 áreas: Data Privacy Protection, Safety and Liability, Accountability, Malware Detection, OTA Updates. (3) Desenvolvimento de taxonomia de ataques categorizados por 6 fatores de severidade (Asset Importance, Attack Difficulty, Detection Rate, Information Leakage Severity, Physical Damage Severity, Recovery Rate) com classificação Low/Medium/High. (4) Mapeamento de 19+ tipos de ataques (Zero-day, Replay, Relay, DoS, Sybil, Blackhole, Eavesdropping, Spoofing, Jamming, MITM, Side-Channel, Adversarial ML, etc.) contra alvos específicos (GPS, LiDAR, Radar, Camera, CAN, ECU, OBD). (5) Análise de soluções de segurança e ferramentas de avaliação. (6) Revisão de protocolos de segurança e best practices. (7) Identificação de open issues em 9 áreas: Data Privacy, Threat Metrics, E/E Architecture, Authentication, Jamming/Spoofing, Data Sharing, Trusted Communications, Security Evaluation Tools. (8) Proposição de roadmap futuro com 9 direções de pesquisa.",

    "analise_estatistica": "Análise qualitativa baseada em categorização sistemática. Tabela 3 apresenta matriz de severidade de ameaças com 6 fatores × 3 níveis (L/M/H). Tabela 4 apresenta taxonomia de 19+ tipos de ataques mapeados para alvos e impactos específicos. Comparação de protocolos de comunicação: DSRC (75 Mbps, 5.9 GHz, 1000m range) vs C-V2X (modo 3: 100+ Mbps, modo 4: 12 Mbps, sub-6 GHz). Análise de mais de 126 incidentes cibernéticos reportados contra veículos autônomos, com 80% sendo ataques remotos. Review de aproximadamente 200 referências cobrindo período de 2002-2024.",

    "resultados": "Principais findings: (1) Vulnerabilidades críticas identificadas em todos os níveis de comunicação veicular - CAN bus sem autenticação nativa, GPS suscetível a spoofing, LiDAR vulnerável a ataques de relay e blinding. (2) Ataques mais severos: Adversarial ML em sensores, DoS em comunicação V2X, Sybil attacks em redes cooperativas. (3) Soluções mais promissoras: Blockchain para integridade de dados e trust management, ML-based anomaly detection para IDS, Federated Learning para privacy-preserving collaboration. (4) Gaps identificados: falta de ferramentas de avaliação de segurança, ausência de frameworks de liability claros, necessidade de post-quantum cryptography. (5) Protocolos emergentes: 5G NR V2X oferece latência <1ms e confiabilidade 99.999%, superior a DSRC para aplicações safety-critical. (6) Best practices propostas: defense-in-depth, secure boot, hardware security modules (HSM), continuous monitoring. (7) Roadmap futuro inclui: Enhanced Security Protocols, Blockchain Integration, Post-Quantum Cryptography, Ethics and Legislation, 5G and Beyond, HMI Security, Cross-Disciplinary Collaboration, Simulation/Testing, Environmental Adaptation.",

    "contribuicoes": "1) Categorização abrangente de security frameworks para CAVs auxiliando desenvolvimento de sistemas de transporte seguros. 2) Taxonomia detalhada de ataques de segurança (Table 4) mapeando 19+ tipos de ataques a alvos e impactos específicos. 3) Framework de análise de severidade de ameaças (Table 3) com 6 fatores e 3 níveis de classificação. 4) Análise sistemática de desafios de segurança em comunicações intra e inter-veiculares. 5) Identificação de 9 open issues críticos para pesquisa futura. 6) Roadmap detalhado com 9 direções de pesquisa futura incluindo quantum computing, blockchain, AI/ML, e regulamentação. 7) Review extensiva de ~200 referências cobrindo estado da arte em segurança de CAVs. 8) Best practices para design de medidas de segurança robustas.",

    "limitacoes": "Artigo é predominantemente survey/review, não apresentando implementação ou validação experimental de soluções propostas. Taxonomia de ataques é baseada em literatura existente e pode não cobrir ameaças emergentes. Análise de severidade é qualitativa (L/M/H) sem métricas quantitativas precisas. Roadmap futuro apresenta direções gerais sem detalhamento de implementação. Foco em aspectos técnicos de segurança com menor atenção a aspectos regulatórios e de liability. Não aborda completamente integração de soluções de segurança com requisitos de real-time performance. Dataset específico não utilizado - análise baseada em literatura secundária.",

    "topico": "Connected Autonomous Vehicles (CAV), Vehicle Communication Security, V2V Communication, V2I Communication, V2X Communication, Intra-Vehicle Networks, Inter-Vehicle Networks, CAN Bus Security, Automotive Cybersecurity, DSRC, C-V2X, 5G NR, Intrusion Detection Systems (IDS), Blockchain for Vehicles, Machine Learning Security, Adversarial Machine Learning, GPS Spoofing, LiDAR Attacks, DoS Attacks, Sybil Attacks, MITM Attacks, Replay Attacks, OTA Updates Security, Privacy Protection, Data Integrity, Authentication Protocols, Encryption, WAVE Protocol, IEEE 802.11p, Threat Taxonomy, Risk Assessment, Security Frameworks",
    "area_aplicacao": "Connected Autonomous Vehicles, Intelligent Transportation Systems (ITS), Smart Mobility, Vehicular Ad-hoc Networks (VANET), Automotive Industry, Self-Driving Cars, Vehicle-to-Everything (V2X), Cooperative Driving, Traffic Management, Smart Cities, Fleet Management, Autonomous Trucking, Ride-Sharing Services, Public Transportation",

    "tipo_dados": "Não aplicável - Survey/Review article. Análise baseada em literatura secundária, taxonomias de ataques, categorizações de severidade, e frameworks conceituais",
    "dataset": "Não aplicável - Revisão sistemática de literatura sem dataset experimental próprio",
    "frameworks": "Análise de protocolos: DSRC/WAVE (IEEE 802.11p, IEEE 1609.x), C-V2X (3GPP Release 14-16), 5G NR V2X, LTE-V. Redes intra-veiculares: CAN, LIN, FlexRay, MOST, Automotive Ethernet. Standards de segurança: ISO/SAE 21434 (TARA), ISO 20078. Tecnologias de segurança analisadas: Blockchain, Federated Learning, Machine Learning IDS, PKI, HSM, Secure Boot, TLS/DTLS",
    "link_codigo": "Não disponível - Artigo de survey/review"
  },
  {
    "numero": 45,
    "nome_arquivo": "Sensor and actuator integrated tooling systems.pdf",

    "autores": "F. Bleicher; D. Biermann; W.-G. Drossel; H.-C. Möhring; Y. Altintas",
    "ano": 2023,
    "titulo": "Sensor and actuator integrated tooling systems",
    "subtitulo": "",
    "journal": "CIRP Annals - Manufacturing Technology",
    "publisher": "Elsevier",

    "objetivo": "Revisar sensores e atuadores utilizados em sistemas de ferramentas de usinagem, explicando princípios de medição de força, deslocamento e temperatura, discutindo atuadores baseados em piezo, fluidos magnetorreológicos, ligas com memória de forma e magnetostritivos, descrevendo técnicas de transmissão de energia e sinais sem fio e com fio, e apresentando a integração desses componentes em sistemas de ferramentas para operações de mandrilamento, fresamento, torneamento e retificação.",

    "metodologia": "Keynote paper (artigo de revisão) estruturado em 9 seções: (1) Introdução ao contexto de sistemas ciber-físicos de produção. (2) Design e arquitetura de sistemas incluindo Digital Twin, edge computing e protocolos industriais (OPC UA, MTConnect, MQTT). (3) Princípios de sensores: strain gauges metálicos e semicondutores, piezoelétricos, capacitivos, indutivos, FBG (Fiber Bragg Grating), SAW (Surface Acoustic Wave), termopares, acelerômetros MEMS. (4) Princípios de atuadores: piezoelétricos (diretos, amplificados, stepper), magnetorreológicos (MRF), ligas com memória de forma (SMA/FSMA), magnetostritivos, eletromagnéticos. (5) Transferência de energia: indutiva, baterias, energy harvesting. (6) Transmissão de dados: Fieldbus, wireless (ZigBee, Bluetooth, Wi-Fi, 5G). (7) Processamento de sinais: ADC (8-24 bit), FFT, wavelets, filtros Kalman, machine learning (CNN, ANN, Random Forest). (8) Aplicações em torneamento, furação, fresamento e retificação. (9) Tecnologias futuras e conclusões.",

    "analise_estatistica": "Análise comparativa de princípios de sensores: strain gauge metálico (sensibilidade 10⁻⁶ V/µε), semicondutor (10⁻⁴ V/µε), piezoelétrico (1 V/µε). Termopares: 15-250 µV/K, faixa -270°C a 3000°C. Acelerômetros MEMS capacitivos: 0-10³ Hz, até ±10³ g; piezoelétricos: 1-20×10³ Hz, até ±10⁶ g. Comparação de atuadores: piezo direto (≤0.1% curso, 10⁶ Hz), SMA (~5% curso, <100 Hz), magnetostritivo (≤0.2% curso, 10⁴ Hz). Consumo de microcontroladores: MSP-430G2553 (230 µA/MHz ativo, <0.1 µA off), STM32L4 (120 µA/MHz ativo, 0.33 µA off). Wireless: Bluetooth (10m, 1 Mbps, 10 mW), Wi-Fi (100m, 15 Mbps, 835 mW), ZigBee (100m, 250 kbps, 36.9 mW). Market share industrial: Ethernet industrial 66%, Fieldbus 27%, Wireless 7%.",

    "resultados": "Sensores FBG: resolução de deformação <1 µm, robustos a temperaturas >1000°C, imunes a interferências eletromagnéticas. Sensores SAW: medição sem contato de temperatura e deformação, passivos. Atuadores piezoelétricos dominam aplicações de alta frequência (até 10⁶ Hz) com alta rigidez. Atuadores magnetorreológicos permitem controle de viscosidade por várias ordens de magnitude com campos de ~1 Tesla. Transferência indutiva de energia: configurações radiais e axiais para ferramentas rotativas. Taxas de amostragem típicas em ferramentas inteligentes: até 83.3 kHz com resolução 16-bit. Aplicações de controle em malha fechada: detecção de chatter, compensação de deflexão da ferramenta (±10 nm), monitoramento de desgaste. Sistemas comerciais: Sandvik Silent Tools (TMD passivo), MAPAL Tooltronic (eixo NC adicional), Ceratizit KOMtronic U-Axis. Tendências: 5G para controle baseado em nuvem, Bluetooth 5.0 com maior alcance, energy harvesting para sensores autônomos.",

    "contribuicoes": "1) Revisão abrangente do estado da arte em sistemas de ferramentas mecatrônicas inteligentes. 2) Taxonomia de sensores para medição de força, deslocamento, temperatura e aceleração com comparação de sensibilidades e faixas de operação. 3) Análise comparativa de princípios de atuação (piezo, MRF, SMA, magnetostritivo, eletromagnético) com métricas de densidade de trabalho volumétrico e faixa dinâmica. 4) Revisão de métodos de transferência de energia e dados para ferramentas rotativas. 5) Análise de técnicas de processamento de sinais incluindo machine learning (CNN, ANN, Random Forest) para detecção de chatter e estimação de desgaste. 6) Catálogo de aplicações em torneamento, furação, fresamento e retificação com sensores e atuadores integrados. 7) Identificação de tendências futuras: miniaturização, transmissão wireless de alta velocidade, MEMS avançados, impressão 4D de materiais inteligentes.",

    "limitacoes": "Artigo focado em usinagem discreta com arestas de corte definidas e indefinidas - não aborda processos de conformação ou manufatura aditiva. Desafios identificados: miniaturização de atuadores, transmissão wireless de baixa latência e alta frequência, transmissão de energia sem fio ou energy harvesting eficiente, processamento embarcado em microcontroladores com limitação de recursos. Integração modular em máquinas-ferramenta ainda complexa devido a arquiteturas fechadas de CNCs. Análise de latência e jitter em comunicação industrial não aprofundada. Custos de implementação de sistemas comerciais não detalhados.",

    "topico": "Sensor Integration, Actuator Integration, Smart Tooling, Mechatronics, Machining Process Monitoring, Process Control, Strain Gauges, Piezoelectric Sensors, MEMS Accelerometers, Fiber Bragg Grating (FBG), Surface Acoustic Wave (SAW), Thermocouples, Piezoelectric Actuators, Magnetorheological Fluids (MRF), Shape Memory Alloys (SMA), Magnetostrictive Actuators, Inductive Power Transfer, Energy Harvesting, Wireless Data Transmission, OPC UA, MTConnect, MQTT, Edge Computing, Digital Twin, Machine Learning, CNN, Chatter Detection, Tool Wear Monitoring, Adaptive Control, CNC Integration",
    "area_aplicacao": "Metal Cutting, Turning, Milling, Drilling, Boring, Grinding, Reaming, Tapping, Machine Tools, Manufacturing Automation, Industry 4.0, Cyber-Physical Production Systems (CPPS), Precision Machining, Process Monitoring, Vibration Control, Thermal Compensation, Tool Condition Monitoring",

    "tipo_dados": "Não aplicável - Keynote paper (artigo de revisão). Compilação de dados de sensibilidade de sensores, faixas de operação de atuadores, consumo de energia de microcontroladores, taxas de dados de protocolos wireless, market share de tecnologias industriais",
    "dataset": "Não aplicável - Revisão sistemática de literatura com aproximadamente 300 referências cobrindo período de 1969-2023",
    "frameworks": "Análise de protocolos: OPC UA, OPC UA TSN, MTConnect, MQTT, Fieldbus (PROFINET, EtherNet/IP, EtherCAT, Modbus). Wireless: IEEE 802.15.4 (ZigBee, WirelessHART), Bluetooth 5.0, Wi-Fi 6, 5G NR. Sensores: strain gauges, piezoelétricos, MEMS, FBG, SAW, termopares. Atuadores: piezo stacks, MRF dampers, SMA wires, Terfenol-D. Plataformas: CNC Siemens Sinumerik, Heidenhain iTNC, B&R. Software: MAST (Modeling and Analysis Suite), machine learning frameworks (CNN, ANN, Random Forest)",
    "link_codigo": "Não disponível - Artigo de revisão keynote"
  },
  {
    "numero": 46,
    "nome_arquivo": "Sensors, systems and algorithms of 3D reconstruction for smart agriculture and precision farming_ A review.pdf",

    "autores": "Shuwan Yu; Xiaoang Liu; Qianqiu Tan; Zitong Wang; Baohua Zhang",
    "ano": 2024,
    "titulo": "Sensors, systems and algorithms of 3D reconstruction for smart agriculture and precision farming: A review",
    "subtitulo": "",
    "journal": "Computers and Electronics in Agriculture",
    "publisher": "Elsevier",

    "objetivo": "Fornecer uma revisão abrangente do progresso de pesquisa em tecnologia de reconstrução 3D para agricultura inteligente e agricultura de precisão. O artigo examina características e desenvolvimento de vários sensores e sistemas de sensoriamento, discute métodos para implementar reconstrução 3D, e resume aplicações em robótica agrícola, fenotipagem de culturas, pecuária e indústria alimentícia, identificando desafios e tendências futuras.",

    "metodologia": "Artigo de revisão sistemática estruturado em seções: (1) Sensores e sistemas de reconstrução 3D: LiDAR (Light Detection and Ranging), laser scanners (terrestres e aéreos), câmeras monoculares, câmeras binoculares/estéreo, câmeras RGB-D (Microsoft Kinect, Intel RealSense, ASUS Xtion, Orbbec Astra), sistemas de luz estruturada (ponto, linha, área), sensores não-ópticos (ultrassônicos, infravermelho, radar de micro-ondas) e sistemas de fusão multi-sensor (HLF, LLF, MLF). (2) Métodos de reconstrução 3D tradicionais-ativos: Time of Flight (ToF) com modulação pulsada (PW-iToF) ou contínua (CW-iToF), triangulação (Delaunay), luz estruturada (baseada em triangulação e fase - FTP/PMP). (3) Métodos tradicionais-passivos: Multi-View Stereo (MVS), Structure from Motion (SFM), visão estéreo binocular, Shape from Shading (SFS), Shape from Texture (SFT). (4) Métodos baseados em deep learning: CNNs, RNNs, GCNs para reconstrução single-image e multi-image, representações em voxel, point cloud e mesh, NeRF (Neural Radiance Fields). (5) Aplicações categorizadas: robótica agrícola (navegação, mapeamento, operações automatizadas), fenotipagem de culturas (planta individual, população de campo, raízes), pecuária (criação de precisão, monitoramento de saúde, análise comportamental), indústria alimentícia (classificação de frutas, estimativa de volume de carne, avaliação de porções).",

    "analise_estatistica": "Revisão qualitativa comparativa de sensores, métodos e aplicações. Tabelas detalhadas: Table 1 - aplicações de reconstrução 3D em robótica agrícola (navegação, mapeamento, poda, colheita, pulverização) com sensores, algoritmos e referências; Table 2 - aplicações em fenotipagem de culturas (plantas individuais, grupos, raízes) com parâmetros medidos (altura, área foliar, largura de folha, volume, arquitetura de raízes); Table 3 - aplicações em pecuária (gado, porcos, galinhas, ovelhas, peixes, cavalos) com sensores (Kinect v1/v2/DK, LiDAR, câmeras estéreo, MRI, CT) e algoritmos (ICP, RANSAC, ToF, SFM, deep learning). Comparação de características de sensores: câmeras monoculares (baixo custo, design simples, limitação em percepção de profundidade), câmeras binoculares (percepção espacial ampla, requer calibração precisa), RGB-D (captura simultânea de cor e profundidade, ruído em superfícies brilhantes/transparentes), LiDAR (alta precisão, custo elevado), luz estruturada (alta precisão de medição, suscetível a iluminação ambiente). Métodos ativos geralmente produzem maior densidade e precisão de point cloud que passivos.",

    "resultados": "Síntese do estado da arte em reconstrução 3D agrícola. Sensores: LiDAR oferece percepção confiável 24h com amplo campo de visão e alcance estendido; laser scanners terrestres geram milhares de pontos por metro quadrado; RGB-D cameras (Kinect, RealSense) são acessíveis com captura simultânea de cor e profundidade via luz estruturada ou ToF; sistemas de luz estruturada fornecem alta precisão mas são suscetíveis a iluminação ambiente forte. Métodos: ToF penetra plantas e obtém elevação precisa do solo; triangulação oferece maior resolução z para distâncias próximas; SFM-MVS produz point clouds densos de múltiplas imagens; NeRF permite reconstrução de alta fidelidade com MLPs simples modelando campos de radiância. Aplicações em robótica: navegação baseada em detecção de fileiras de culturas, mapeamento de pomares com RGB-D e UGV, poda automatizada de videiras com câmeras estéreo trinoculares, colheita de frutas com CNN e triangulação. Fenotipagem: medição não-destrutiva de altura de planta, área foliar, ângulo de inclinação, volume de raízes; reconstrução de populações de campo para estimativa de rendimento; CT e MRI para observação não-invasiva de sistemas radiculares em solo. Pecuária: medição de dimensões corporais (altura, comprimento, largura, circunferência abdominal) com múltiplas câmeras RGB-D; monitoramento de condição corporal; análise comportamental para bem-estar animal. Indústria alimentícia: classificação de frutas por forma, tamanho e defeitos; estimativa de Lean Meat Yield em carcaças; avaliação de porções alimentares com reconstrução 3D de duas vistas.",

    "contribuicoes": "1) Revisão abrangente de sensores para reconstrução 3D agrícola: LiDAR, laser scanners, câmeras monoculares, binoculares, RGB-D, sistemas de luz estruturada, sensores não-ópticos e sistemas de fusão multi-sensor. 2) Taxonomia de métodos de reconstrução 3D: tradicionais-ativos (ToF, triangulação, luz estruturada), tradicionais-passivos (MVS, SFM, visão estéreo, SFS, SFT) e baseados em deep learning (CNNs, RNNs, GCNs, NeRF). 3) Catálogo extensivo de aplicações em quatro domínios: robótica agrícola (navegação, mapeamento, operações automatizadas), fenotipagem de culturas (planta individual, população, raízes), pecuária (criação, saúde, comportamento), indústria alimentícia (classificação, carcaças, porções). 4) Tabelas detalhadas (Tables 1-3) mapeando sensores, algoritmos e aplicações específicas com referências. 5) Identificação de desafios: complexidade e variabilidade de cenas agrícolas, condições de iluminação variáveis, oclusão de dossel, processamento de dados em larga escala. 6) Perspectivas futuras: NeRF e 3DGS (3D Gaussian Splatting) para reconstrução de alta fidelidade, integração de UAVs e redes de sensores para aquisição automática, modelos de IA para geração e atualização automática de modelos, AR/VR para interação humano-computador em agricultura digital.",

    "limitacoes": "Desafios identificados na aplicação prática: (1) Complexidade e variabilidade de cenas agrícolas - terreno irregular, tipos diversos de culturas, condições de iluminação variáveis dificultam inferência precisa de estruturas 3D a partir de imagens 2D. (2) Mudanças dinâmicas em cenários agrícolas (crescimento de culturas, mudanças sazonais, clima) requerem técnicas capazes de atualização e adaptação em tempo real. (3) Oclusão de estrutura de dossel pode causar lacunas, regiões sem textura e imagens borradas em modelos 3D. (4) Limitação de poder computacional e espaço de armazenamento para dados em larga escala - ambientes agrícolas são geralmente grandes e não-delimitados. (5) Qualidade de reconstrução depende do número de imagens, mas mais imagens requerem mais recursos computacionais. (6) Câmeras RGB-D de consumo exibem ruído e incompletude em superfícies brilhantes, transparentes ou distantes. (7) Luz estruturada é suscetível a interferência de iluminação ambiente forte em cenas agrícolas externas.",

    "topico": "3D Reconstruction, Smart Agriculture, Precision Farming, Machine Vision, Agricultural Robotics, Crop Phenotyping, LiDAR, RGB-D Cameras, Stereo Vision, Structure from Motion (SFM), Multi-View Stereo (MVS), Time of Flight (ToF), Structured Light, Deep Learning, Neural Radiance Fields (NeRF), 3D Gaussian Splatting (3DGS), Point Cloud, Mesh Reconstruction, Voxel Representation, CNNs, RNNs, GCNs, Sensor Fusion, Monocular Vision, Binocular Vision, Depth Cameras, Microsoft Kinect, Intel RealSense, Laser Scanner, Shape from Shading, Shape from Texture, Triangulation, Plant Phenotyping, Root Phenotyping, Livestock Monitoring, Food Industry, Fruit Grading, Carcass Analysis, Agricultural Mapping, Autonomous Navigation, Harvesting Robots, Yield Estimation",
    "area_aplicacao": "Smart Agriculture, Precision Farming, Agricultural Robotics, Crop Phenotyping, Plant Science, Livestock Management, Food Industry, Fruit Quality Assessment, Meat Processing, Autonomous Agricultural Vehicles, Field Mapping, Yield Estimation, Root System Analysis, Animal Welfare Monitoring, Body Condition Scoring, Food Portion Assessment, Greenhouse Automation, Orchard Management, Vineyard Monitoring, Precision Livestock Farming",

    "tipo_dados": "Não aplicável - Review article. Compilação de dados de sensores (especificações de LiDAR, câmeras RGB-D, sistemas de luz estruturada), algoritmos de reconstrução 3D, métricas de fenotipagem de culturas, parâmetros corporais de animais, características de frutas e alimentos",
    "dataset": "Datasets mencionados para treinamento de redes neurais: ShapeNet, Pascal 3D+, ObjectNet3D, KITTI. Datasets específicos de aplicações agrícolas referenciados nas tabelas de aplicações",
    "frameworks": "Análise de sensores: Microsoft Kinect (v1, v2, Azure Kinect DK), Intel RealSense, ASUS Xtion, Orbbec Astra, Velodyne LiDAR, SICK LiDAR, Hokuyo LiDAR. Software e algoritmos: KinectFusion, SLAM (Visual SLAM, RGB-D SLAM), OpenCV, PCL (Point Cloud Library), Agisoft Photoscan, Pix4D Mapper, VisualSFM, MeshLab, COLMAP. Frameworks de deep learning: TensorFlow, PyTorch, redes VGG, CNNs, RNNs, GCNs. Métodos de fenotipagem: LemnaTec, GiA Roots, RootReader3D, WinRhizo. Plataformas robóticas: ROS, UAVs, UGVs",
    "link_codigo": "Não disponível - Artigo de revisão"
  },
  {
    "numero": 47,
    "nome_arquivo": "Spatial hybrid_parallel force control of a hexapod machine tool using structure-integrated force sensors and a commercial numerical control.pdf",

    "autores": "Christian Friedrich; Frederik Schlüter; Steffen Ihlenfeldt",
    "ano": 2023,
    "titulo": "Spatial hybrid/parallel force control of a hexapod machine tool using structure-integrated force sensors and a commercial numerical control",
    "subtitulo": "",
    "journal": "Mechatronics",
    "publisher": "Elsevier",

    "objetivo": "Apresentar o controle híbrido/paralelo de força espacial de uma máquina-ferramenta hexapod utilizando sensores de força integrados à estrutura e um sistema de controle numérico comercial (Beckhoff TwinCAT). O trabalho visa provar a viabilidade do controle de força com sensores integrados à estrutura e apresentar novos aspectos práticos do controle de força com CNC, desenvolvendo duas abordagens (LR1 e LR2) para diferentes casos de uso como teach-in, controle de força assíncrono e controle força/posição síncrono com task frame variável.",

    "metodologia": "Duas soluções de controle de força desenvolvidas e implementadas na máquina-ferramenta hexapod Felix I: (1) LR1: utiliza High Level Interface (HLI) para comando externo dos eixos via PLC, com planejamento de trajetória integrado. Offsets de controle de força aplicados via interface proprietária CNC-PLC. Interface ADS para set-points assíncronos de não-tempo-real. Adequado para teach-in (UC1) e controle de força assíncrono (UC2). (2) LR2: módulo C++ 'man-in-the-middle' entre CNC e controladores de drive, integrado na tarefa CNC GEO. Eixos de força virtuais {XF, YF, ZF, UF, VF, WF} integrados ao G-Code para interpolação síncrona de set-points de força e posição. Set-points via código G (DIN 66025/ISO 6983) com comandos M e parâmetros externos. Adequado para controle força/posição síncrono ao movimento (UC3). Modelos de medição de força para diferentes posicionamentos de sensores: 1a (mesa de fixação rígida não-móvel - 6 equações, 42 parâmetros), 1b (plataforma end-effector móvel - modelo dinâmico de corpo rígido com massa, centro de gravidade, inércia, termos de Coriolis e gravitacionais - 6 equações, 56 parâmetros, 18 estados em tempo real), 2a-d (cinemática hexapod com sensores nos struts - modelo Newton-Euler com 25 corpos móveis, 186 equações, 260 parâmetros, 486 estados). Leis de controle: controladores PID no Task Space com matriz de seleção diagonal para escolha de graus de liberdade controlados por força. Três abordagens de transformação: (1) Jacobiano inverso (baixo custo computacional, erro 0.75μm para offset 1mm), (2) transformação cinemática direta/inversa completa (precisão total, alto custo), (3) cinemática inversa com memória (sem movimento CNC paralelo). Sistemas de coordenadas definíveis pelo usuário: Task Base (fixo à base) e Task Platform (fixo à plataforma). Máquina de estados para gerenciamento de transições entre controle de posição e força, busca de contato, e tratamento de erros.",

    "analise_estatistica": "Parâmetros de controlador determinados experimentalmente usando regras de Ziegler-Nichols para força Z de 200N. Comparação de sistemas de medição de força com tempos de filtro T1=50ms, 100ms, 200ms: sensor FT (R) Kp=10-40μm/N, Tn=5-7ms; mesa de fixação (1a) Kp=8-26μm/N, Tn=10-14ms; end-effector (1b) Kp=5-15μm/N, Tn=12ms; cinemática (2b) Kp=1.5-2μm/N, Tn=16-20ms. Análise de resposta ao degrau LR1: tempo morto Tt=22ms, tempo de acomodação T95=120ms, tempo morto de atraso Tu=29ms, tempo de compensação Tg=64ms. Solução LR2: tempo morto Tt=12ms (significativamente melhor). Degraus nominais: LR1 overshoot 3.6% (para 1000N) e 24.2% (para 500N); LR2 overshoot 2.2% (para 1000N) e 5% (para 500N). Degraus de perturbação: LR1 até 100% overshoot, settling 260ms; LR2 24.5% overshoot, settling 160ms. Controle híbrido UC2: força alvo 1000N mantida com incerteza ±20.5N (desvio padrão simples), correspondendo a 6.2% (3σ, 99.73%). Contour following: desvios máximos de força 2.7% (com feedforward) e 5.9% (sem feedforward). Taxa de avanço do controlador de força: 2.9mm/s (sem feedforward) e 1.6mm/s (com feedforward) vs 0.1mm/s do LR1. Controle de força radial: desvio máximo 6.5%. Comparação de sistemas na rampa de contorno: desvio de controle R=13.2%, 1b=29.8%, 1a=35.2%, 2b=37.8%.",

    "resultados": "Solução LR1 validada para teach-in (UC1) e controle de força assíncrono (UC2), porém com dinâmica inferior devido ao planejamento de trajetória e altos tempos mortos. Interface de usuário permite seleção de coordenadas controladas, parâmetros do controlador, limites de força e workspace. Teach-in com sensores integrados permite guiar máquina tocando plataforma (1b) ou struts (2b), aumentando segurança e conforto. Solução LR2 alcança dinâmica significativamente maior: interpolação síncrona de força e posição via G-Code com eixos virtuais. Tempo morto de apenas 1 ciclo de controle (2ms) até set-point chegar ao controlador de posição. Contour following bem-sucedido: experimentos com contorno de amplitude 56.6mm (sem feedforward) e 16.5mm (com feedforward de 5 pontos). Feedforward de coordenada Z reduz perturbação a ser compensada pelo controlador de força. Task frames variáveis validados: controle de força radial em peça circular e em forma de rim, controle de força normal em peça em forma de rim reduzindo forças laterais para próximo de zero. Integração G-Code completa: comandos M50-M58 para controle de estado, PARAM[1-57] para task frames, limites de workspace, parâmetros do controlador e coordenadas de origem. Transformação cinemática integrada ao kernel CNC (McCOM-Trafo) com verificação de limites de máquina em tempo real. Todos os sistemas de medição de força estruturalmente integrados adequados para controle de força, com trade-off entre proximidade ao TCP e dinâmica alcançável. Para muitas aplicações, a menor dinâmica dos sensores integrados pode ser acomodada por taxas de avanço correspondentemente menores.",

    "contribuicoes": "1) Duas soluções de controle de força (LR1 e LR2) integradas a CNC comercial (Beckhoff TwinCAT) para diferentes casos de uso: teach-in, controle assíncrono e controle síncrono força/posição. 2) Integração G-Code com eixos de força virtuais para interpolação síncrona de força e posição no mesmo bloco NC. 3) Validação de sensores de força integrados à estrutura para controle de força espacial em 6 DoF em máquinas-ferramenta hexapod. 4) Máquina de estados para busca de contato, ativação/desativação do controle de força e tratamento de erros. 5) Sistemas de coordenadas de tarefa variáveis (Task Base e Task Platform) programáveis via G-Code para controle de força radial e normal. 6) Comparação sistemática de sistemas de medição de força mostrando trade-offs entre proximidade do sensor ao TCP e dinâmica de controle alcançável. 7) Modelos de medição de força em tempo real para diferentes posicionamentos de sensores: estrutura rígida (1a, 1b) e cinemática hexapod (2a-d). 8) Demonstração de teach-in com sensores integrados permitindo guiar máquina por contato em struts ou plataforma, aumentando distância operador-TCP para maior segurança.",

    "limitacoes": "Solução LR1 limitada por altos tempos mortos (22ms) e atrasos de planejamento de trajetória, inadequada para controle força/posição síncrono (UC3). Sensores integrados à estrutura alcançam dinâmica inferior comparada a sensores FT - desvios de controle até 37.8% vs 13.2%. Ganho do controlador limitado por estabilidade devido à distância do TCP. Taxa de avanço deve ser reduzida para manter desvio de controle permissível com sensores integrados. Solução LR2 requer desativação do monitoramento de erro de seguimento no CNC (monitoramento nos inversores permanece ativo). Planejamento de trajetória, interpolação e verificações de segurança dos offsets comandados não são realizados pelo CNC na solução LR2. Métodos de controle de força mais avançados devem ser estudados em trabalhos futuros para melhorar performance de controle. Modelo cinemático (2a-d) requer 486 estados em tempo real, alto custo computacional. Filtro de força mais alto permite aumentar ganho Kp mas tem influência menor no tempo de reset Tn alcançável.",

    "topico": "Hexapod Machine Tool, Force Control, Force Measurement, Structure-Integrated Force Sensors, Parallel Kinematic Machines (PKM), Hybrid Force/Position Control, Parallel Force/Motion Control, CNC Integration, G-Code Programming, Beckhoff TwinCAT, PID Control, Task Frame, Coordinate Transformation, Jacobian Matrix, Forward/Inverse Kinematics, Teach-in, Contour Following, Stewart Platform, Newton-Euler Dynamics, Rigid Body Dynamics, State Machine, Real-time Control, Sercos Communication, Man-in-the-Middle Architecture, Virtual Axes, Selection Matrix, Contact Search, Radial Force Control, Normal Force Control",
    "area_aplicacao": "Machine Tools, Manufacturing Automation, Force-Controlled Machining, Grinding, Polishing, Deburring, Thermo-smoothing, Process Monitoring, Quality Assurance, Tool Condition Monitoring, Parallel Kinematic Machine Tools, Industrial Robotics, Precision Manufacturing, Metal Cutting, Forming Processes, Assembly Tasks, Hardware-in-the-Loop Testing, Collaborative Robotics",

    "tipo_dados": "Forças medidas (N), coordenadas de posição (mm), parâmetros de controlador (Kp em μm/N, Tn em ms), características de resposta ao degrau (tempo morto, tempo de acomodação, overshoot), desvios de contour tracking, offsets de controlador de força",
    "dataset": "Não aplicável - experimentos com protótipo físico (máquina-ferramenta hexapod Felix I com sensores de força integrados à estrutura e sensor FT comercial como referência)",
    "frameworks": "Beckhoff TwinCAT 3.1 (CNC), C++ (módulos de medição e controle de força), PLC (IEC 61131-3), G-Code (DIN 66025 / ISO 6983), Sercos II (comunicação com drives), McCOM-Trafo (interface de transformação cinemática Beckhoff), ADS interface (comunicação não-tempo-real), High Level Interface HLI (interface CNC-PLC), sensores de força 1 DoF integrados aos struts hexapod, sensor força/torque 6 DoF comercial (referência), servo drives com controladores em cascata (corrente 125μs, velocidade 250μs, posição 1ms)",
    "link_codigo": "Não disponível (Data will be made available on request)"
  },
  {
    "numero": 48,
    "nome_arquivo": "Stability analysis for an ad-hoc model predictive control in DC.pdf",

    "autores": "Alejandro Garcés-Ruiz; Walter Gil-González; Oscar Danilo Montoya",
    "ano": 2024,
    "titulo": "Stability analysis for an ad-hoc model predictive control in DC/DC converters with a constant power load",
    "subtitulo": "",
    "journal": "Results in Engineering",
    "publisher": "Elsevier",

    "objetivo": "Apresentar análise de estabilidade para um controle preditivo de modelo (MPC) de horizonte um com conjunto de controle contínuo (CCS-MPC) para conversores DC/DC conectados a cargas de potência constante (CPLs). O trabalho visa provar formalmente a estabilidade tanto em malha aberta quanto fechada, propondo uma abordagem geral aplicável a qualquer conversor DC/DC de segunda ordem incluindo Buck, Boost, Buck-Boost e Buck-Boost não-inversor.",

    "metodologia": "Modelo dinâmico não-linear em tempo discreto generalizado para conversores DC/DC de segunda ordem: x⁺ = M⁻¹(A(x)x + (ξ₁+ξ₂u)Bx + (ξ₃+ξ₄u)b), com estados x=(i,v) e entrada u (índice de modulação). Análise de estabilidade usando critério traço-determinante (critério do triângulo) para sistemas em tempo discreto em ℝ²: |tr(J)|-1 < det(J) < 1. Prova formal de instabilidade em malha aberta: det(J₀) ≥ 1 para todo ponto de equilíbrio, indicando pelo menos um autovalor fora do círculo unitário. Proposta de CCS-MPC de horizonte um baseada em problema de controle ótimo (OCP): min ½||M(x⁺-x̄)||²_Q + ρ/2(u-ū)² sujeito a dinâmica do conversor e restrições de caixa u∈[umin,umax]. Lei de controle em forma fechada: u(x) = proj_U((ρū - ψ₁(x)ᵀQψ₂(x))/(ρ + ψ₂(x)ᵀQψ₂(x))). Prova de otimalidade global e unicidade da solução (problema convexo estritamente convexo). Análise de estabilidade em malha fechada via linearização: Jacobiano J = J₀ - (1/σ)J_M Q J_AB. Condições de estabilidade expressas como desigualdades matriciais lineares (LMIs) para seleção de Q e ρ. Formulação de problema de otimização convexa off-line: min||Q|| sujeito às LMIs de estabilidade. Parâmetros dos conversores: cv=100μF, li=47μH, v₀=12V ou 24V, frequência de chaveamento 100kHz. Implementação em MATLAB usando interface Yalmip para resolver otimização convexa.",

    "analise_estatistica": "Três índices de performance calculados: ITSE (Integral of Time-multiplied Square Error), IAE (Integral Absolute Error), ITAE (Integral of Time-multiplied Absolute Error). Conversor Boost: ITSE=4.915×10⁻⁶, IAE=1.521×10⁻², ITAE=1.521×10⁻⁴, tempo de acomodação Ts=5ms. Conversor Buck-Boost: ITSE=3.366×10⁻⁶, IAE=6.607×10⁻³, ITAE=6.608×10⁻⁵, tempo de acomodação Ts=1.5ms. Análise de sensibilidade: variação de autovalores quando CPL varia de 0W a 100W em passos de 2.5W. Critério do triângulo: det(J)≥1 prova instabilidade em malha aberta para todo conversor independente dos parâmetros específicos. Desvios de tensão de saída menores que 0.1V. Estabilização em menos de 0.2ms para conversor Boost. Parâmetros ótimos encontrados via otimização convexa: Boost ρ=25.1298, Q=[[1.0261,0.9739],[0.9739,1.0261]]; Buck-Boost ρ=793.7977, Q=[[8.6670,-49.4975],[-49.4975,481.4370]].",

    "resultados": "Prova formal de instabilidade em malha aberta: todo ponto de equilíbrio x̄∈Ω é instável para conversores DC/DC alimentando CPLs com índice de modulação constante. Simulações confirmam que perturbações mínimas na CPL (de 10W para 10.01W) causam instabilidade nas variáveis elétricas (corrente e tensão divergem). Retrato de fase do conversor Boost em malha aberta mostra fonte espiral (spiral source) mesmo para pequenas variações do equilíbrio. CCS-MPC proposto estabiliza sistema: conversor Boost estabiliza em menos de 0.2ms com desvios de tensão <0.1V; conversor Buck-Boost estabiliza em <0.1ms. Sinal de controle permanece estável e longe dos limites, indicando capacidade de suportar variações adicionais de carga. Corrente do indutor experimenta overshoot devido à mudança súbita de carga mas converge como sistema de primeira ordem. Análise de sensibilidade dos autovalores: para CPLs pequenas, autovalores têm partes real e imaginária; para CPL>25W, autovalores são apenas reais (sem oscilações) mas um tende a 1 (limite de estabilidade). Controlador proposto garante estabilidade em malha fechada sob todas as condições de carga examinadas (0-100W). Valores de ITSE extremamente baixos indicam eficiência excepcional em reduzir erro ao longo do tempo.",

    "contribuicoes": "1) Análise da instabilidade de conversores DC/DC de segunda ordem alimentando CPLs em malha aberta usando critério traço-determinante (critério do triângulo) - abordagem simples e pedagógica para entender o fenômeno. 2) Proposta de CCS-MPC de horizonte um para regular tensão de saída em conversores DC/DC de segunda ordem, com problema de otimização analisado em detalhe e controle em forma fechada facilmente implementável. 3) Condições formais de estabilidade em malha fechada encontradas, transformáveis em problema de otimização convexa resolvível durante fase de projeto. 4) Abordagem geral aplicável a qualquer conversor DC/DC de segunda ordem (Buck, Boost, Buck-Boost, non-inverting Buck-Boost) com estrutura matemática similar. 5) Framework que vai além da análise como ferramenta prática para projeto de sistemas de controle com garantias de estabilidade e otimalidade global.",

    "limitacoes": "Análise restrita a conversores DC/DC de segunda ordem - não aplicável diretamente a topologias de ordem superior. Modelo assume CPL ideal sem dinâmica própria. Otimização para encontrar Q e ρ realizada off-line durante projeto, não adaptativa em tempo real. Análise de sensibilidade mostra que para CPLs grandes (próximo de 100W) um autovalor tende ao limite de estabilidade (magnitude 1). Trabalhos futuros sugeridos: (i) extensão para conversores de integração de fontes renováveis ou sistemas de armazenamento em redes AC (conversores fonte de tensão ou corrente); (ii) incorporação de incertezas relacionadas a parâmetros do conversor; (iii) exploração de estimadores para tensão de entrada e CPL conectada.",

    "topico": "Model Predictive Control (MPC), DC/DC Converters, Constant Power Load (CPL), Stability Analysis, Continuous Control Set MPC (CCS-MPC), One-Step Horizon, Discrete-Time Systems, Nonlinear Control, Asymptotic Stability, Trace-Determinant Criterion, Triangle Criterion, Buck Converter, Boost Converter, Buck-Boost Converter, Non-Inverting Buck-Boost, DC Microgrids, Optimal Control Problem (OCP), Linear Matrix Inequalities (LMI), Convex Optimization, Pulse Width Modulation (PWM), Jacobian Matrix, Eigenvalue Analysis, Lyapunov Stability, Power Electronics Control, Voltage Regulation",
    "area_aplicacao": "DC Microgrids, Power Electronics, Renewable Energy Integration, Energy Storage Systems, DC Distribution Networks, Electric Vehicles, Electronic Devices Power Supply, Smart Grids, Industrial Power Systems, Battery Management Systems, Solar PV Systems, Distributed Energy Resources",

    "tipo_dados": "Simulações numéricas de conversores DC/DC, respostas dinâmicas de tensão e corrente, índices de performance de controle (ITSE, IAE, ITAE), autovalores de sistemas linearizados, parâmetros de controlador (Q, ρ)",
    "dataset": "Não aplicável - simulações numéricas com parâmetros de conversores: cv=100μF, li=47μH, v₀=12V/24V, CPL=10W a 100W, frequência de chaveamento 100kHz",
    "frameworks": "MATLAB, Yalmip (interface para modelagem e otimização), Otimização convexa off-line para seleção de parâmetros Q e ρ, PWM (Pulse Width Modulation) para frequência de chaveamento constante",
    "link_codigo": "Não disponível (No data was used for the research described in the article)"
  },
  {
    "numero": 49,
    "nome_arquivo": "Stiffness optimization design of wheeled-legged rover integrating active and passive compliance capabilities.pdf",

    "autores": "Bike Zhu; Jun He; Feng Gao",
    "ano": 2024,
    "titulo": "Stiffness optimization design of wheeled-legged rover integrating active and passive compliance capabilities",
    "subtitulo": "",
    "journal": "Mechanism and Machine Theory",
    "publisher": "Elsevier",

    "objetivo": "Realizar o design de otimização de rigidez para um rover com rodas e pernas (TAWL - Terrain-Adaptive Wheel-Legged) com capacidades de conformidade ativa e passiva. A rigidez do sistema de suspensão afeta a capacidade de adaptação a terrenos irregulares, capacidade de carga, estabilidade do corpo e consumo de energia. O trabalho visa otimizar a combinação de rigidez ativa e passiva para melhorar o desempenho abrangente do sistema, utilizando o método de atlas de desempenho para otimização multi-objetivo.",

    "metodologia": "Desenvolvimento de modelo cinemático para sistema híbrido série-paralelo com 20 DoFs (4 pernas × 5 juntas cada) e molas passivas. Estrutura TAWL: cada perna possui 3 juntas rotacionais e 2 prismáticas, com molas de compressão paralelas às juntas prismáticas para conformidade passiva, e controle de impedância para conformidade ativa. Parâmetros de otimização: rigidez passiva das molas (k) e ganho de rigidez ativa (KA). Derivação de índices de desempenho individuais: (1) Coeficiente de deformação (ηS): capacidade de deformação vertical (ηSTz) e deformação angular (ηSRβ) para adaptação a terrenos; (2) Coeficiente de capacidade de carga (ηC): suporte de carga vertical (ηCFz) e momento de rolagem (ηCTβ); (3) Coeficiente de distribuição ACE (ηACE): uniformidade de distribuição de energia de conformidade ativa entre as pernas; (4) Coeficiente de estabilidade dinâmica (ηN): margem de estabilidade usando critério do ponto zero-momento (ZMP). Método de atlas de desempenho para otimização multi-objetivo: discretização do espaço de design em grid de (k, θ3, θ4), cálculo de índices para cada combinação, visualização em gráficos polares para seleção intuitiva da região ótima global. Comparação com algoritmo de ponto interior (weighted sum) e algoritmo genético multi-objetivo (NSGA). Experimentos físicos com protótipo TAWL em dois terrenos (Terrain A e B) com diferentes ângulos de inclinação (20° e 30°) e alturas de obstáculos.",

    "analise_estatistica": "Coeficiente de desempenho global ηave definido como média ponderada dos índices individuais normalizados pelos valores máximos. Comparação de métodos de otimização: Weighted Sum (complexidade O(n^1.5L) a O(n^4.5L) para NLP, pode ficar preso em ótimos locais), Pareto/NSGA (complexidade O(G×M×N²), visualização difícil para >3 objetivos), Performance Atlas (complexidade O(m^n), maior custo mas seleção intuitiva e evita ótimos locais). Experimentos com múltiplas combinações de rigidez: k={2.88, 5.06, 10.60} N/mm e KA={0.6, 0.8, 1.0, 1.2, 1.4, 1.6}. Métricas medidas: altura do corpo no eixo Z (mm), ângulo de pitch (°), variação total das juntas (°), desvio de força (N), variação total das molas (mm). Terrain A (inclinação 20°): altura do corpo 520-600mm, ângulo de pitch -0.6° a +0.2°, variação de juntas 0-80°, desvio de força -100N a +40N. Terrain B (inclinação 30°): altura do corpo 400-630mm, variação de molas 0-100mm, ângulo de pitch -0.7° a +0.2°. Combinação ótima (k=5.06, KA=1.0) apresenta melhor ηave≈3.19, mais próxima dos resultados otimizados teoricamente.",

    "resultados": "Modelo cinemático preciso estabelecido para sistema série-paralelo híbrido com 20 DoFs e molas passivas. Região ótima global identificada via atlas de desempenho: θ3∈[60°,90°] e θ4∈[140°,160°] para rigidez k≈5 N/mm. Combinação de rigidez (k=5.06, KA=1.0), mais próxima do design otimizado, exibe o melhor desempenho global (ηave≈3.19). Validação experimental em Terrain A (20°) e Terrain B (30°): altura do corpo mantida estável, ângulo de pitch minimizado, variação de juntas distribuída uniformemente. Comparação de algoritmos demonstra vantagens do método de atlas de desempenho: (1) taxa de sucesso máxima (seleção intuitiva do ótimo global), (2) visualização excelente (trade-offs entre objetivos observáveis graficamente), (3) evita ótimos locais (exploração exaustiva do espaço). Weighted sum pode ficar preso em ótimos locais; NSGA produz conjunto Pareto que requer análise adicional para seleção. Sensores de força e encoders validam deformações das molas e forças de contato durante processo de conformidade. Fotos experimentais mostram adaptação do rover a terrenos com múltiplos obstáculos mantendo estabilidade do corpo.",

    "contribuicoes": "1) Framework de otimização de rigidez para sistemas robóticos com conformidade ativa e passiva integradas, considerando múltiplos índices de desempenho simultaneamente. 2) Modelo cinemático completo para rover com rodas e pernas (TAWL) com 20 DoFs e molas passivas em configuração série-paralelo híbrida. 3) Derivação de quatro índices de desempenho: coeficiente de deformação, coeficiente de capacidade de carga, coeficiente de distribuição ACE e coeficiente de estabilidade dinâmica. 4) Aplicação do método de atlas de desempenho para otimização multi-objetivo com visualização intuitiva em gráficos polares, permitindo identificação da região ótima global. 5) Comparação sistemática entre métodos de otimização: weighted sum, Pareto/NSGA e atlas de desempenho, demonstrando trade-offs entre complexidade, taxa de sucesso e visualização. 6) Validação experimental em protótipo físico TAWL com dois terrenos diferentes (inclinações de 20° e 30°), confirmando que combinação de rigidez próxima ao design otimizado apresenta melhor desempenho. 7) Formulação do coeficiente de desempenho global ηave para avaliação abrangente do sistema considerando todos os índices normalizados.",

    "limitacoes": "Incapacidade de adquirir molas com rigidez exatamente igual aos valores otimizados teoricamente - experimentos realizados com combinações de rigidez disponíveis comercialmente mais próximas. Método de atlas de desempenho possui maior complexidade computacional O(m^n) devido à exploração exaustiva do espaço de soluções. Análise limitada a dois terrenos específicos com geometrias predefinidas. Trabalhos futuros necessários para: (i) métodos de controle mais complexos, (ii) parâmetros de rigidez ótima variáveis em tempo real, (iii) experimentos robustos com protótipos físicos para aplicações planetárias reais. Modelo assume molas lineares ideais sem histerese ou efeitos não-lineares. Coeficientes de ponderação no índice global ηave assumidos iguais (sem priorização explícita entre objetivos).",

    "topico": "Wheeled-Legged Rover, Stiffness Optimization, Active Compliance, Passive Compliance, Performance Atlas Method, Multi-Objective Optimization, Terrain Adaptation, Kinematic Modeling, Series-Parallel Hybrid System, Suspension Design, Deformation Capability, Load Capacity, Dynamic Stability, ACE Distribution, Zero Moment Point (ZMP), Impedance Control, Spring Stiffness, Compliance Control, Mobile Robots, Planetary Rovers, Locomotion, Mechanism Design, Robot Dynamics, Pareto Optimization, Genetic Algorithm, Interior-Point Algorithm",
    "area_aplicacao": "Planetary Exploration, Mobile Robotics, Wheeled-Legged Robots, Terrain-Adaptive Vehicles, Search and Rescue Robots, Field Robotics, Space Exploration, Rough Terrain Navigation, Agricultural Robots, Mining Robots, Construction Robots, Military Robots, Autonomous Vehicles, Compliant Robots",

    "tipo_dados": "Dados experimentais de protótipo físico TAWL: altura do corpo (mm), ângulo de pitch (°), variação total das juntas (°), desvio de força (N), variação das molas (mm), posições das pernas, forças de contato roda-terreno",
    "dataset": "Não aplicável - experimentos com protótipo físico TAWL (Terrain-Adaptive Wheel-Legged rover) em dois terrenos artificiais com inclinações de 20° e 30°",
    "frameworks": "MATLAB (cálculos numéricos, otimização multi-objetivo, visualização de atlas de desempenho), Algoritmo de ponto interior (interior-point), NSGA (Non-dominated Sorting Genetic Algorithm), Controle de impedância para conformidade ativa, Sensores de força para medição de forças de contato, Encoders para medição de posição das juntas",
    "link_codigo": "Não disponível (No data was used for the research described in the article)"
  },
  {
    "numero": 50,
    "nome_arquivo": "Tac-scope_ An endoscope integrated with soft sensor for real-time tactile feedback.pdf",

    "autores": "Yingxuan Zhang; Qi Jiang; Feiwen Wang; Jie Wang; Maosheng Ye; Dongxuan Li",
    "ano": 2024,
    "titulo": "Tac-scope: An endoscope integrated with soft sensor for real-time tactile feedback",
    "subtitulo": "",
    "journal": "Measurement",
    "publisher": "Elsevier",

    "objetivo": "Propor um endoscópio flexível com feedback tátil em tempo real (Tac-scope) que integra um sensor soft na extremidade embarcado com grade de Bragg em fibra óptica (FBG) para detectar a força de contato com a parede do lúmen, mantendo a função original do endoscópio. O trabalho visa melhorar a segurança da cirurgia endoscópica através de detecção de força e orientação de contato em tempo real.",

    "metodologia": "Design estrutural de sensor de 3 camadas: tampa terminal (aço inoxidável), camada soft de polidimetilsiloxano (PDMS, dureza 30 HA, espessura 5mm), e placa intermediária. Quatro fibras ópticas com FBG suspensas na camada soft (comprimento de onda central 1545nm, comprimento de grade 5mm) + um FBG livre de estresse a 1cm de distância para compensação de temperatura. Diâmetro total de apenas 6mm, permitindo integração de lente e guias de luz, e passagem de ferramentas de biópsia. Análise teórica: modelo de deformação axial das fibras relacionando deslocamento de comprimento de onda de Bragg com força normal Fn e orientação α. Análise por elementos finitos (FE) usando modelo Mooney-Rivlin para PDMS, fibras pré-tensionadas com 1N, forças de 0-1.5N aplicadas em intervalos de 0.25N em 16 orientações (intervalos de 22.5°). Fabricação: partes rígidas em resina por manufatura aditiva, partes soft em silicone por infusão em molde. Sistema de pré-tensionamento com pesos de 100g e polia para garantir tensão uniforme nas fibras. Calibração com estágio motorizado linear (NSS120-S450), estágio rotativo (REG25), sensor de força Taiyo (DY LY-108 5N), placa de aquisição NI (USB-6001), demodulador FBG (M4151-16-25). Compensação de temperatura: aquecimento de temperatura ambiente até 40°C em estufa (DHG-9145A), medição de coeficientes de sensibilidade térmica (13.19-15.29 pm/°C). Verificação: 12 grupos de testes com força e orientação aleatórias (0-1.5N, 0-360°). Testes em modelo bronquial transparente de 4 estágios com braço contínuo flexível de 1 DoF. Testes em pulmões suínos in vitro.",

    "analise_estatistica": "Métricas de desempenho do sensor: Linearidade R²=0.991, erro de repetibilidade 6.46% (média de 16 orientações: 5.73%-7.68%), erro de histerese médio 6.76%, RMSE=0.0211nm, resolução=8.8mN, sensibilidade=0.693nm/N, erro médio de força=4.4% (0.067N), erro de orientação=3.57% (0.67mm). Curvas trigonométricas ajustadas para relação orientação-wavelength shift com R² de 0.984-0.993 e RMSE de 0.063-0.093. Coeficientes de sensibilidade térmica dos FBGs: 13.41, 15.29, 13.19, 13.67 pm/°C com R²>0.9987. Erros de compensação de temperatura: 1.02%-5.49%, variância média 6.03pm. Tempo de resposta do sensor: ~40ms, tempo de cálculo do programa: ~36ms, tempo total de feedback visual-tátil: <120ms. Comparação com outros sensores: erro 4.4% (vs 5.3-16% literatura), sensibilidade 0.69nm/N (vs 0.47-1.30nm/N), resolução 8.8mN (vs 1.19mN-1kPa). Testes em modelo bronquial: redução média de 60% na força de contato com feedback tátil vs apenas visão, redução média de 30% no tempo de operação. Robustez temporal: testes após 5 meses mostram detecção estável sem mudança discernível em sensibilidade ou outras propriedades. Mais de 900 testes realizados durante período experimental, intervalo mais longo entre testes >1 ano.",

    "resultados": "Sensor Tac-scope validado teoricamente, por simulação FE e experimentalmente para detecção de força e orientação de contato. Simulação FE confirma relação linear força-deformação e padrão senoidal orientação-deformação consistente com teoria. Calibração experimental em 16 orientações (0°-337.5°) confirma linearidade e repetibilidade. Compensação de temperatura bem-sucedida para operação in vivo (30-40°C). Verificação com força/orientação aleatórias mostra boa concordância entre valores detectados e reais. Testes em modelo bronquial demonstram capacidade de operar em ambiente luminal complexo: sensor identifica magnitude e orientação de força em pontos críticos (P1, P2, destino). Com feedback tátil-visual: força de contato reduzida em 60%, tempo de operação reduzido em 30% comparado a apenas visão. Orientações de contato concentradas no lado externo da curva devido ao único DoF de flexão. Testes em pulmões suínos in vitro confirmam eficácia para detecção de tecido bronquial real: forças de contato em níveis baixos comparáveis ao modelo. Interface de feedback tátil-visual implementada usando círculos de cores ao redor do campo visual endoscópico: verde escuro (sem contato), verde claro (0-0.25N), amarelo (0.25-0.5N), vermelho (>0.5N). Tempo total de feedback <120ms permite ao cirurgião adaptar e realizar procedimento com segurança e eficiência.",

    "contribuicoes": "1) Endoscópio flexível com sensor tátil soft integrado na extremidade (Tac-scope) para detecção de força de contato e feedback em tempo real, mantendo funções originais do endoscópio (lente, guias de luz, canal de biópsia). 2) Design de sensor de 3 camadas com 4 FBGs suspensos em camada PDMS para detecção de magnitude (0-1.5N) e orientação (0-360°) de força de contato. 3) Modelo teórico relacionando deslocamentos de comprimento de onda dos FBGs com força e orientação, validado por simulação FE. 4) Método de compensação de temperatura usando FBG livre de estresse para operação in vivo. 5) Interface de feedback tátil-visual intuitiva usando círculos de cores codificados por força ao redor do campo visual endoscópico, evitando fadiga cognitiva. 6) Demonstração de melhoria significativa em segurança (60% redução de força) e eficiência (30% redução de tempo) com feedback tátil comparado a apenas visão. 7) Validação em modelo bronquial e pulmões suínos in vitro demonstrando aplicabilidade clínica. 8) Robustez temporal comprovada: sensor funciona após 5 meses e >900 testes sem degradação de desempenho.",

    "limitacoes": "Informação de dureza de tumor não fornecida - trabalho futuro incluirá localização precisa de tumores subcutâneos via palpação de dureza com pinças de biópsia. Primeira geração de sensor fabricada a baixo custo sem encapsulamento estrito e sem uso de materiais esterilizáveis - versão futura usará aço inoxidável ao invés de resina e PTFE para encapsulamento. Demodulador FBG de 16 canais não é pequeno o suficiente para integração em robô cirúrgico - versão de 4 canais reduzirá tamanho em fator de 3-4. Teste limitado a modelo bronquial e pulmões suínos in vitro - validação clínica in vivo necessária. Braço contínuo usado nos testes possui apenas 1 DoF de flexão, resultando em orientações de contato concentradas. Digital twin de robô cirúrgico baseado em sensoriamento multimodal planejado para trabalho futuro.",

    "topico": "Endoscope, Tactile Sensor, Force Detection, Orientation Detection, Tactile-Vision Feedback, Fiber Bragg Grating (FBG), Soft Sensor, PDMS, Real-time Feedback, Minimally Invasive Surgery, Natural Orifice Transluminal Endoscopic Surgery (NOTES), Robot-Assisted Endoscopic Surgery (RAES), Bronchoscopy, Contact Sensing, Temperature Compensation, Wavelength Shift, Strain Sensing, Surgical Safety, Human-Robot Interaction, Medical Robotics, Finite Element Analysis, Calibration",
    "area_aplicacao": "Minimally Invasive Surgery, Endoscopic Surgery, Bronchoscopy, Natural Orifice Transluminal Endoscopic Surgery (NOTES), Robot-Assisted Surgery (RAS), Transurethral Surgery, Vaginal Endoscopic Surgery, Gastrointestinal Endoscopy, Tracheal Intubation, Medical Robotics, Surgical Training, Biopsy Procedures",

    "tipo_dados": "Deslocamentos de comprimento de onda FBG (nm), força de contato (N), orientação de contato (°), deformação axial de fibras, temperatura (°C), dados de calibração, imagens endoscópicas, séries temporais de força e orientação durante navegação bronquial",
    "dataset": "Não disponível (dados confidenciais) - experimentos em modelo bronquial transparente de 4 estágios e pulmões suínos in vitro",
    "frameworks": "Demodulador FBG M4151-16-25 (Shenzhen Guangchi), Sensor de força Taiyo DY LY-108 5N, Placa de aquisição NI USB-6001, Estágio linear motorizado NSS120-S450, Estágio rotativo REG25, Estágios manuais LGX60-C e LY60LM, Estufa DHG-9145A, Manufatura aditiva (resina 8200pro WeNext), Infusão em molde (silicone 30HA WeNext), Software de interface tátil-visual com círculos de cores",
    "link_codigo": "Não disponível (The data that has been used is confidential)"
  }
]
